[{"header": "", "verse": "Psalms 1", "text": "The Way of the Righteous and the Wicked\n1:1 Blessed is the man\n  who walks not in the counsel of the wicked,\nnor stands in the way of sinners,\n  nor sits in the seat of scoffers;\n2but his delight is in the law of the LORD,\n  and on his law he meditates day and night.\n3He is like a tree\n  planted by streams of water\nthat yields its fruit in its season,\n  and its leaf does not wither.\nIn all that he does, he prospers.\n4The wicked are not so,\n  but are like chaff that the wind drives away.\n5Therefore the wicked will not stand in the judgment,\n nor sinners in the congregation of the righteous;\n6for the LORD knows the way of the righteous,\n but the way of the wicked will perish.\n"}, {"header": "     The Reign of the LORD's Anointed\n", "verse": "Psalms 2", "text": "2:1 Why do the nations rage\n  and the peoples plot in vain?\n2The kings of the earth set themselves,\n  and the rulers take counsel together,\n  against the LORD and against his Anointed,\nsaying,\n3\"Let us burst their bonds apart\n  and cast away their cords from us.\"\n4He who sits in the heavens laughs;\n  the Lord holds them in derision.\n5Then he will speak to them in his wrath,\n  and terrify them in his fury, saying,\n6\"As for me, I have set my King\n  on Zion, my holy hill.\"\n7I will tell of the decree:\nThe LORD said to me, \"You are my Son;\n today I have begotten you.\n8Ask of me, and I will make the nations your\nheritage,\n  and the ends of the earth your possession.\n9You shall break them with a rod of iron\n  and dash them in pieces like a potter's vessel.\"\n10Now therefore, O kings, be wise;\n be warned, O rulers of the earth.\n11Serve the LORD with fear,\n and rejoice with trembling.\n12Kiss the Son,\n lest he be angry, and you perish in the way,\n for his wrath is quickly kindled.\nBlessed are all who take refuge in him.\n"}, {"header": "           Save Me, O My God\n      A Psalm of David, when he fled\n          from Absalom his son.\n", "verse": "Psalms 3", "text": "3:1 O LORD, how many are my foes!\n Many are rising against me;\n2many are saying of my soul,\n there is no salvation for him in God. Selah\n3But you, O LORD, are a shield about me,\n my glory, and the lifter of my head.\n4I cried aloud to the LORD,\n and he answered me from his holy hill. Selah\n5I lay down and slept;\n I woke again, for the LORD sustained me.\n6I will not be afraid of many thousands of people\n who have set themselves against me all around.\n7Arise, O LORD!\n Save me, O my God!\nFor you strike all my enemies on the cheek;\n you break the teeth of the wicked.\n8Salvation belongs to the LORD;\n your blessing be on your people! Selah\n"}, {"header": "          Answer Me When I Call\nTo the choirmaster: with stringed instruments.\n             A Psalm of David.\n", "verse": "Psalms 4", "text": "4:1 Answer me when I call, O God of my\nrighteousness!\n  You have given me relief when I was in distress.\n  Be gracious to me and hear my prayer!\n2O men, how long shall my honor be turned into\nshame?\n   How long will you love vain words and seek after\nlies? Selah\n3But know that the LORD has set apart the godly for\nhimself;\n   the LORD hears when I call to him.\n4Be angry, and do not sin;\n  ponder in your own hearts on your beds, and be\nsilent. Selah\n5Offer right sacrifices,\n  and put your trust in the LORD.\n6There are many who say, \"Who will show us some\ngood?\n  Lift up the light of your face upon us, O LORD!\"\n7You have put more joy in my heart\n  than they have when their grain and wine abound.\n8In peace I will both lie down and sleep;\n for you alone, O LORD, make me dwell in safety.\n"}, {"header": "     Lead Me in Your Righteousness\nTo the choirmaster: for the flutes. A Psalm of\n", "verse": "Psalms 5", "text": "                   David.\n5:1 Give ear to my words, O LORD;\n consider my groaning.\n2Give attention to the sound of my cry,\n my King and my God,\n for to you do I pray.\n3O LORD, in the morning you hear my voice;\n in the morning I prepare a sacrifice for you and\nwatch.\n4For you are not a God who delights in wickedness;\n evil may not dwell with you.\n5The boastful shall not stand before your eyes;\n you hate all evildoers.\n6You destroy those who speak lies;\n the LORD abhors the bloodthirsty and deceitful\nman.\n7But I, through the abundance of your steadfast love,\n  will enter your house.\nI will bow down toward your holy temple\n  in the fear of you.\n8Lead me, O LORD, in your righteousness\n  because of my enemies;\n  make your way straight before me.\n9For there is no truth in their mouth;\n  their inmost self is destruction;\ntheir throat is an open grave;\n  they flatter with their tongue.\n10Make them bear their guilt, O God;\n  let them fall by their own counsels;\nbecause of the abundance of their transgressions\ncast them out,\n  for they have rebelled against you.\n11But let all who take refuge in you rejoice;\n  let them ever sing for joy,\nand spread your protection over them,\n  that those who love your name may exult in you.\n12For you bless the righteous, O LORD;\nyou cover him with favor as with a shield.\n"}, {"header": "         O LORD, Deliver My Life\nTo the choirmaster: with stringed instruments;\n        according to The Sheminith.\n            A Psalm of David.\n", "verse": "Psalms 6", "text": "6:1 O LORD, rebuke me not in your anger,\n nor discipline me in your wrath.\n2Be gracious to me, O LORD, for I am languishing;\n heal me, O LORD, for my bones are troubled.\n3My soul also is greatly troubled.\n But you, O LORD-how long?\n4Turn, O LORD, deliver my life;\n save me for the sake of your steadfast love.\n5For in death there is no remembrance of you;\n in Sheol who will give you praise?\n6I am weary with my moaning;\n every night I flood my bed with tears;\n I drench my couch with my weeping.\n7My eye wastes away because of grief;\n it grows weak because of all my foes.\n8Depart from me, all you workers of evil,\n for the LORD has heard the sound of my weeping.\n9The LORD has heard my plea;\n the LORD accepts my prayer.\n10All my enemies shall be ashamed and greatly\ntroubled;\n  they shall turn back and be put to shame in a\nmoment.\n"}, {"header": "            In You Do I Take Refuge\n A Shiggaion of David, which he sang to\n the LORD concerning the words of Cush, a\n", "verse": "Psalms 7", "text": "               Benjaminite.\n7:1 O LORD my God, in you do I take refuge;\n save me from all my pursuers and deliver me,\n2lest like a lion they tear my soul apart,\n rending it in pieces, with none to deliver.\n3O LORD my God, if I have done this,\n if there is wrong in my hands,\n4if I have repaid my friend with evil\n or plundered my enemy without cause,\n5let the enemy pursue my soul and overtake it,\n and let him trample my life to the ground\n and lay my glory in the dust. Selah\n6Arise, O LORD, in your anger;\n lift yourself up against the fury of my enemies;\n awake for me; you have appointed a judgment.\n7Let the assembly of the peoples be gathered about\nyou;\n  over it return on high.\n8The LORD judges the peoples;\n  judge me, O LORD, according to my\nrighteousness\n  and according to the integrity that is in me.\n9Oh, let the evil of the wicked come to an end,\n  and may you establish the righteous-\nyou who test the minds and hearts,\n  O righteous God!\n10My shield is with God,\n  who saves the upright in heart.\n11God is a righteous judge,\n  and a God who feels indignation every day.\n12If a man does not repent, God will whet his\nsword;\n  he has bent and readied his bow;\n13he has prepared for him his deadly weapons,\n  making his arrows fiery shafts.\n14Behold, the wicked man conceives evil\n  and is pregnant with mischief\n  and gives birth to lies.\n15He makes a pit, digging it out,\n  and falls into the hole that he has made.\n16His mischief returns upon his own head,\n  and on his own skull his violence descends.\n17I will give to the LORD the thanks due to his\nrighteousness,\n  and I will sing praise to the name of the LORD, the\nMost High.\n"}, {"header": "        How Majestic Is Your Name\n     To the choirmaster: according to The\n        Gittith. A Psalm of David.\n", "verse": "Psalms 8", "text": "8:1 O LORD, our Lord,\n  how majestic is your name in all the earth!\nYou have set your glory above the heavens.\n  2Out of the mouth of babies and infants,\nyou have established strength because of your foes,\n  to still the enemy and the avenger.\n3When I look at your heavens, the work of your\nfingers,\n   the moon and the stars, which you have set in\nplace,\n4what is man that you are mindful of him,\n   and the son of man that you care for him?\n5Yet you have made him a little lower than the\nheavenly beings\n and crowned him with glory and honor.\n6You have given him dominion over the works of your\nhands;\n  you have put all things under his feet,\n7all sheep and oxen,\n  and also the beasts of the field,\n8the birds of the heavens, and the fish of the sea,\n  whatever passes along the paths of the seas.\n9O LORD, our Lord,\n how majestic is your name in all the earth!\n"}, {"header": "   I Will Recount Your Wonderful Deeds\n     To the choirmaster: according to Muth-\n        labben. A Psalm of David.\n", "verse": "Psalms 9", "text": "9:1 I will give thanks to the LORD with my whole\nheart;\n  I will recount all of your wonderful deeds.\n2I will be glad and exult in you;\n  I will sing praise to your name, O Most High.\n3When my enemies turn back,\n  they stumble and perish before your presence.\n4For you have maintained my just cause;\n  you have sat on the throne, giving righteous\njudgment.\n5You have rebuked the nations; you have made the\nwicked perish;\n  you have blotted out their name forever and ever.\n6The enemy came to an end in everlasting ruins;\n  their cities you rooted out;\n the very memory of them has perished.\n7But the LORD sits enthroned forever;\n he has established his throne for justice,\n8and he judges the world with righteousness;\n he judges the peoples with uprightness.\n9The LORD is a stronghold for the oppressed,\n a stronghold in times of trouble.\n10And those who know your name put their trust in\nyou,\n  for you, O LORD, have not forsaken those who\nseek you.\n11Sing praises to the LORD, who sits enthroned in\nZion!\n  Tell among the peoples his deeds!\n12For he who avenges blood is mindful of them;\n  he does not forget the cry of the afflicted.\n13Be gracious to me, O LORD!\n See my affliction from those who hate me,\n O you who lift me up from the gates of death,\n14that I may recount all your praises,\n that in the gates of the daughter of Zion\n I may rejoice in your salvation.\n15The nations have sunk in the pit that they made;\n  in the net that they hid, their own foot has been\ncaught.\n16The LORD has made himself known; he has\nexecuted judgment;\n  the wicked are snared in the work of their own\nhands. Higgaion. Selah\n17The wicked shall return to Sheol,\n all the nations that forget God.\n18For the needy shall not always be forgotten,\n and the hope of the poor shall not perish forever.\n19Arise, O LORD!    Let not man prevail;\n  let the nations be judged before you!\n20Put them in fear, O LORD!\n  Let the nations know that they are but men! Selah\n"}, {"header": "         Why Do You Hide Yourself?\n", "verse": "Psalms 10", "text": "10:1 Why, O LORD, do you stand far away?\n Why do you hide yourself in times of trouble?\n2In arrogance the wicked hotly pursue the poor;\n  let them be caught in the schemes that they have\ndevised.\n3For the wicked boasts of the desires of his soul,\n  and the one greedy for gain curses and\nrenounces the LORD.\n4In the pride of his face the wicked does not seek\nhim;\n  all his thoughts are, \"There is no God.\"\n5His ways prosper at all times;\n  your judgments are on high, out of his sight;\n  as for all his foes, he puffs at them.\n6He says in his heart, \"I shall not be moved;\n  throughout all generations I shall not meet\nadversity.\"\n7His mouth is filled with cursing and deceit and\noppression;\n under his tongue are mischief and iniquity.\n8He sits in ambush in the villages;\n  in hiding places he murders the innocent.\nHis eyes stealthily watch for the helpless;\n  9he lurks in ambush like a lion in his thicket;\nhe lurks that he may seize the poor;\n  he seizes the poor when he draws him into his net.\n10The helpless are crushed, sink down,\n  and fall by his might.\n11He says in his heart, \"God has forgotten,\n  he has hidden his face, he will never see it.\"\n12Arise, O LORD; O God, lift up your hand;\n forget not the afflicted.\n13Why does the wicked renounce God\n and say in his heart, \"You will not call to account\"?\n14But you do see, for you note mischief and vexation,\n  that you may take it into your hands;\nto you the helpless commits himself;\n  you have been the helper of the fatherless.\n15Break the arm of the wicked and evildoer;\n  call his wickedness to account till you find none.\n16The LORD is king forever and ever;\n the nations perish from his land.\n17O LORD, you hear the desire of the afflicted;\n  you will strengthen their heart; you will incline your\near\n18to do justice to the fatherless and the oppressed,\n  so that man who is of the earth may strike terror no\nmore.\n"}, {"header": "      The LORD Is in His Holy Temple\n        To the choirmaster. Of David.\n", "verse": "Psalms 11", "text": "11:1 In the LORD I take refuge;\nhow can you say to my soul,\n  \"Flee like a bird to your mountain,\n2for behold, the wicked bend the bow;\n  they have fitted their arrow to the string\n  to shoot in the dark at the upright in heart;\n3if the foundations are destroyed,\n  what can the righteous do?\"\n4The LORD is in his holy temple;\n  the LORD's throne is in heaven;\n  his eyes see, his eyelids test the children of man.\n5The LORD tests the righteous,\n  but his soul hates the wicked and the one who\nloves violence.\n6Let him rain coals on the wicked;\n  fire and sulfur and a scorching wind shall be the\nportion of their cup.\n7For the LORD is righteous;\nhe loves righteous deeds;\n the upright shall behold his face.\n"}, {"header": "        The Faithful Have Vanished\n     To the choirmaster: according to The\n      Sheminith. A Psalm of David.\n", "verse": "Psalms 12", "text": "12:1 Save, O LORD, for the godly one is gone;\n  for the faithful have vanished from among the\nchildren of man.\n2Everyone utters lies to his neighbor;\n  with flattering lips and a double heart they speak.\n3May the LORD cut off all flattering lips,\n the tongue that makes great boasts,\n4those who say, \"With our tongue we will prevail,\n our lips are with us; who is master over us?\"\n5\"Because the poor are plundered, because the\nneedy groan,\n  I will now arise,\" says the LORD;\n  \"I will place him in the safety for which he longs.\"\n6The words of the LORD are pure words,\n  like silver refined in a furnace on the ground,\n purified seven times.\n7You, O LORD, will keep them;\n  you will guard us from this generation forever.\n8On every side the wicked prowl,\n as vileness is exalted among the children of man.\n"}, {"header": "            How Long, O LORD?\n    To the choirmaster. A Psalm of David.\n", "verse": "Psalms 13", "text": "13:1 How long, O LORD? Will you forget me\nforever?\n  How long will you hide your face from me?\n2How long must I take counsel in my soul\n  and have sorrow in my heart all the day?\nHow long shall my enemy be exalted over me?\n3Consider and answer me, O LORD my God;\n light up my eyes, lest I sleep the sleep of death,\n4lest my enemy say, \"I have prevailed over him,\"\n lest my foes rejoice because I am shaken.\n5But I have trusted in your steadfast love;\n my heart shall rejoice in your salvation.\n6I will sing to the LORD,\n because he has dealt bountifully with me.\n"}, {"header": "       The Fool Says, There Is No God\n        To the choirmaster. Of David.\n", "verse": "Psalms 14", "text": "14:1 The fool says in his heart, \"There is no God.\"\n They are corrupt, they do abominable deeds,\n there is none who does good.\n2The LORD looks down from heaven on the children\nof man,\n  to see if there are any who understand,\n  who seek after God.\n3They have all turned aside; together they have\nbecome corrupt;\n there is none who does good,\n not even one.\n4Have they no knowledge, all the evildoers\n who eat up my people as they eat bread\n and do not call upon the LORD?\n5There they are in great terror,\n for God is with the generation of the righteous.\n6You would shame the plans of the poor,\n  but the LORD is his refuge.\n7Oh, that salvation for Israel would come out of Zion!\n When the LORD restores the fortunes of his\npeople,\n let Jacob rejoice, let Israel be glad.\n"}, {"header": "    Who Shall Dwell on Your Holy Hill?\n           A Psalm of David.\n", "verse": "Psalms 15", "text": "15:1 O LORD, who shall sojourn in your tent?\n Who shall dwell on your holy hill?\n2He who walks blamelessly and does what is right\n and speaks truth in his heart;\n3who does not slander with his tongue\n  and does no evil to his neighbor,\n  nor takes up a reproach against his friend;\n4in whose eyes a vile person is despised,\n  but who honors those who fear the LORD;\nwho swears to his own hurt and does not change;\n5who does not put out his money at interest\n  and does not take a bribe against the innocent.\nHe who does these things shall never be moved.\n"}, {"header": "        You Will Not Abandon My Soul\n              A Miktam of David.\n", "verse": "Psalms 16", "text": "16:1 Preserve me, O God, for in you I take refuge.\n2I say to the LORD, \"You are my Lord;\n I have no good apart from you.\"\n3As for the saints in the land, they are the excellent\nones,\n in whom is all my delight.\n4The sorrows of those who run after another god\nshall multiply;\n  their drink offerings of blood I will not pour out\n  or take their names on my lips.\n5The LORD is my chosen portion and my cup;\n you hold my lot.\n6The lines have fallen for me in pleasant places;\n indeed, I have a beautiful inheritance.\n7I bless the LORD who gives me counsel;\n  in the night also my heart instructs me.\n8I have set the LORD always before me;\n  because he is at my right hand, I shall not be\nshaken.\n9Therefore my heart is glad, and my whole being\nrejoices;\n  my flesh also dwells secure.\n10For you will not abandon my soul to Sheol,\n  or let your holy one see corruption.\n11You make known to me the path of life;\n in your presence there is fullness of joy;\n at your right hand are pleasures forevermore.\n"}, {"header": "        In the Shadow of Your Wings\n              A Prayer of David.\n", "verse": "Psalms 17", "text": "17:1 Hear a just cause, O LORD; attend to my cry!\n Give ear to my prayer from lips free of deceit!\n2From your presence let my vindication come!\n Let your eyes behold the right!\n3You have tried my heart, you have visited me by\nnight,\n  you have tested me, and you will find nothing;\n  I have purposed that my mouth will not transgress.\n4With regard to the works of man, by the word of\nyour lips\n  I have avoided the ways of the violent.\n5My steps have held fast to your paths;\n  my feet have not slipped.\n6I call upon you, for you will answer me, O God;\n incline your ear to me; hear my words.\n7Wondrously show your steadfast love,\n O Savior of those who seek refuge\n from their adversaries at your right hand.\n8Keep me as the apple of your eye;\n hide me in the shadow of your wings,\n9from the wicked who do me violence,\n my deadly enemies who surround me.\n10They close their hearts to pity;\n with their mouths they speak arrogantly.\n11They have now surrounded our steps;\n they set their eyes to cast us to the ground.\n12He is like a lion eager to tear,\n as a young lion lurking in ambush.\n13Arise, O LORD!     Confront him, subdue him!\n   Deliver my soul from the wicked by your sword,\n14from men by your hand, O LORD,\n   from men of the world whose portion is in this\nlife.\nYou fill their womb with treasure;\n   they are satisfied with children,\n   and they leave their abundance to their infants.\n15As for me, I shall behold your face in\nrighteousness;\n   when I awake, I shall be satisfied with your\nlikeness.\n The LORD Is My Rock and My Fortress\n"}, {"header": "  To the choirmaster. A Psalm of David, the\n   servant of the LORD, who addressed the\n  words of this song to the LORD on the day\nwhen the LORD rescued him from the hand of\nall his enemies, and from the hand of Saul. He\n", "verse": "Psalms 18", "text": "                     said:\n18:1 I love you, O LORD, my strength.\n2The LORD is my rock and my fortress and my\ndeliverer,\n  my God, my rock, in whom I take refuge,\n  my shield, and the horn of my salvation, my\nstronghold.\n3I call upon the LORD, who is worthy to be praised,\n  and I am saved from my enemies.\n4The cords of death encompassed me;\n the torrents of destruction assailed me;\n5the cords of Sheol entangled me;\n the snares of death confronted me.\n6In my distress I called upon the LORD;\n to my God I cried for help.\nFrom his temple he heard my voice,\n and my cry to him reached his ears.\n7Then the earth reeled and rocked;\n  the foundations also of the mountains trembled\n  and quaked, because he was angry.\n8Smoke went up from his nostrils,\n  and devouring fire from his mouth;\n  glowing coals flamed forth from him.\n9He bowed the heavens and came down;\n  thick darkness was under his feet.\n10He rode on a cherub and flew;\n  he came swiftly on the wings of the wind.\n11He made darkness his covering, his canopy\naround him,\n  thick clouds dark with water.\n12Out of the brightness before him\n  hailstones and coals of fire broke through his\nclouds.\n13The LORD also thundered in the heavens,\n  and the Most High uttered his voice,\n  hailstones and coals of fire.\n14And he sent out his arrows and scattered them;\n  he flashed forth lightnings and routed them.\n15Then the channels of the sea were seen,\n  and the foundations of the world were laid bare\nat your rebuke, O LORD,\n  at the blast of the breath of your nostrils.\n16He sent from on high, he took me;\n he drew me out of many waters.\n17He rescued me from my strong enemy\n  and from those who hated me,\n  for they were too mighty for me.\n18They confronted me in the day of my calamity,\n  but the LORD was my support.\n19He brought me out into a broad place;\n  he rescued me, because he delighted in me.\n20The LORD dealt with me according to my\nrighteousness;\n  according to the cleanness of my hands he\nrewarded me.\n21For I have kept the ways of the LORD,\n  and have not wickedly departed from my God.\n22For all his rules were before me,\n  and his statutes I did not put away from me.\n23I was blameless before him,\n  and I kept myself from my guilt.\n24So the LORD has rewarded me according to my\nrighteousness,\n  according to the cleanness of my hands in his\nsight.\n25With the merciful you show yourself merciful;\n  with the blameless man you show yourself\nblameless;\n26with the purified you show yourself pure;\n  and with the crooked you make yourself seem\ntortuous.\n27For you save a humble people,\n  but the haughty eyes you bring down.\n28For it is you who light my lamp;\n  the LORD my God lightens my darkness.\n29For by you I can run against a troop,\n and by my God I can leap over a wall.\n30This God-his way is perfect;\n the word of the LORD proves true;\n he is a shield for all those who take refuge in him.\n31For who is God, but the LORD?\n And who is a rock, except our God?-\n32the God who equipped me with strength\n and made my way blameless.\n33He made my feet like the feet of a deer\n and set me secure on the heights.\n34He trains my hands for war,\n so that my arms can bend a bow of bronze.\n35You have given me the shield of your salvation,\n  and your right hand supported me,\n  and your gentleness made me great.\n36You gave a wide place for my steps under me,\n  and my feet did not slip.\n37I pursued my enemies and overtook them,\n  and did not turn back till they were consumed.\n38I thrust them through, so that they were not able to\nrise;\n  they fell under my feet.\n39For you equipped me with strength for the battle;\n  you made those who rise against me sink under\nme.\n40You made my enemies turn their backs to me,\n  and those who hated me I destroyed.\n41They cried for help, but there was none to save;\n  they cried to the LORD, but he did not answer\nthem.\n42I beat them fine as dust before the wind;\n  I cast them out like the mire of the streets.\n43You delivered me from strife with the people;\n  you made me the head of the nations;\n  people whom I had not known served me.\n44As soon as they heard of me they obeyed me;\n  foreigners came cringing to me.\n45Foreigners lost heart\n  and came trembling out of their fortresses.\n46The LORD lives, and blessed be my rock,\n and exalted be the God of my salvation-\n47the God who gave me vengeance\n and subdued peoples under me,\n48who delivered me from my enemies;\n yes, you exalted me above those who rose against\nme;\n you rescued me from the man of violence.\n49For this I will praise you, O LORD, among the\nnations,\n  and sing to your name.\n50Great salvation he brings to his king,\n  and shows steadfast love to his anointed,\n  to David and his offspring forever.\n"}, {"header": "     The Law of the LORD Is Perfect\n    To the choirmaster. A Psalm of David.\n", "verse": "Psalms 19", "text": "19:1 The heavens declare the glory of God,\n and the sky above proclaims his handiwork.\n2Day to day pours out speech,\n and night to night reveals knowledge.\n3There is no speech, nor are there words,\n whose voice is not heard.\n4Their voice goes out through all the earth,\n   and their words to the end of the world.\nIn them he has set a tent for the sun,\n   5which comes out like a bridegroom leaving his\nchamber,\n   and, like a strong man, runs its course with joy.\n6Its rising is from the end of the heavens,\n   and its circuit to the end of them,\n   and there is nothing hidden from its heat.\n7The law of the LORD is perfect,\n  reviving the soul;\nthe testimony of the LORD is sure,\n making wise the simple;\n8the precepts of the LORD are right,\n  rejoicing the heart;\nthe commandment of the LORD is pure,\n  enlightening the eyes;\n9the fear of the LORD is clean,\n  enduring forever;\nthe rules of the LORD are true,\n  and righteous altogether.\n10More to be desired are they than gold,\n  even much fine gold;\nsweeter also than honey\n  and drippings of the honeycomb.\n11Moreover, by them is your servant warned;\n  in keeping them there is great reward.\n12Who can discern his errors?\n Declare me innocent from hidden faults.\n13Keep back your servant also from presumptuous\nsins;\n  let them not have dominion over me!\nThen I shall be blameless,\n  and innocent of great transgression.\n14Let the words of my mouth and the meditation of\nmy heart\n be acceptable in your sight,\n O LORD, my rock and my redeemer.\n Trust in the Name of the LORD Our God\n"}, {"header": "   To the choirmaster. A Psalm of David.\n", "verse": "Psalms 20", "text": "20:1 May the LORD answer you in the day of\ntrouble!\n  May the name of the God of Jacob protect you!\n2May he send you help from the sanctuary\n  and give you support from Zion!\n3May he remember all your offerings\n  and regard with favor your burnt sacrifices! Selah\n4May he grant you your heart's desire\n and fulfill all your plans!\n5May we shout for joy over your salvation,\n and in the name of our God set up our banners!\nMay the LORD fulfill all your petitions!\n6Now I know that the LORD saves his anointed;\n he will answer him from his holy heaven\n with the saving might of his right hand.\n7Some trust in chariots and some in horses,\n but we trust in the name of the LORD our God.\n8They collapse and fall,\n but we rise and stand upright.\n9O LORD, save the king!\n May he answer us when we call.\nThe King Rejoices in the LORD's Strength\n"}, {"header": "   To the choirmaster. A Psalm of David.\n", "verse": "Psalms 21", "text": "21:1 O LORD, in your strength the king rejoices,\n and in your salvation how greatly he exults!\n2You have given him his heart's desire\n and have not withheld the request of his lips. Selah\n3For you meet him with rich blessings;\n you set a crown of fine gold upon his head.\n4He asked life of you; you gave it to him,\n length of days forever and ever.\n5His glory is great through your salvation;\n splendor and majesty you bestow on him.\n6For you make him most blessed forever;\n you make him glad with the joy of your presence.\n7For the king trusts in the LORD,\n  and through the steadfast love of the Most High he\nshall not be moved.\n8Your hand will find out all your enemies;\n your right hand will find out those who hate you.\n9You will make them as a blazing oven\n  when you appear.\nThe LORD will swallow them up in his wrath,\n  and fire will consume them.\n10You will destroy their descendants from the earth,\n  and their offspring from among the children of man.\n11Though they plan evil against you,\n  though they devise mischief, they will not succeed.\n12For you will put them to flight;\n  you will aim at their faces with your bows.\n13Be exalted, O LORD, in your strength!\n We will sing and praise your power.\n"}, {"header": "      Why Have You Forsaken Me?\nTo the choirmaster: according to The Doe of\n        the Dawn. A Psalm of David.\n", "verse": "Psalms 22", "text": "22:1 My God, my God, why have you forsaken me?\n  Why are you so far from saving me, from the words\nof my groaning?\n2O my God, I cry by day, but you do not answer,\n  and by night, but I find no rest.\n3Yet you are holy,\n enthroned on the praises of Israel.\n4In you our fathers trusted;\n they trusted, and you delivered them.\n5To you they cried and were rescued;\n in you they trusted and were not put to shame.\n6But I am a worm and not a man,\n scorned by mankind and despised by the people.\n7All who see me mock me;\n they make mouths at me; they wag their heads;\n8\"He trusts in the LORD; let him deliver him;\n let him rescue him, for he delights in him!\"\n9Yet you are he who took me from the womb;\n you made me trust you at my mother's breasts.\n10On you was I cast from my birth,\n  and from my mother's womb you have been my\nGod.\n11Be not far from me,\n  for trouble is near,\n  and there is none to help.\n12Many bulls encompass me;\n strong bulls of Bashan surround me;\n13they open wide their mouths at me,\n like a ravening and roaring lion.\n14I am poured out like water,\n  and all my bones are out of joint;\nmy heart is like wax;\n  it is melted within my breast;\n15my strength is dried up like a potsherd,\n  and my tongue sticks to my jaws;\n you lay me in the dust of death.\n16For dogs encompass me;\n  a company of evildoers encircles me;\nthey have pierced my hands and feet-\n17I can count all my bones-\nthey stare and gloat over me;\n18they divide my garments among them,\n  and for my clothing they cast lots.\n19But you, O LORD, do not be far off!\n O you my help, come quickly to my aid!\n20Deliver my soul from the sword,\n my precious life from the power of the dog!\n 21Save me from the mouth of the lion!\nYou have rescued me from the horns of the wild\noxen!\n22I will tell of your name to my brothers;\n in the midst of the congregation I will praise you:\n23You who fear the LORD, praise him!\n All you offspring of Jacob, glorify him,\n and stand in awe of him, all you offspring of Israel!\n24For he has not despised or abhorred\n the affliction of the afflicted,\nand he has not hidden his face from him,\n but has heard, when he cried to him.\n25From you comes my praise in the great\ncongregation;\n  my vows I will perform before those who fear him.\n26The afflicted shall eat and be satisfied;\n  those who seek him shall praise the LORD!\n  May your hearts live forever!\n27All the ends of the earth shall remember\n  and turn to the LORD,\nand all the families of the nations\n  shall worship before you.\n28For kingship belongs to the LORD,\n  and he rules over the nations.\n29All the prosperous of the earth eat and worship;\n  before him shall bow all who go down to the dust,\n  even the one who could not keep himself alive.\n30Posterity shall serve him;\n  it shall be told of the Lord to the coming\ngeneration;\n31they shall come and proclaim his righteousness to\na people yet unborn,\n  that he has done it.\n"}, {"header": "          The LORD Is My Shepherd\n              A Psalm of David.\n", "verse": "Psalms 23", "text": "23:1 The LORD is my shepherd; I shall not want.\n 2He makes me lie down in green pastures.\nHe leads me beside still waters.\n 3He restores my soul.\nHe leads me in paths of righteousness\n for his name's sake.\n4Even though I walk through the valley of the shadow\nof death,\n  I will fear no evil,\nfor you are with me;\n  your rod and your staff,\n  they comfort me.\n5You prepare a table before me\n  in the presence of my enemies;\nyou anoint my head with oil;\n  my cup overflows.\n6Surely goodness and mercy shall follow me\n all the days of my life,\nand I shall dwell in the house of the LORD\n forever.\n"}, {"header": "               The King of Glory\n               A Psalm of David.\n", "verse": "Psalms 24", "text": "24:1 The earth is the LORD's and the fullness\nthereof,\n  the world and those who dwell therein,\n2for he has founded it upon the seas\n  and established it upon the rivers.\n3Who shall ascend the hill of the LORD?\n And who shall stand in his holy place?\n4He who has clean hands and a pure heart,\n who does not lift up his soul to what is false\n and does not swear deceitfully.\n5He will receive blessing from the LORD\n and righteousness from the God of his salvation.\n6Such is the generation of those who seek him,\n who seek the face of the God of Jacob. Selah\n7Lift up your heads, O gates!\n And be lifted up, O ancient doors,\n that the King of glory may come in.\n8Who is this King of glory?\n  The LORD, strong and mighty,\n  the LORD, mighty in battle!\n9Lift up your heads, O gates!\n  And lift them up, O ancient doors,\n  that the King of glory may come in.\n10Who is this King of glory?\n  The LORD of hosts,\n  he is the King of glory! Selah\n"}, {"header": "             Teach Me Your Paths\n                    Of David.\n", "verse": "Psalms 25", "text": "\n25:1 To you, O LORD, I lift up my soul.\n2O my God, in you I trust;\n  let me not be put to shame;\n  let not my enemies exult over me.\n3Indeed, none who wait for you shall be put to\nshame;\n  they shall be ashamed who are wantonly\ntreacherous.\n4Make me to know your ways, O LORD;\n teach me your paths.\n5Lead me in your truth and teach me,\n for you are the God of my salvation;\n for you I wait all the day long.\n6Remember your mercy, O LORD, and your\nsteadfast love,\n  for they have been from of old.\n7Remember not the sins of my youth or my\ntransgressions;\n  according to your steadfast love remember me,\n  for the sake of your goodness, O LORD!\n8Good and upright is the LORD;\n therefore he instructs sinners in the way.\n9He leads the humble in what is right,\n and teaches the humble his way.\n10All the paths of the LORD are steadfast love and\nfaithfulness,\n  for those who keep his covenant and his\ntestimonies.\n11For your name's sake, O LORD,\n pardon my guilt, for it is great.\n12Who is the man who fears the LORD?\n  Him will he instruct in the way that he should\nchoose.\n13His soul shall abide in well-being,\n  and his offspring shall inherit the land.\n14The friendship of the LORD is for those who\nfear him,\n  and he makes known to them his covenant.\n15My eyes are ever toward the LORD,\n for he will pluck my feet out of the net.\n16Turn to me and be gracious to me,\n for I am lonely and afflicted.\n17The troubles of my heart are enlarged;\n bring me out of my distresses.\n18Consider my affliction and my trouble,\n and forgive all my sins.\n19Consider how many are my foes,\n and with what violent hatred they hate me.\n20Oh, guard my soul, and deliver me!\n  Let me not be put to shame, for I take refuge in\nyou.\n21May integrity and uprightness preserve me,\n  for I wait for you.\n22Redeem Israel, O God,\n out of all his troubles.\n"}, {"header": "             I Will Bless the LORD\n                    Of David.\n", "verse": "Psalms 26", "text": "26:1 Vindicate me, O LORD,\n  for I have walked in my integrity,\n  and I have trusted in the LORD without wavering.\n2Prove me, O LORD, and try me;\n  test my heart and my mind.\n3For your steadfast love is before my eyes,\n  and I walk in your faithfulness.\n4I do not sit with men of falsehood,\n nor do I consort with hypocrites.\n5I hate the assembly of evildoers,\n and I will not sit with the wicked.\n6I wash my hands in innocence\n and go around your altar, O LORD,\n7proclaiming thanksgiving aloud,\n and telling all your wondrous deeds.\n8O LORD, I love the habitation of your house\n and the place where your glory dwells.\n9Do not sweep my soul away with sinners,\n nor my life with bloodthirsty men,\n10in whose hands are evil devices,\n and whose right hands are full of bribes.\n11But as for me, I shall walk in my integrity;\n redeem me, and be gracious to me.\n12My foot stands on level ground;\n in the great assembly I will bless the LORD.\nThe LORD Is My Light and My Salvation\n"}, {"header": "             Of David.\n", "verse": "Psalms 27", "text": "27:1 The LORD is my light and my salvation;\n whom shall I fear?\nThe LORD is the stronghold of my life;\n of whom shall I be afraid?\n2When evildoers assail me\n to eat up my flesh,\nmy adversaries and foes,\n it is they who stumble and fall.\n3Though an army encamp against me,\n  my heart shall not fear;\nthough war arise against me,\n  yet I will be confident.\n4One thing have I asked of the LORD,\n  that will I seek after:\nthat I may dwell in the house of the LORD\n  all the days of my life,\nto gaze upon the beauty of the LORD\n  and to inquire in his temple.\n5For he will hide me in his shelter\n in the day of trouble;\nhe will conceal me under the cover of his tent;\n he will lift me high upon a rock.\n6And now my head shall be lifted up\n  above my enemies all around me,\nand I will offer in his tent\n  sacrifices with shouts of joy;\nI will sing and make melody to the LORD.\n7Hear, O LORD, when I cry aloud;\n be gracious to me and answer me!\n8You have said, \"Seek my face.\"\nMy heart says to you,\n \"Your face, LORD, do I seek.\"\n 9Hide not your face from me.\nTurn not your servant away in anger,\n O you who have been my help.\nCast me not off; forsake me not,\n O God of my salvation!\n10For my father and my mother have forsaken me,\n but the LORD will take me in.\n11Teach me your way, O LORD,\n  and lead me on a level path\n  because of my enemies.\n12Give me not up to the will of my adversaries;\n  for false witnesses have risen against me,\n  and they breathe out violence.\n13I believe that I shall look upon the goodness of\nthe LORD\n  in the land of the living!\n14Wait for the LORD;\n  be strong, and let your heart take courage;\n  wait for the LORD!\nThe LORD Is My Strength and My Shield\n"}, {"header": "             Of David.\n", "verse": "Psalms 28", "text": "28:1 To you, O LORD, I call;\n  my rock, be not deaf to me,\nlest, if you be silent to me,\n  I become like those who go down to the pit.\n2Hear the voice of my pleas for mercy,\n  when I cry to you for help,\nwhen I lift up my hands\n  toward your most holy sanctuary.\n3Do not drag me off with the wicked,\n  with the workers of evil,\nwho speak peace with their neighbors\n  while evil is in their hearts.\n4Give to them according to their work\n  and according to the evil of their deeds;\ngive to them according to the work of their hands;\n  render them their due reward.\n5Because they do not regard the works of the LORD\n  or the work of his hands,\nhe will tear them down and build them up no more.\n6Blessed be the LORD!\n For he has heard the voice of my pleas for mercy.\n7The LORD is my strength and my shield;\n in him my heart trusts, and I am helped;\nmy heart exults,\n and with my song I give thanks to him.\n8The LORD is the strength of his people;\n he is the saving refuge of his anointed.\n9Oh, save your people and bless your heritage!\n Be their shepherd and carry them forever.\n"}, {"header": "         Ascribe to the LORD Glory\n              A Psalm of David.\n", "verse": "Psalms 29", "text": "29:1 Ascribe to the LORD, O heavenly beings,\n ascribe to the LORD glory and strength.\n2Ascribe to the LORD the glory due his name;\n worship the LORD in the splendor of holiness.\n3The voice of the LORD is over the waters;\n  the God of glory thunders,\n  the LORD, over many waters.\n4The voice of the LORD is powerful;\n  the voice of the LORD is full of majesty.\n5The voice of the LORD breaks the cedars;\n the LORD breaks the cedars of Lebanon.\n6He makes Lebanon to skip like a calf,\n and Sirion like a young wild ox.\n7The voice of the LORD flashes forth flames of fire.\n8The voice of the LORD shakes the wilderness;\n the LORD shakes the wilderness of Kadesh.\n9The voice of the LORD makes the deer give\nbirth\n and strips the forests bare,\n and in his temple all cry, \"Glory!\"\n10The LORD sits enthroned over the flood;\n the LORD sits enthroned as king forever.\n11May the LORD give strength to his people!\n  May the LORD bless his people with peace!\n"}, {"header": "      Joy Comes with the Morning\n A Psalm of David. A song at the dedication\n              of the temple.\n", "verse": "Psalms 30", "text": "30:1 I will extol you, O LORD, for you have drawn\nme up\n and have not let my foes rejoice over me.\n2O LORD my God, I cried to you for help,\n and you have healed me.\n3O LORD, you have brought up my soul from Sheol;\n you restored me to life from among those who go\ndown to the pit.\n4Sing praises to the LORD, O you his saints,\n  and give thanks to his holy name.\n5For his anger is but for a moment,\n  and his favor is for a lifetime.\nWeeping may tarry for the night,\n but joy comes with the morning.\n6As for me, I said in my prosperity,\n \"I shall never be moved.\"\n7By your favor, O LORD,\n  you made my mountain stand strong;\nyou hid your face;\n  I was dismayed.\n8To you, O LORD, I cry,\n and to the Lord I plead for mercy:\n9\"What profit is there in my death,\n  if I go down to the pit?\nWill the dust praise you?\n  Will it tell of your faithfulness?\n10Hear, O LORD, and be merciful to me!\n  O LORD, be my helper!\"\n11You have turned for me my mourning into dancing;\n  you have loosed my sackcloth\n  and clothed me with gladness,\n12that my glory may sing your praise and not be\nsilent.\n  O LORD my God, I will give thanks to you forever!\n"}, {"header": "    Into Your Hand I Commit My Spirit\n    To the choirmaster. A Psalm of David.\n", "verse": "Psalms 31", "text": "31:1 In you, O LORD, do I take refuge;\n  let me never be put to shame;\n  in your righteousness deliver me!\n2Incline your ear to me;\n  rescue me speedily!\nBe a rock of refuge for me,\n  a strong fortress to save me!\n3For you are my rock and my fortress;\n  and for your name's sake you lead me and guide\nme;\n4you take me out of the net they have hidden for me,\n  for you are my refuge.\n5Into your hand I commit my spirit;\n  you have redeemed me, O LORD, faithful God.\n6I hate those who pay regard to worthless idols,\n but I trust in the LORD.\n7I will rejoice and be glad in your steadfast love,\n  because you have seen my affliction;\n  you have known the distress of my soul,\n8and you have not delivered me into the hand of the\nenemy;\n  you have set my feet in a broad place.\n9Be gracious to me, O LORD, for I am in distress;\n  my eye is wasted from grief;\n  my soul and my body also.\n10For my life is spent with sorrow,\n  and my years with sighing;\nmy strength fails because of my iniquity,\n  and my bones waste away.\n11Because of all my adversaries I have become a\nreproach,\n  especially to my neighbors,\nand an object of dread to my acquaintances;\n  those who see me in the street flee from me.\n12I have been forgotten like one who is dead;\n  I have become like a broken vessel.\n13For I hear the whispering of many-\n  terror on every side!-\nas they scheme together against me,\n as they plot to take my life.\n14But I trust in you, O LORD;\n I say, \"You are my God.\"\n15My times are in your hand;\n  rescue me from the hand of my enemies and from\nmy persecutors!\n16Make your face shine on your servant;\n  save me in your steadfast love!\n17O LORD, let me not be put to shame,\n  for I call upon you;\nlet the wicked be put to shame;\n  let them go silently to Sheol.\n18Let the lying lips be mute,\n  which speak insolently against the righteous\n  in pride and contempt.\n19Oh, how abundant is your goodness,\n  which you have stored up for those who fear you\nand worked for those who take refuge in you,\n  in the sight of the children of mankind!\n20In the cover of your presence you hide them\n  from the plots of men;\nyou store them in your shelter\n  from the strife of tongues.\n21Blessed be the LORD,\n  for he has wondrously shown his steadfast love to\nme\n  when I was in a besieged city.\n22I had said in my alarm,\n  \"I am cut off from your sight.\"\nBut you heard the voice of my pleas for mercy\n  when I cried to you for help.\n23Love the LORD, all you his saints!\n  The LORD preserves the faithful\n  but abundantly repays the one who acts in pride.\n24Be strong, and let your heart take courage,\n  all you who wait for the LORD!\n"}, {"header": "           Blessed Are the Forgiven\n             A Maskil of David.\n", "verse": "Psalms 32", "text": "32:1 Blessed is the one whose transgression is\nforgiven,\n  whose sin is covered.\n2Blessed is the man against whom the LORD counts\nno iniquity,\n  and in whose spirit there is no deceit.\n3For when I kept silent, my bones wasted away\n through my groaning all day long.\n4For day and night your hand was heavy upon me;\n  my strength was dried up as by the heat of\nsummer. Selah\n5I acknowledged my sin to you,\n   and I did not cover my iniquity;\nI said, \"I will confess my transgressions to the\nLORD,\"\n   and you forgave the iniquity of my sin. Selah\n6Therefore let everyone who is godly\n  offer prayer to you at a time when you may be\nfound;\nsurely in the rush of great waters,\n  they shall not reach him.\n7You are a hiding place for me;\n  you preserve me from trouble;\n  you surround me with shouts of deliverance. Selah\n8I will instruct you and teach you in the way you\nshould go;\n  I will counsel you with my eye upon you.\n9Be not like a horse or a mule, without\nunderstanding,\n  which must be curbed with bit and bridle,\n  or it will not stay near you.\n10Many are the sorrows of the wicked,\n  but steadfast love surrounds the one who trusts in\nthe LORD.\n11Be glad in the LORD, and rejoice, O righteous,\n  and shout for joy, all you upright in heart!\n"}, {"header": "      The Steadfast Love of the LORD\n", "verse": "Psalms 33", "text": "33:1 Shout for joy in the LORD, O you righteous!\n Praise befits the upright.\n2Give thanks to the LORD with the lyre;\n make melody to him with the harp of ten strings!\n3Sing to him a new song;\n play skillfully on the strings, with loud shouts.\n4For the word of the LORD is upright,\n and all his work is done in faithfulness.\n5He loves righteousness and justice;\n the earth is full of the steadfast love of the LORD.\n6By the word of the LORD the heavens were made,\n and by the breath of his mouth all their host.\n7He gathers the waters of the sea as a heap;\n he puts the deeps in storehouses.\n8Let all the earth fear the LORD;\n  let all the inhabitants of the world stand in awe of\nhim!\n9For he spoke, and it came to be;\n he commanded, and it stood firm.\n10The LORD brings the counsel of the nations to\nnothing;\n  he frustrates the plans of the peoples.\n11The counsel of the LORD stands forever,\n  the plans of his heart to all generations.\n12Blessed is the nation whose God is the LORD,\n  the people whom he has chosen as his heritage!\n13The LORD looks down from heaven;\n he sees all the children of man;\n14from where he sits enthroned he looks out\n on all the inhabitants of the earth,\n15he who fashions the hearts of them all\n and observes all their deeds.\n16The king is not saved by his great army;\n a warrior is not delivered by his great strength.\n17The war horse is a false hope for salvation,\n and by its great might it cannot rescue.\n18Behold, the eye of the LORD is on those who fear\nhim,\n  on those who hope in his steadfast love,\n19that he may deliver their soul from death\n  and keep them alive in famine.\n20Our soul waits for the LORD;\n he is our help and our shield.\n21For our heart is glad in him,\n because we trust in his holy name.\n22Let your steadfast love, O LORD, be upon us,\n even as we hope in you.\n"}, {"header": "    Taste and See That the LORD Is Good\n   Of David, when he changed his behavior\n   before Abimelech, so that he drove him out,\n            and he went away.\n", "verse": "Psalms 34", "text": "34:1 I will bless the LORD at all times;\n his praise shall continually be in my mouth.\n2My soul makes its boast in the LORD;\n let the humble hear and be glad.\n3Oh, magnify the LORD with me,\n and let us exalt his name together!\n4I sought the LORD, and he answered me\n and delivered me from all my fears.\n5Those who look to him are radiant,\n and their faces shall never be ashamed.\n6This poor man cried, and the LORD heard him\n and saved him out of all his troubles.\n7The angel of the LORD encamps\n around those who fear him, and delivers them.\n8Oh, taste and see that the LORD is good!\n Blessed is the man who takes refuge in him!\n9Oh, fear the LORD, you his saints,\n for those who fear him have no lack!\n10The young lions suffer want and hunger;\n but those who seek the LORD lack no good thing.\n11Come, O children, listen to me;\n I will teach you the fear of the LORD.\n12What man is there who desires life\n and loves many days, that he may see good?\n13Keep your tongue from evil\n and your lips from speaking deceit.\n14Turn away from evil and do good;\n seek peace and pursue it.\n15The eyes of the LORD are toward the righteous\n and his ears toward their cry.\n16The face of the LORD is against those who do evil,\n to cut off the memory of them from the earth.\n17When the righteous cry for help, the LORD hears\n and delivers them out of all their troubles.\n18The LORD is near to the brokenhearted\n and saves the crushed in spirit.\n19Many are the afflictions of the righteous,\n but the LORD delivers him out of them all.\n20He keeps all his bones;\n not one of them is broken.\n21Affliction will slay the wicked,\n  and those who hate the righteous will be\ncondemned.\n22The LORD redeems the life of his servants;\n  none of those who take refuge in him will be\ncondemned.\n"}, {"header": "              Great Is the LORD\n                  Of David.\n", "verse": "Psalms 35", "text": "35:1 Contend, O LORD, with those who contend\nwith me;\n  fight against those who fight against me!\n2Take hold of shield and buckler\n  and rise for my help!\n3Draw the spear and javelin\n  against my pursuers!\nSay to my soul,\n  \"I am your salvation!\"\n4Let them be put to shame and dishonor\n  who seek after my life!\nLet them be turned back and disappointed\n  who devise evil against me!\n5Let them be like chaff before the wind,\n  with the angel of the LORD driving them away!\n6Let their way be dark and slippery,\n  with the angel of the LORD pursuing them!\n7For without cause they hid their net for me;\n  without cause they dug a pit for my life.\n8Let destruction come upon him when he does not\nknow it!\nAnd let the net that he hid ensnare him;\n  let him fall into it-to his destruction!\n9Then my soul will rejoice in the LORD,\n exulting in his salvation.\n10All my bones shall say,\n \"O LORD, who is like you,\ndelivering the poor\n from him who is too strong for him,\n the poor and needy from him who robs him?\"\n11Malicious witnesses rise up;\n they ask me of things that I do not know.\n12They repay me evil for good;\n  my soul is bereft.\n13But I, when they were sick-\n I wore sackcloth;\n I afflicted myself with fasting;\nI prayed with head bowed on my chest.\n   14I went about as though I grieved for my friend or\nmy brother;\nas one who laments his mother,\n   I bowed down in mourning.\n15But at my stumbling they rejoiced and gathered;\n  they gathered together against me;\nwretches whom I did not know\n  tore at me without ceasing;\n16like profane mockers at a feast,\n  they gnash at me with their teeth.\n17How long, O Lord, will you look on?\n  Rescue me from their destruction,\n  my precious life from the lions!\n18I will thank you in the great congregation;\n  in the mighty throng I will praise you.\n19Let not those rejoice over me\n who are wrongfully my foes,\nand let not those wink the eye\n who hate me without cause.\n20For they do not speak peace,\n  but against those who are quiet in the land\n  they devise words of deceit.\n21They open wide their mouths against me;\n  they say, \"Aha, Aha!\n  Our eyes have seen it!\"\n22You have seen, O LORD; be not silent!\n O Lord, be not far from me!\n23Awake and rouse yourself for my vindication,\n for my cause, my God and my Lord!\n24Vindicate me, O LORD, my God,\n  according to your righteousness,\n  and let them not rejoice over me!\n25Let them not say in their hearts,\n  \"Aha, our heart's desire!\"\nLet them not say, \"We have swallowed him up.\"\n26Let them be put to shame and disappointed\naltogether\n  who rejoice at my calamity!\nLet them be clothed with shame and dishonor\n  who magnify themselves against me!\n27Let those who delight in my righteousness\n  shout for joy and be glad\n  and say evermore,\n\"Great is the LORD,\n  who delights in the welfare of his servant!\"\n28Then my tongue shall tell of your righteousness\n  and of your praise all the day long.\n  How Precious Is Your Steadfast Love\n"}, {"header": " To the choirmaster. Of David, the servant of\n                 the LORD.\n", "verse": "Psalms 36", "text": "36:1 Transgression speaks to the wicked\n  deep in his heart;\nthere is no fear of God\n  before his eyes.\n2For he flatters himself in his own eyes\n  that his iniquity cannot be found out and hated.\n3The words of his mouth are trouble and deceit;\n  he has ceased to act wisely and do good.\n4He plots trouble while on his bed;\n  he sets himself in a way that is not good;\n  he does not reject evil.\n5Your steadfast love, O LORD, extends to the\nheavens,\n  your faithfulness to the clouds.\n6Your righteousness is like the mountains of God;\n  your judgments are like the great deep;\n man and beast you save, O LORD.\n7How precious is your steadfast love, O God!\n  The children of mankind take refuge in the shadow\nof your wings.\n8They feast on the abundance of your house,\n  and you give them drink from the river of your\ndelights.\n9For with you is the fountain of life;\n  in your light do we see light.\n10Oh, continue your steadfast love to those who\nknow you,\n  and your righteousness to the upright of heart!\n11Let not the foot of arrogance come upon me,\n  nor the hand of the wicked drive me away.\n12There the evildoers lie fallen;\n  they are thrust down, unable to rise.\n"}, {"header": "       He Will Not Forsake His Saints\n                    Of David.\n", "verse": "Psalms 37", "text": "\n37:1 Fret not yourself because of evildoers;\n be not envious of wrongdoers!\n2For they will soon fade like the grass\n and wither like the green herb.\n3Trust in the LORD, and do good;\n dwell in the land and befriend faithfulness.\n4Delight yourself in the LORD,\n and he will give you the desires of your heart.\n5Commit your way to the LORD;\n trust in him, and he will act.\n6He will bring forth your righteousness as the light,\n and your justice as the noonday.\n7Be still before the LORD and wait patiently for him;\n fret not yourself over the one who prospers in his\nway,\n over the man who carries out evil devices!\n8Refrain from anger, and forsake wrath!\n Fret not yourself; it tends only to evil.\n9For the evildoers shall be cut off,\n  but those who wait for the LORD shall inherit the\nland.\n10In just a little while, the wicked will be no more;\n  though you look carefully at his place, he will not be\nthere.\n11But the meek shall inherit the land\n  and delight themselves in abundant peace.\n12The wicked plots against the righteous\n and gnashes his teeth at him,\n13but the Lord laughs at the wicked,\n for he sees that his day is coming.\n14The wicked draw the sword and bend their bows\n  to bring down the poor and needy,\n  to slay those whose way is upright;\n15their sword shall enter their own heart,\n  and their bows shall be broken.\n16Better is the little that the righteous has\n than the abundance of many wicked.\n17For the arms of the wicked shall be broken,\n but the LORD upholds the righteous.\n18The LORD knows the days of the blameless,\n and their heritage will remain forever;\n19they are not put to shame in evil times;\n in the days of famine they have abundance.\n20But the wicked will perish;\n the enemies of the LORD are like the glory of the\npastures;\n they vanish-like smoke they vanish away.\n21The wicked borrows but does not pay back,\n but the righteous is generous and gives;\n22for those blessed by the LORD  shall inherit the\nland,\n  but those cursed by him shall be cut off.\n23The steps of a man are established by the LORD,\n when he delights in his way;\n24though he fall, he shall not be cast headlong,\n for the LORD upholds his hand.\n25I have been young, and now am old,\n  yet I have not seen the righteous forsaken\n  or his children begging for bread.\n26He is ever lending generously,\n  and his children become a blessing.\n27Turn away from evil and do good;\n so shall you dwell forever.\n28For the LORD loves justice;\n  he will not forsake his saints.\nThey are preserved forever,\n  but the children of the wicked shall be cut off.\n29The righteous shall inherit the land\n  and dwell upon it forever.\n30The mouth of the righteous utters wisdom,\n and his tongue speaks justice.\n31The law of his God is in his heart;\n his steps do not slip.\n32The wicked watches for the righteous\n and seeks to put him to death.\n33The LORD will not abandon him to his power\n   or let him be condemned when he is brought to\ntrial.\n34Wait for the LORD and keep his way,\n and he will exalt you to inherit the land;\n you will look on when the wicked are cut off.\n35I have seen a wicked, ruthless man,\n  spreading himself like a green laurel tree.\n36But he passed away, and behold, he was no\nmore;\n though I sought him, he could not be found.\n37Mark the blameless and behold the upright,\n for there is a future for the man of peace.\n38But transgressors shall be altogether destroyed;\n the future of the wicked shall be cut off.\n39The salvation of the righteous is from the LORD;\n he is their stronghold in the time of trouble.\n40The LORD helps them and delivers them;\n he delivers them from the wicked and saves them,\n because they take refuge in him.\n"}, {"header": "      Do Not Forsake Me, O LORD\nA Psalm of David, for the memorial offering.\n", "verse": "Psalms 38", "text": "38:1 O LORD, rebuke me not in your anger,\n nor discipline me in your wrath!\n2For your arrows have sunk into me,\n and your hand has come down on me.\n3There is no soundness in my flesh\n  because of your indignation;\nthere is no health in my bones\n  because of my sin.\n4For my iniquities have gone over my head;\n  like a heavy burden, they are too heavy for me.\n5My wounds stink and fester\n because of my foolishness,\n6I am utterly bowed down and prostrate;\n all the day I go about mourning.\n7For my sides are filled with burning,\n and there is no soundness in my flesh.\n8I am feeble and crushed;\n I groan because of the tumult of my heart.\n9O Lord, all my longing is before you;\n my sighing is not hidden from you.\n10My heart throbs; my strength fails me,\n  and the light of my eyes-it also has gone from\nme.\n11My friends and companions stand aloof from my\nplague,\n  and my nearest kin stand far off.\n12Those who seek my life lay their snares;\n those who seek my hurt speak of ruin\n and meditate treachery all day long.\n13But I am like a deaf man; I do not hear,\n like a mute man who does not open his mouth.\n14I have become like a man who does not hear,\n and in whose mouth are no rebukes.\n15But for you, O LORD, do I wait;\n it is you, O Lord my God, who will answer.\n16For I said, \"Only let them not rejoice over me,\n who boast against me when my foot slips!\"\n17For I am ready to fall,\n and my pain is ever before me.\n18I confess my iniquity;\n I am sorry for my sin.\n19But my foes are vigorous, they are mighty,\n and many are those who hate me wrongfully.\n20Those who render me evil for good\n accuse me because I follow after good.\n21Do not forsake me, O LORD!\n O my God, be not far from me!\n22Make haste to help me,\n O Lord, my salvation!\n"}, {"header": "    What Is the Measure of My Days?\n To the choirmaster: to Jeduthun. A Psalm of\n", "verse": "Psalms 39", "text": "                   David.\n39:1 I said, \"I will guard my ways,\n  that I may not sin with my tongue;\nI will guard my mouth with a muzzle,\n  so long as the wicked are in my presence.\"\n2I was mute and silent;\n  I held my peace to no avail,\nand my distress grew worse.\n  3My heart became hot within me.\nAs I mused, the fire burned;\n  then I spoke with my tongue:\n4\"O LORD, make me know my end\n and what is the measure of my days;\n let me know how fleeting I am!\n5Behold, you have made my days a few\nhandbreadths,\n and my lifetime is as nothing before you.\nSurely all mankind stands as a mere breath! Selah\n 6Surely a man goes about as a shadow!\nSurely for nothing they are in turmoil;\n man heaps up wealth and does not know who will\ngather!\n7\"And now, O Lord, for what do I wait?\n My hope is in you.\n8Deliver me from all my transgressions.\n Do not make me the scorn of the fool!\n9I am mute; I do not open my mouth,\n for it is you who have done it.\n10Remove your stroke from me;\n I am spent by the hostility of your hand.\n11When you discipline a man\n  with rebukes for sin,\nyou consume like a moth what is dear to him;\n  surely all mankind is a mere breath! Selah\n12\"Hear my prayer, O LORD,\n and give ear to my cry;\n hold not your peace at my tears!\nFor I am a sojourner with you,\n a guest, like all my fathers.\n13Look away from me, that I may smile again,\n before I depart and am no more!\"\n"}, {"header": "         My Help and My Deliverer\n    To the choirmaster. A Psalm of David.\n", "verse": "Psalms 40", "text": "40:1 I waited patiently for the LORD;\n he inclined to me and heard my cry.\n2He drew me up from the pit of destruction,\n out of the miry bog,\nand set my feet upon a rock,\n making my steps secure.\n3He put a new song in my mouth,\n a song of praise to our God.\nMany will see and fear,\n and put their trust in the LORD.\n4Blessed is the man who makes\n  the LORD his trust,\nwho does not turn to the proud,\n  to those who go astray after a lie!\n5You have multiplied, O LORD my God,\n  your wondrous deeds and your thoughts toward us;\n  none can compare with you!\nI will proclaim and tell of them,\n yet they are more than can be told.\n6In sacrifice and offering you have not delighted,\n  but you have given me an open ear.\nBurnt offering and sin offering\n  you have not required.\n7Then I said, \"Behold, I have come;\n  in the scroll of the book it is written of me:\n8I delight to do your will, O my God;\n  your law is within my heart.\"\n9I have told the glad news of deliverance\n   in the great congregation;\nbehold, I have not restrained my lips,\n   as you know, O LORD.\n10I have not hidden your deliverance within my heart;\n   I have spoken of your faithfulness and your\nsalvation;\nI have not concealed your steadfast love and your\nfaithfulness\n   from the great congregation.\n11As for you, O LORD, you will not restrain\n  your mercy from me;\nyour steadfast love and your faithfulness will\n  ever preserve me!\n12For evils have encompassed me\n  beyond number;\nmy iniquities have overtaken me,\n  and I cannot see;\nthey are more than the hairs of my head;\n  my heart fails me.\n13Be pleased, O LORD, to deliver me!\n O LORD, make haste to help me!\n14Let those be put to shame and disappointed\naltogether\n  who seek to snatch away my life;\nlet those be turned back and brought to dishonor\n  who delight in my hurt!\n15Let those be appalled because of their shame\n  who say to me, \"Aha, Aha!\"\n16But may all who seek you\n rejoice and be glad in you;\nmay those who love your salvation\n say continually, \"Great is the LORD!\"\n17As for me, I am poor and needy,\n but the Lord takes thought for me.\nYou are my help and my deliverer;\n do not delay, O my God!\n"}, {"header": "       O LORD, Be Gracious to Me\n    To the choirmaster. A Psalm of David.\n", "verse": "Psalms 41", "text": "41:1 Blessed is the one who considers the\npoor! \n  In the day of trouble the LORD delivers him;\n2the LORD protects him and keeps him alive;\n  he is called blessed in the land;\n  you do not give him up to the will of his enemies.\n3The LORD sustains him on his sickbed;\n  in his illness you restore him to full health.\n4As for me, I said, \"O LORD, be gracious to me;\n heal me, for I have sinned against you!\"\n5My enemies say of me in malice,\n \"When will he die, and his name perish?\"\n6And when one comes to see me, he utters empty\nwords,\n while his heart gathers iniquity;\n when he goes out, he tells it abroad.\n7All who hate me whisper together about me;\n they imagine the worst for me.\n8They say, \"A deadly thing is poured out on him;\n he will not rise again from where he lies.\"\n9Even my close friend in whom I trusted,\n who ate my bread, has lifted his heel against me.\n10But you, O LORD, be gracious to me,\n and raise me up, that I may repay them!\n11By this I know that you delight in me:\n my enemy will not shout in triumph over me.\n12But you have upheld me because of my integrity,\n and set me in your presence forever.\n13Blessed be the LORD, the God of Israel,\n from everlasting to everlasting!\n"}, {"header": "    Amen and Amen.\n   Why Are You Cast Down, O My Soul?\nTo the choirmaster. A Maskil of the Sons\n                 of Korah.\n", "verse": "Psalms 42", "text": "42:1 As a deer pants for flowing streams,\n so pants my soul for you, O God.\n2My soul thirsts for God,\n  for the living God.\nWhen shall I come and appear before God?\n3My tears have been my food\n  day and night,\nwhile they say to me all the day long,\n  \"Where is your God?\"\n4These things I remember,\n  as I pour out my soul:\nhow I would go with the throng\n  and lead them in procession to the house of God\nwith glad shouts and songs of praise,\n  a multitude keeping festival.\n5Why are you cast down, O my soul,\n and why are you in turmoil within me?\nHope in God; for I shall again praise him,\n my salvation 6and my God.\nMy soul is cast down within me;\n  therefore I remember you\nfrom the land of Jordan and of Hermon,\n  from Mount Mizar.\n7Deep calls to deep\n  at the roar of your waterfalls;\nall your breakers and your waves\n  have gone over me.\n8By day the LORD commands his steadfast love,\n  and at night his song is with me,\n  a prayer to the God of my life.\n9I say to God, my rock:\n  \"Why have you forgotten me?\nWhy do I go mourning\n  because of the oppression of the enemy?\"\n10As with a deadly wound in my bones,\n  my adversaries taunt me,\nwhile they say to me all the day long,\n  \"Where is your God?\"\n11Why are you cast down, O my soul,\n and why are you in turmoil within me?\nHope in God; for I shall again praise him,\n my salvation and my God.\n"}, {"header": "    Send Out Your Light and Your Truth\n", "verse": "Psalms 43", "text": "43:1 Vindicate me, O God, and defend my cause\n  against an ungodly people,\nfrom the deceitful and unjust man\n  deliver me!\n2For you are the God in whom I take refuge;\n  why have you rejected me?\nWhy do I go about mourning\n  because of the oppression of the enemy?\n3Send out your light and your truth;\n  let them lead me;\nlet them bring me to your holy hill\n  and to your dwelling!\n4Then I will go to the altar of God,\n  to God my exceeding joy,\nand I will praise you with the lyre,\n  O God, my God.\n5Why are you cast down, O my soul,\n and why are you in turmoil within me?\nHope in God; for I shall again praise him,\nmy salvation and my God.\n"}, {"header": "               Come to Our Help\nTo the choirmaster. A Maskil of the Sons\n                 of Korah.\n", "verse": "Psalms 44", "text": "44:1 O God, we have heard with our ears,\n  our fathers have told us,\nwhat deeds you performed in their days,\n  in the days of old:\n2you with your own hand drove out the nations,\n  but them you planted;\nyou afflicted the peoples,\n  but them you set free;\n3for not by their own sword did they win the land,\n  nor did their own arm save them,\nbut your right hand and your arm,\n  and the light of your face,\n  for you delighted in them.\n4You are my King, O God;\n ordain salvation for Jacob!\n5Through you we push down our foes;\n  through your name we tread down those who rise\nup against us.\n6For not in my bow do I trust,\n  nor can my sword save me.\n7But you have saved us from our foes\n  and have put to shame those who hate us.\n8In God we have boasted continually,\n  and we will give thanks to your name forever.\nSelah\n9But you have rejected us and disgraced us\n and have not gone out with our armies.\n10You have made us turn back from the foe,\n and those who hate us have gotten spoil.\n11You have made us like sheep for slaughter\n and have scattered us among the nations.\n12You have sold your people for a trifle,\n demanding no high price for them.\n13You have made us the taunt of our neighbors,\n the derision and scorn of those around us.\n14You have made us a byword among the nations,\n  a laughingstock among the peoples.\n15All day long my disgrace is before me,\n and shame has covered my face\n16at the sound of the taunter and reviler,\n at the sight of the enemy and the avenger.\n17All this has come upon us,\n  though we have not forgotten you,\n  and we have not been false to your covenant.\n18Our heart has not turned back,\n  nor have our steps departed from your way;\n19yet you have broken us in the place of jackals\n  and covered us with the shadow of death.\n20If we had forgotten the name of our God\n  or spread out our hands to a foreign god,\n21would not God discover this?\n  For he knows the secrets of the heart.\n22Yet for your sake we are killed all the day long;\n  we are regarded as sheep to be slaughtered.\n23Awake! Why are you sleeping, O Lord?\n  Rouse yourself! Do not reject us forever!\n24Why do you hide your face?\n Why do you forget our affliction and oppression?\n25For our soul is bowed down to the dust;\n our belly clings to the ground.\n26Rise up; come to our help!\n Redeem us for the sake of your steadfast love!\n"}, {"header": "     Your Throne, O God, Is Forever\n To the choirmaster: according to Lilies. A\nMaskil of the Sons of Korah; a love song.\n", "verse": "Psalms 45", "text": "45:1 My heart overflows with a pleasing theme;\n I address my verses to the king;\n my tongue is like the pen of a ready scribe.\n2You are the most handsome of the sons of men;\n grace is poured upon your lips;\n therefore God has blessed you forever.\n3Gird your sword on your thigh, O mighty one,\n in your splendor and majesty!\n4In your majesty ride out victoriously\n  for the cause of truth and meekness and\nrighteousness;\n  let your right hand teach you awesome deeds!\n5Your arrows are sharp\n  in the heart of the king's enemies;\n  the peoples fall under you.\n6Your throne, O God, is forever and ever.\n  The scepter of your kingdom is a scepter of\nuprightness;\n  7you have loved righteousness and hated\nwickedness.\nTherefore God, your God, has anointed you\n  with the oil of gladness beyond your companions;\n  8your robes are all fragrant with myrrh and aloes\nand cassia.\nFrom ivory palaces stringed instruments make you\nglad;\n  9daughters of kings are among your ladies of\nhonor;\n  at your right hand stands the queen in gold of\nOphir.\n10Hear, O daughter, and consider, and incline your\near:\n  forget your people and your father's house,\n  11and the king will desire your beauty.\nSince he is your lord, bow to him.\n  12The people of Tyre will seek your favor with\ngifts,\n the richest of the people.\n13All glorious is the princess in her chamber, with\nrobes interwoven with gold.\n  14In many-colored robes she is led to the king,\n  with her virgin companions following behind her.\n15With joy and gladness they are led along\n  as they enter the palace of the king.\n16In place of your fathers shall be your sons;\n you will make them princes in all the earth.\n17I will cause your name to be remembered in all\ngenerations;\n therefore nations will praise you forever and ever.\n"}, {"header": "            God Is Our Fortress\n  To the choirmaster. Of the Sons of Korah.\n", "verse": "Psalms 46", "text": "    According to Alamoth. A Song.\n46:1 God is our refuge and strength,\n  a very present help in trouble.\n2Therefore we will not fear though the earth gives\nway,\n  though the mountains be moved into the heart of\nthe sea,\n3though its waters roar and foam,\n  though the mountains tremble at its swelling. Selah\n4There is a river whose streams make glad the city\nof God,\n  the holy habitation of the Most High.\n5God is in the midst of her; she shall not be moved;\n  God will help her when morning dawns.\n6The nations rage, the kingdoms totter;\n  he utters his voice, the earth melts.\n7The LORD of hosts is with us;\n the God of Jacob is our fortress. Selah\n8Come, behold the works of the LORD,\n how he has brought desolations on the earth.\n9He makes wars cease to the end of the earth;\n  he breaks the bow and shatters the spear;\n  he burns the chariots with fire.\n10\"Be still, and know that I am God.\n  I will be exalted among the nations,\n  I will be exalted in the earth!\"\n11The LORD of hosts is with us;\n  the God of Jacob is our fortress. Selah\n"}, {"header": "      God Is King over All the Earth\n To the choirmaster. A Psalm of the Sons of\n", "verse": "Psalms 47", "text": "                  Korah.\n47:1 Clap your hands, all peoples!\n Shout to God with loud songs of joy!\n2For the LORD, the Most High, is to be feared,\n a great king over all the earth.\n3He subdued peoples under us,\n and nations under our feet.\n4He chose our heritage for us,\n the pride of Jacob whom he loves. Selah\n5God has gone up with a shout,\n the LORD with the sound of a trumpet.\n6Sing praises to God, sing praises!\n Sing praises to our King, sing praises!\n7For God is the King of all the earth;\n  sing praises with a psalm! \n8God reigns over the nations;\n God sits on his holy throne.\n9The princes of the peoples gather\n as the people of the God of Abraham.\nFor the shields of the earth belong to God;\n he is highly exalted!\n"}, {"header": "         Zion, the City of Our God\n    A Song. A Psalm of the Sons of Korah.\n", "verse": "Psalms 48", "text": "48:1 Great is the LORD and greatly to be praised\n in the city of our God!\nHis holy mountain, 2beautiful in elevation,\n is the joy of all the earth,\nMount Zion, in the far north,\n the city of the great King.\n3Within her citadels God\n has made himself known as a fortress.\n4For behold, the kings assembled;\n they came on together.\n5As soon as they saw it, they were astounded;\n they were in panic; they took to flight.\n6Trembling took hold of them there,\n anguish as of a woman in labor.\n7By the east wind you shattered\n the ships of Tarshish.\n8As we have heard, so have we seen\n  in the city of the LORD of hosts,\nin the city of our God,\n  which God will establish forever. Selah\n9We have thought on your steadfast love, O God,\n in the midst of your temple.\n10As your name, O God,\n so your praise reaches to the ends of the earth.\nYour right hand is filled with righteousness.\n 11Let Mount Zion be glad!\nLet the daughters of Judah rejoice\n because of your judgments!\n12Walk about Zion, go around her,\n number her towers,\n13consider well her ramparts,\n  go through her citadels,\nthat you may tell the next generation\n  14that this is God,\nour God forever and ever.\n  He will guide us forever.\n Why Should I Fear in Times of Trouble?\n"}, {"header": " To the choirmaster. A Psalm of the Sons of\n", "verse": "Psalms 49", "text": "                  Korah.\n49:1 Hear this, all peoples!\n Give ear, all inhabitants of the world,\n2both low and high,\n rich and poor together!\n3My mouth shall speak wisdom;\n the meditation of my heart shall be understanding.\n4I will incline my ear to a proverb;\n I will solve my riddle to the music of the lyre.\n5Why should I fear in times of trouble,\n  when the iniquity of those who cheat me surrounds\nme,\n6those who trust in their wealth\n  and boast of the abundance of their riches?\n7Truly no man can ransom another,\n  or give to God the price of his life,\n8for the ransom of their life is costly\n and can never suffice,\n9that he should live on forever\n and never see the pit.\n10For he sees that even the wise die;\n  the fool and the stupid alike must perish\n  and leave their wealth to others.\n11Their graves are their homes forever,\n  their dwelling places to all generations,\n  though they called lands by their own names.\n12Man in his pomp will not remain;\n  he is like the beasts that perish.\n13This is the path of those who have foolish\nconfidence;\n yet after them people approve of their boasts.\nSelah\n14Like sheep they are appointed for Sheol;\n  death shall be their shepherd,\nand the upright shall rule over them in the morning.\n  Their form shall be consumed in Sheol, with no\nplace to dwell.\n15But God will ransom my soul from the power of\nSheol,\n for he will receive me. Selah\n16Be not afraid when a man becomes rich,\n when the glory of his house increases.\n17For when he dies he will carry nothing away;\n his glory will not go down after him.\n18For though, while he lives, he counts himself\nblessed\n  -and though you get praise when you do well for\nyourself-\n19his soul will go to the generation of his fathers,\n  who will never again see light.\n20Man in his pomp yet without understanding is like\nthe beasts that perish.\n"}, {"header": "              God Himself Is Judge\n               A Psalm of Asaph.\n", "verse": "Psalms 50", "text": "50:1 The Mighty One, God the LORD,\n speaks and summons the earth\n from the rising of the sun to its setting.\n2Out of Zion, the perfection of beauty,\n God shines forth.\n3Our God comes; he does not keep silence;\n  before him is a devouring fire,\n  around him a mighty tempest.\n4He calls to the heavens above\n  and to the earth, that he may judge his people:\n5\"Gather to me my faithful ones,\n  who made a covenant with me by sacrifice!\"\n6The heavens declare his righteousness,\n  for God himself is judge! Selah\n7\"Hear, O my people, and I will speak;\n O Israel, I will testify against you.\n I am God, your God.\n8Not for your sacrifices do I rebuke you;\n your burnt offerings are continually before me.\n9I will not accept a bull from your house\n or goats from your folds.\n10For every beast of the forest is mine,\n the cattle on a thousand hills.\n11I know all the birds of the hills,\n and all that moves in the field is mine.\n12\"If I were hungry, I would not tell you,\n for the world and its fullness are mine.\n13Do I eat the flesh of bulls\n or drink the blood of goats?\n14Offer to God a sacrifice of thanksgiving,\n and perform your vows to the Most High,\n15and call upon me in the day of trouble;\n I will deliver you, and you shall glorify me.\"\n16But to the wicked God says:\n  \"What right have you to recite my statutes\n  or take my covenant on your lips?\n17For you hate discipline,\n and you cast my words behind you.\n18If you see a thief, you are pleased with him,\n and you keep company with adulterers.\n19\"You give your mouth free rein for evil,\n and your tongue frames deceit.\n20You sit and speak against your brother;\n you slander your own mother's son.\n21These things you have done, and I have been\nsilent;\n  you thought that I was one like yourself.\nBut now I rebuke you and lay the charge before you.\n22\"Mark this, then, you who forget God,\n lest I tear you apart, and there be none to deliver!\n23The one who offers thanksgiving as his sacrifice\nglorifies me;\n  to one who orders his way rightly\n  I will show the salvation of God!\"\n  Create in Me a Clean Heart, O God\n"}, {"header": "To the choirmaster. A Psalm of David, when\nNathan the prophet went to him, after he had\n           gone in to Bathsheba.\n", "verse": "Psalms 51", "text": "51:1 Have mercy on me, O God,\n according to your steadfast love;\naccording to your abundant mercy\n blot out my transgressions.\n2Wash me thoroughly from my iniquity,\n and cleanse me from my sin!\n3For I know my transgressions,\n and my sin is ever before me.\n4Against you, you only, have I sinned\n and done what is evil in your sight,\nso that you may be justified in your words\n and blameless in your judgment.\n5Behold, I was brought forth in iniquity,\n and in sin did my mother conceive me.\n6Behold, you delight in truth in the inward being,\n and you teach me wisdom in the secret heart.\n7Purge me with hyssop, and I shall be clean;\n wash me, and I shall be whiter than snow.\n8Let me hear joy and gladness;\n let the bones that you have broken rejoice.\n9Hide your face from my sins,\n and blot out all my iniquities.\n10Create in me a clean heart, O God,\n  and renew a right spirit within me.\n11Cast me not away from your presence,\n and take not your Holy Spirit from me.\n12Restore to me the joy of your salvation,\n and uphold me with a willing spirit.\n13Then I will teach transgressors your ways,\n and sinners will return to you.\n14Deliver me from bloodguiltiness, O God,\n  O God of my salvation,\n  and my tongue will sing aloud of your\nrighteousness.\n15O Lord, open my lips,\n and my mouth will declare your praise.\n16For you will not delight in sacrifice, or I would give\nit;\n   you will not be pleased with a burnt offering.\n17The sacrifices of God are a broken spirit;\n   a broken and contrite heart, O God, you will not\ndespise.\n18Do good to Zion in your good pleasure;\n build up the walls of Jerusalem;\n19then will you delight in right sacrifices,\n in burnt offerings and whole burnt offerings;\n then bulls will be offered on your altar.\n"}, {"header": "    The Steadfast Love of God Endures\n To the choirmaster. A Maskil of David,\n", "verse": "Psalms 52", "text": "when Doeg, the Edomite, came and told Saul,\n\"David has come to the house of Ahimelech.\"\n52:1 Why do you boast of evil, O mighty man?\n The steadfast love of God endures all the day.\n2Your tongue plots destruction,\n like a sharp razor, you worker of deceit.\n3You love evil more than good,\n and lying more than speaking what is right. Selah\n4You love all words that devour,\n O deceitful tongue.\n5But God will break you down forever;\n  he will snatch and tear you from your tent;\n  he will uproot you from the land of the living. Selah\n6The righteous shall see and fear,\n  and shall laugh at him, saying,\n7\"See the man who would not make\n  God his refuge,\nbut trusted in the abundance of his riches\n and sought refuge in his own destruction!\"\n8But I am like a green olive tree\n   in the house of God.\nI trust in the steadfast love of God\n   forever and ever.\n9I will thank you forever,\n   because you have done it.\nI will wait for your name, for it is good,\n   in the presence of the godly.\n"}, {"header": "      There Is None Who Does Good\nTo the choirmaster: according to Mahalath. A\n            Maskil of David.\n", "verse": "Psalms 53", "text": "53:1 The fool says in his heart, \"There is no God.\"\n They are corrupt, doing abominable iniquity;\n there is none who does good.\n2God looks down from heaven\n  on the children of man\nto see if there are any who understand,\n  who seek after God.\n3They have all fallen away;\n  together they have become corrupt;\nthere is none who does good,\n  not even one.\n4Have those who work evil no knowledge,\n who eat up my people as they eat bread,\n and do not call upon God?\n5There they are, in great terror,\n where there is no terror!\nFor God scatters the bones of him who encamps\nagainst you;\n you put them to shame, for God has rejected them.\n6Oh, that salvation for Israel would come out of Zion!\n When God restores the fortunes of his people,\n let Jacob rejoice, let Israel be glad.\n"}, {"header": "         The Lord Upholds My Life\nTo the choirmaster: with stringed instruments.\n A Maskil of David, when the Ziphites\n  went and told Saul, \"Is not David hiding\n                among us?\"\n", "verse": "Psalms 54", "text": "54:1 O God, save me by your name,\n and vindicate me by your might.\n2O God, hear my prayer;\n give ear to the words of my mouth.\n3For strangers have risen against me;\n ruthless men seek my life;\n they do not set God before themselves. Selah\n4Behold, God is my helper;\n the Lord is the upholder of my life.\n5He will return the evil to my enemies;\n in your faithfulness put an end to them.\n6With a freewill offering I will sacrifice to you;\n  I will give thanks to your name, O LORD, for it is\ngood.\n7For he has delivered me from every trouble,\n  and my eye has looked in triumph on my enemies.\n"}, {"header": "      Cast Your Burden on the LORD\nTo the choirmaster: with stringed instruments.\n           A Maskil of David.\n", "verse": "Psalms 55", "text": "55:1 Give ear to my prayer, O God,\n and hide not yourself from my plea for mercy!\n2Attend to me, and answer me;\n I am restless in my complaint and I moan,\n3because of the noise of the enemy,\n because of the oppression of the wicked.\nFor they drop trouble upon me,\n and in anger they bear a grudge against me.\n4My heart is in anguish within me;\n the terrors of death have fallen upon me.\n5Fear and trembling come upon me,\n and horror overwhelms me.\n6And I say, \"Oh, that I had wings like a dove!\n I would fly away and be at rest;\n7yes, I would wander far away;\n I would lodge in the wilderness; Selah\n8I would hurry to find a shelter\n from the raging wind and tempest.\"\n9Destroy, O Lord, divide their tongues;\n for I see violence and strife in the city.\n10Day and night they go around it\n on its walls,\nand iniquity and trouble are within it;\n 11ruin is in its midst;\noppression and fraud\n do not depart from its marketplace.\n12For it is not an enemy who taunts me-\n   then I could bear it;\nit is not an adversary who deals insolently with me-\n   then I could hide from him.\n13But it is you, a man, my equal,\n   my companion, my familiar friend.\n14We used to take sweet counsel together;\n   within God's house we walked in the throng.\n15Let death steal over them;\n   let them go down to Sheol alive;\n   for evil is in their dwelling place and in their heart.\n16But I call to God,\n and the LORD will save me.\n17Evening and morning and at noon\n  I utter my complaint and moan,\n  and he hears my voice.\n18He redeems my soul in safety\n  from the battle that I wage,\n  for many are arrayed against me.\n19God will give ear and humble them,\n  he who is enthroned from of old, Selah\nbecause they do not change\n  and do not fear God.\n20My companion stretched out his hand against\nhis friends;\n  he violated his covenant.\n21His speech was smooth as butter,\n  yet war was in his heart;\nhis words were softer than oil,\n  yet they were drawn swords.\n22Cast your burden on the LORD,\n and he will sustain you;\nhe will never permit\n the righteous to be moved.\n23But you, O God, will cast them down\n into the pit of destruction;\nmen of blood and treachery\n shall not live out half their days.\nBut I will trust in you.\n"}, {"header": "              In God I Trust\n To the choirmaster: according to The Dove\n  on Far-off Terebinths. A Miktam of\n  David, when the Philistines seized him in\n", "verse": "Psalms 56", "text": "                   Gath.\n56:1 Be gracious to me, O God, for man tramples\non me;\n  all day long an attacker oppresses me;\n2my enemies trample on me all day long,\n  for many attack me proudly.\n3When I am afraid,\n  I put my trust in you.\n4In God, whose word I praise,\n  in God I trust; I shall not be afraid.\n  What can flesh do to me?\n5All day long they injure my cause;\n all their thoughts are against me for evil.\n6They stir up strife, they lurk;\n they watch my steps,\n as they have waited for my life.\n7For their crime will they escape?\n In wrath cast down the peoples, O God!\n8You have kept count of my tossings;\n  put my tears in your bottle.\n  Are they not in your book?\n9Then my enemies will turn back\n  in the day when I call.\n  This I know, that God is for me.\n10In God, whose word I praise,\n  in the LORD, whose word I praise,\n11in God I trust; I shall not be afraid.\n  What can man do to me?\n12I must perform my vows to you, O God;\n I will render thank offerings to you.\n13For you have delivered my soul from death,\n  yes, my feet from falling,\nthat I may walk before God\n  in the light of life.\n   Let Your Glory Be over All the Earth\n"}, {"header": "   To the choirmaster: according to Do Not\n  Destroy. A Miktam of David, when he\n          fled from Saul, in the cave.\n", "verse": "Psalms 57", "text": "57:1 Be merciful to me, O God, be merciful to me,\n  for in you my soul takes refuge;\nin the shadow of your wings I will take refuge,\n  till the storms of destruction pass by.\n2I cry out to God Most High,\n  to God who fulfills his purpose for me.\n3He will send from heaven and save me;\n  he will put to shame him who tramples on me.\nSelah\nGod will send out his steadfast love and his\nfaithfulness!\n4My soul is in the midst of lions;\n  I lie down amid fiery beasts-\nthe children of man, whose teeth are spears and\narrows,\n whose tongues are sharp swords.\n5Be exalted, O God, above the heavens!\n Let your glory be over all the earth!\n6They set a net for my steps;\n  my soul was bowed down.\nThey dug a pit in my way,\n  but they have fallen into it themselves. Selah\n7My heart is steadfast, O God,\n  my heart is steadfast!\nI will sing and make melody!\n  8Awake, my glory! \nAwake, O harp and lyre!\n  I will awake the dawn!\n9I will give thanks to you, O Lord, among the\npeoples;\n  I will sing praises to you among the nations.\n10For your steadfast love is great to the heavens,\n  your faithfulness to the clouds.\n11Be exalted, O God, above the heavens!\n Let your glory be over all the earth!\n"}, {"header": "         God Who Judges the Earth\n   To the choirmaster: according to Do Not\n      Destroy. A Miktam of David.\n", "verse": "Psalms 58", "text": "58:1 Do you indeed decree what is right, you\ngods?\n Do you judge the children of man uprightly?\n2No, in your hearts you devise wrongs;\n your hands deal out violence on earth.\n3The wicked are estranged from the womb;\n they go astray from birth, speaking lies.\n4They have venom like the venom of a serpent,\n like the deaf adder that stops its ear,\n5so that it does not hear the voice of charmers\n or of the cunning enchanter.\n6O God, break the teeth in their mouths;\n tear out the fangs of the young lions, O LORD!\n7Let them vanish like water that runs away;\n when he aims his arrows, let them be blunted.\n8Let them be like the snail that dissolves into slime,\n like the stillborn child who never sees the sun.\n9Sooner than your pots can feel the heat of thorns,\n whether green or ablaze, may he sweep them\naway! \n10The righteous will rejoice when he sees the\nvengeance;\n  he will bathe his feet in the blood of the wicked.\n11Mankind will say, \"Surely there is a reward for the\nrighteous;\n  surely there is a God who judges on earth.\"\n"}, {"header": "       Deliver Me from My Enemies\n  To the choirmaster: according to Do Not\nDestroy. A Miktam of David, when Saul\n sent men to watch his house in order to kill\n", "verse": "Psalms 59", "text": "                    him.\n59:1 Deliver me from my enemies, O my God;\n protect me from those who rise up against me;\n2deliver me from those who work evil,\n and save me from bloodthirsty men.\n3For behold, they lie in wait for my life;\n fierce men stir up strife against me.\nFor no transgression or sin of mine, O LORD,\n 4for no fault of mine, they run and make ready.\nAwake, come to meet me, and see!\n 5You, LORD God of hosts, are God of Israel.\nRouse yourself to punish all the nations;\n spare none of those who treacherously plot evil.\nSelah\n6Each evening they come back,\n  howling like dogs\n  and prowling about the city.\n7There they are, bellowing with their mouths\n  with swords in their lips-\n  for \"Who,\" they think, \"will hear us?\"\n8But you, O LORD, laugh at them;\n you hold all the nations in derision.\n9O my Strength, I will watch for you,\n for you, O God, are my fortress.\n10My God in his steadfast love will meet me;\n God will let me look in triumph on my enemies.\n11Kill them not, lest my people forget;\n  make them totter by your power and bring them\ndown,\n  O Lord, our shield!\n12For the sin of their mouths, the words of their lips,\n  let them be trapped in their pride.\nFor the cursing and lies that they utter,\n  13consume them in wrath;\n  consume them till they are no more,\nthat they may know that God rules over Jacob\n  to the ends of the earth. Selah\n14Each evening they come back,\n  howling like dogs\n  and prowling about the city.\n15They wander about for food\n  and growl if they do not get their fill.\n16But I will sing of your strength;\n  I will sing aloud of your steadfast love in the\nmorning.\nFor you have been to me a fortress\n  and a refuge in the day of my distress.\n17O my Strength, I will sing praises to you,\n  for you, O God, are my fortress,\n  the God who shows me steadfast love.\n"}, {"header": "       He Will Tread Down Our Foes\n  To the choirmaster: according to Shushan\n     Eduth. A Miktam of David; for\n", "verse": "Psalms 60", "text": "   instruction; when he strove with Aram-\n  naharaim and with Aram-zobah, and when\n    Joab on his return struck down twelve\n   thousand of Edom in the Valley of Salt.\n60:1 O God, you have rejected us, broken our\ndefenses;\n  you have been angry; oh, restore us.\n2You have made the land to quake; you have torn it\nopen;\n  repair its breaches, for it totters.\n3You have made your people see hard things;\n  you have given us wine to drink that made us\nstagger.\n4You have set up a banner for those who fear you,\n  that they may flee to it from the bow. Selah\n5That your beloved ones may be delivered,\n give salvation by your right hand and answer us!\n6God has spoken in his holiness:\n \"With exultation I will divide up Shechem\n and portion out the Vale of Succoth.\n7Gilead is mine; Manasseh is mine;\n Ephraim is my helmet;\n Judah is my scepter.\n8Moab is my washbasin;\n upon Edom I cast my shoe;\n over Philistia I shout in triumph.\"\n9Who will bring me to the fortified city?\n Who will lead me to Edom?\n10Have you not rejected us, O God?\n You do not go forth, O God, with our armies.\n11Oh, grant us help against the foe,\n for vain is the salvation of man!\n12With God we shall do valiantly;\n it is he who will tread down our foes.\n"}, {"header": "           Lead Me to the Rock\nTo the choirmaster: with stringed instruments.\n                 Of David.\n", "verse": "Psalms 61", "text": "61:1 Hear my cry, O God,\n listen to my prayer;\n2from the end of the earth I call to you\n  when my heart is faint.\nLead me to the rock\n  that is higher than I,\n3for you have been my refuge,\n  a strong tower against the enemy.\n4Let me dwell in your tent forever!\n Let me take refuge under the shelter of your wings!\nSelah\n5For you, O God, have heard my vows;\n  you have given me the heritage of those who fear\nyour name.\n6Prolong the life of the king;\n may his years endure to all generations!\n7May he be enthroned forever before God;\n appoint steadfast love and faithfulness to watch\nover him!\n8So will I ever sing praises to your name,\n as I perform my vows day after day.\n"}, {"header": "       My Soul Waits for God Alone\nTo the choirmaster: according to Jeduthun. A\n             Psalm of David.\n", "verse": "Psalms 62", "text": "62:1 For God alone my soul waits in silence;\n from him comes my salvation.\n2He only is my rock and my salvation,\n my fortress; I shall not be greatly shaken.\n3How long will all of you attack a man\n  to batter him,\n  like a leaning wall, a tottering fence?\n4They only plan to thrust him down from his high\nposition.\n  They take pleasure in falsehood.\nThey bless with their mouths,\n  but inwardly they curse. Selah\n5For God alone, O my soul, wait in silence,\n for my hope is from him.\n6He only is my rock and my salvation,\n my fortress; I shall not be shaken.\n7On God rests my salvation and my glory;\n my mighty rock, my refuge is God.\n8Trust in him at all times, O people;\n pour out your heart before him;\n God is a refuge for us. Selah\n9Those of low estate are but a breath;\n  those of high estate are a delusion;\nin the balances they go up;\n  they are together lighter than a breath.\n10Put no trust in extortion;\n  set no vain hopes on robbery;\n  if riches increase, set not your heart on them.\n11Once God has spoken;\n  twice have I heard this:\nthat power belongs to God,\n  12and that to you, O Lord, belongs steadfast love.\nFor you will render to a man\n  according to his work.\n"}, {"header": "          My Soul Thirsts for You\n    A Psalm of David, when he was in the\n           wilderness of Judah.\n", "verse": "Psalms 63", "text": "63:1 O God, you are my God; earnestly I seek you;\n my soul thirsts for you;\nmy flesh faints for you,\n as in a dry and weary land where there is no water.\n2So I have looked upon you in the sanctuary,\n beholding your power and glory.\n3Because your steadfast love is better than life,\n my lips will praise you.\n4So I will bless you as long as I live;\n in your name I will lift up my hands.\n5My soul will be satisfied as with fat and rich food,\n and my mouth will praise you with joyful lips,\n6when I remember you upon my bed,\n and meditate on you in the watches of the night;\n7for you have been my help,\n and in the shadow of your wings I will sing for joy.\n8My soul clings to you;\n your right hand upholds me.\n9But those who seek to destroy my life\n shall go down into the depths of the earth;\n10they shall be given over to the power of the sword;\n they shall be a portion for jackals.\n11But the king shall rejoice in God;\n all who swear by him shall exult,\n for the mouths of liars will be stopped.\n"}, {"header": "         Hide Me from the Wicked\n    To the choirmaster. A Psalm of David.\n", "verse": "Psalms 64", "text": "64:1 Hear my voice, O God, in my complaint;\n preserve my life from dread of the enemy.\n2Hide me from the secret plots of the wicked,\n from the throng of evildoers,\n3who whet their tongues like swords,\n who aim bitter words like arrows,\n4shooting from ambush at the blameless,\n shooting at him suddenly and without fear.\n5They hold fast to their evil purpose;\n  they talk of laying snares secretly,\nthinking, \"Who can see them?\"\n  6They search out injustice,\nsaying, \"We have accomplished a diligent search.\"\n  For the inward mind and heart of a man are deep!\n7But God shoots his arrow at them;\n they are wounded suddenly.\n8They are brought to ruin, with their own tongues\nturned against them;\n  all who see them will wag their heads.\n9Then all mankind fears;\n  they tell what God has brought about\n  and ponder what he has done.\n10Let the righteous one rejoice in the LORD\n and take refuge in him!\nLet all the upright in heart exult!\n"}, {"header": "          O God of Our Salvation\n  To the choirmaster. A Psalm of David. A\n", "verse": "Psalms 65", "text": "                   Song.\n65:1 Praise is due to you, O God, in Zion,\n and to you shall vows be performed.\n2O you who hear prayer,\n to you shall all flesh come.\n3When iniquities prevail against me,\n you atone for our transgressions.\n4Blessed is the one you choose and bring near,\n to dwell in your courts!\nWe shall be satisfied with the goodness of your\nhouse,\n the holiness of your temple!\n5By awesome deeds you answer us with\nrighteousness,\n  O God of our salvation,\nthe hope of all the ends of the earth\n  and of the farthest seas;\n6the one who by his strength established the\nmountains,\n  being girded with might;\n7who stills the roaring of the seas,\n  the roaring of their waves,\n  the tumult of the peoples,\n8so that those who dwell at the ends of the earth are\nin awe at your signs.\nYou make the going out of the morning and the\nevening to shout for joy.\n9You visit the earth and water it;\n  you greatly enrich it;\nthe river of God is full of water;\n  you provide their grain,\n  for so you have prepared it.\n10You water its furrows abundantly,\n  settling its ridges,\nsoftening it with showers,\n  and blessing its growth.\n11You crown the year with your bounty;\n  your wagon tracks overflow with abundance.\n12The pastures of the wilderness overflow,\n  the hills gird themselves with joy,\n13the meadows clothe themselves with flocks,\n the valleys deck themselves with grain,\n they shout and sing together for joy.\n"}, {"header": "     How Awesome Are Your Deeds\n    To the choirmaster. A Song. A Psalm.\n", "verse": "Psalms 66", "text": "66:1 Shout for joy to God, all the earth;\n 2sing the glory of his name;\n give to him glorious praise!\n3Say to God, \"How awesome are your deeds!\n  So great is your power that your enemies come\ncringing to you.\n4All the earth worships you\n  and sings praises to you;\n  they sing praises to your name.\" Selah\n5Come and see what God has done:\n he is awesome in his deeds toward the children of\nman.\n6He turned the sea into dry land;\n they passed through the river on foot.\nThere did we rejoice in him,\n 7who rules by his might forever,\nwhose eyes keep watch on the nations-\n let not the rebellious exalt themselves. Selah\n8Bless our God, O peoples;\n let the sound of his praise be heard,\n9who has kept our soul among the living\n and has not let our feet slip.\n10For you, O God, have tested us;\n you have tried us as silver is tried.\n11You brought us into the net;\n you laid a crushing burden on our backs;\n12you let men ride over our heads;\n  we went through fire and through water;\nyet you have brought us out to a place of abundance.\n13I will come into your house with burnt offerings;\n I will perform my vows to you,\n14that which my lips uttered\n and my mouth promised when I was in trouble.\n15I will offer to you burnt offerings of fattened\nanimals,\n  with the smoke of the sacrifice of rams;\nI will make an offering of bulls and goats. Selah\n16Come and hear, all you who fear God,\n and I will tell what he has done for my soul.\n17I cried to him with my mouth,\n  and high praise was on my tongue.\n18If I had cherished iniquity in my heart,\n the Lord would not have listened.\n19But truly God has listened;\n he has attended to the voice of my prayer.\n20Blessed be God,\n because he has not rejected my prayer\n or removed his steadfast love from me!\n"}, {"header": "      Make Your Face Shine upon Us\nTo the choirmaster: with stringed instruments.\n             A Psalm. A Song.\n", "verse": "Psalms 67", "text": "67:1 May God be gracious to us and bless us\n and make his face to shine upon us, Selah\n2that your way may be known on earth,\n your saving power among all nations.\n3Let the peoples praise you, O God;\n let all the peoples praise you!\n4Let the nations be glad and sing for joy,\n  for you judge the peoples with equity\n  and guide the nations upon earth. Selah\n5Let the peoples praise you, O God;\n  let all the peoples praise you!\n6The earth has yielded its increase;\n God, our God, shall bless us.\n7God shall bless us;\n let all the ends of the earth fear him!\n"}, {"header": "      God Shall Scatter His Enemies\n  To the choirmaster. A Psalm of David. A\n", "verse": "Psalms 68", "text": "                   Song.\n68:1 God shall arise, his enemies shall be\nscattered;\n  and those who hate him shall flee before him!\n2As smoke is driven away, so you shall drive them\naway;\n  as wax melts before fire,\n  so the wicked shall perish before God!\n3But the righteous shall be glad;\n  they shall exult before God;\n  they shall be jubilant with joy!\n4Sing to God, sing praises to his name;\n  lift up a song to him who rides through the deserts;\nhis name is the LORD;\n  exult before him!\n5Father of the fatherless and protector of widows\n  is God in his holy habitation.\n6God settles the solitary in a home;\n he leads out the prisoners to prosperity,\n but the rebellious dwell in a parched land.\n7O God, when you went out before your people,\n when you marched through the wilderness, Selah\n8the earth quaked, the heavens poured down rain,\n  before God, the One of Sinai,\n  before God, the God of Israel.\n9Rain in abundance, O God, you shed abroad;\n  you restored your inheritance as it languished;\n10your flock found a dwelling in it;\n  in your goodness, O God, you provided for the\nneedy.\n11The Lord gives the word;\n  the women who announce the news are a great\nhost:\n  12\"The kings of the armies-they flee, they flee!\"\nThe women at home divide the spoil-\n  13though you men lie among the sheepfolds-\nthe wings of a dove covered with silver,\n  its pinions with shimmering gold.\n14When the Almighty scatters kings there,\n let snow fall on Zalmon.\n15O mountain of God, mountain of Bashan;\n  O many-peaked mountain, mountain of\nBashan!\n16Why do you look with hatred, O many-peaked\nmountain,\n  at the mount that God desired for his abode,\n  yes, where the LORD will dwell forever?\n17The chariots of God are twice ten thousand,\n  thousands upon thousands;\n  the Lord is among them; Sinai is now in the\nsanctuary.\n18You ascended on high,\n  leading a host of captives in your train\n  and receiving gifts among men,\neven among the rebellious, that the LORD God may\ndwell there.\n19Blessed be the Lord,\n  who daily bears us up;\n  God is our salvation. Selah\n20Our God is a God of salvation,\n  and to GOD, the Lord, belong deliverances from\ndeath.\n21But God will strike the heads of his enemies,\n  the hairy crown of him who walks in his guilty ways.\n22The Lord said,\n  \"I will bring them back from Bashan,\nI will bring them back from the depths of the sea,\n23that you may strike your feet in their blood,\n  that the tongues of your dogs may have their\nportion from the foe.\"\n24Your procession is seen, O God,\n  the procession of my God, my King, into the\nsanctuary-\n25the singers in front, the musicians last,\n  between them virgins playing tambourines:\n26\"Bless God in the great congregation,\n  the LORD, O you who are of Israel's fountain!\"\n27There is Benjamin, the least of them, in the lead,\n  the princes of Judah in their throng,\n  the princes of Zebulun, the princes of Naphtali.\n28Summon your power, O God,\n  the power, O God, by which you have worked for\nus.\n29Because of your temple at Jerusalem\n  kings shall bear gifts to you.\n30Rebuke the beasts that dwell among the reeds,\n  the herd of bulls with the calves of the peoples.\nTrample underfoot those who lust after tribute;\n  scatter the peoples who delight in war.\n31Nobles shall come from Egypt;\n  Cush shall hasten to stretch out her hands to God.\n32O kingdoms of the earth, sing to God;\n sing praises to the Lord, Selah\n33to him who rides in the heavens, the ancient\nheavens;\n  behold, he sends out his voice, his mighty voice.\n34Ascribe power to God,\n  whose majesty is over Israel,\n  and whose power is in the skies.\n35Awesome is God from his sanctuary;\n  the God of Israel-he is the one who gives power\nand strength to his people.\nBlessed be God!\n"}, {"header": "             Save Me, O God\n To the choirmaster: according to Lilies. Of\n", "verse": "Psalms 69", "text": "                  David.\n69:1 Save me, O God!\n For the waters have come up to my neck.\n2I sink in deep mire,\n   where there is no foothold;\nI have come into deep waters,\n   and the flood sweeps over me.\n3I am weary with my crying out;\n   my throat is parched.\nMy eyes grow dim\n   with waiting for my God.\n4More in number than the hairs of my head\n are those who hate me without cause;\nmighty are those who would destroy me,\n those who attack me with lies.\nWhat I did not steal\n must I now restore?\n5O God, you know my folly;\n the wrongs I have done are not hidden from you.\n6Let not those who hope in you be put to shame\nthrough me,\n  O Lord GOD of hosts;\nlet not those who seek you be brought to dishonor\nthrough me,\n  O God of Israel.\n7For it is for your sake that I have borne reproach,\n  that dishonor has covered my face.\n8I have become a stranger to my brothers,\n  an alien to my mother's sons.\n9For zeal for your house has consumed me,\n  and the reproaches of those who reproach you\nhave fallen on me.\n10When I wept and humbled my soul with fasting,\n  it became my reproach.\n11When I made sackcloth my clothing,\n  I became a byword to them.\n12I am the talk of those who sit in the gate,\n  and the drunkards make songs about me.\n13But as for me, my prayer is to you, O LORD.\n  At an acceptable time, O God,\n  in the abundance of your steadfast love answer me\nin your saving faithfulness.\n14Deliver me\n  from sinking in the mire;\nlet me be delivered from my enemies\n  and from the deep waters.\n15Let not the flood sweep over me,\n  or the deep swallow me up,\n  or the pit close its mouth over me.\n16Answer me, O LORD, for your steadfast love is\ngood;\n  according to your abundant mercy, turn to me.\n17Hide not your face from your servant;\n  for I am in distress; make haste to answer me.\n18Draw near to my soul, redeem me;\n  ransom me because of my enemies!\n19You know my reproach,\n and my shame and my dishonor;\n my foes are all known to you.\n20Reproaches have broken my heart,\n   so that I am in despair.\nI looked for pity, but there was none,\n   and for comforters, but I found none.\n21They gave me poison for food,\n   and for my thirst they gave me sour wine to drink.\n22Let their own table before them become a snare;\n  and when they are at peace, let it become a\ntrap.\n23Let their eyes be darkened, so that they cannot\nsee,\n  and make their loins tremble continually.\n24Pour out your indignation upon them,\n  and let your burning anger overtake them.\n25May their camp be a desolation;\n  let no one dwell in their tents.\n26For they persecute him whom you have struck\ndown,\n  and they recount the pain of those you have\nwounded.\n27Add to them punishment upon punishment;\n  may they have no acquittal from you.\n28Let them be blotted out of the book of the living;\n let them not be enrolled among the righteous.\n29But I am afflicted and in pain;\n let your salvation, O God, set me on high!\n30I will praise the name of God with a song;\n I will magnify him with thanksgiving.\n31This will please the LORD more than an ox\n or a bull with horns and hoofs.\n32When the humble see it they will be glad;\n you who seek God, let your hearts revive.\n33For the LORD hears the needy\n  and does not despise his own people who are\nprisoners.\n34Let heaven and earth praise him,\n the seas and everything that moves in them.\n35For God will save Zion\n and build up the cities of Judah,\nand people shall dwell there and possess it;\n 36the offspring of his servants shall inherit it,\nand those who love his name shall dwell in it.\n"}, {"header": "          O LORD, Do Not Delay\n    To the choirmaster. Of David, for the\n             memorial offering.\n", "verse": "Psalms 70", "text": "70:1 Make haste, O God, to deliver me!\n O LORD, make haste to help me!\n2Let them be put to shame and confusion\n  who seek my life!\nLet them be turned back and brought to dishonor\n  who delight in my hurt!\n3Let them turn back because of their shame\n  who say, \"Aha, Aha!\"\n4May all who seek you\n rejoice and be glad in you!\nMay those who love your salvation\n say evermore, \"God is great!\"\n5But I am poor and needy;\n hasten to me, O God!\nYou are my help and my deliverer;\n O LORD, do not delay!\n  Forsake Me Not When My Strength Is\n"}, {"header": "", "verse": "Psalms 71", "text": "                Spent\n71:1 In you, O LORD, do I take refuge;\n let me never be put to shame!\n2In your righteousness deliver me and rescue me;\n incline your ear to me, and save me!\n3Be to me a rock of refuge,\n  to which I may continually come;\nyou have given the command to save me,\n  for you are my rock and my fortress.\n4Rescue me, O my God, from the hand of the\nwicked,\n  from the grasp of the unjust and cruel man.\n5For you, O Lord, are my hope,\n  my trust, O LORD, from my youth.\n6Upon you I have leaned from before my birth;\n  you are he who took me from my mother's womb.\nMy praise is continually of you.\n7I have been as a portent to many,\n but you are my strong refuge.\n8My mouth is filled with your praise,\n and with your glory all the day.\n9Do not cast me off in the time of old age;\n forsake me not when my strength is spent.\n10For my enemies speak concerning me;\n those who watch for my life consult together\n11and say, \"God has forsaken him;\n pursue and seize him,\n for there is none to deliver him.\"\n12O God, be not far from me;\n O my God, make haste to help me!\n13May my accusers be put to shame and consumed;\n  with scorn and disgrace may they be covered\n  who seek my hurt.\n14But I will hope continually\n  and will praise you yet more and more.\n15My mouth will tell of your righteous acts,\n  of your deeds of salvation all the day,\n  for their number is past my knowledge.\n16With the mighty deeds of the Lord GOD I will\ncome;\n  I will remind them of your righteousness, yours\nalone.\n17O God, from my youth you have taught me,\n and I still proclaim your wondrous deeds.\n18So even to old age and gray hairs,\n  O God, do not forsake me,\nuntil I proclaim your might to another generation,\n  your power to all those to come.\n19Your righteousness, O God,\n  reaches the high heavens.\nYou who have done great things,\n  O God, who is like you?\n20You who have made me see many troubles and\ncalamities\n  will revive me again;\nfrom the depths of the earth\n  you will bring me up again.\n21You will increase my greatness\n  and comfort me again.\n22I will also praise you with the harp\n  for your faithfulness, O my God;\nI will sing praises to you with the lyre,\n  O Holy One of Israel.\n23My lips will shout for joy,\n  when I sing praises to you;\n  my soul also, which you have redeemed.\n24And my tongue will talk of your righteous help all\nthe day long,\nfor they have been put to shame and disappointed\n  who sought to do me hurt.\n"}, {"header": "         Give the King Your Justice\n                Of Solomon.\n", "verse": "Psalms 72", "text": "72:1 Give the king your justice, O God,\n and your righteousness to the royal son!\n2May he judge your people with righteousness,\n and your poor with justice!\n3Let the mountains bear prosperity for the people,\n and the hills, in righteousness!\n4May he defend the cause of the poor of the people,\n give deliverance to the children of the needy,\n and crush the oppressor!\n5May they fear you while the sun endures,\n  and as long as the moon, throughout all\ngenerations!\n6May he be like rain that falls on the mown grass,\n  like showers that water the earth!\n7In his days may the righteous flourish,\n  and peace abound, till the moon be no more!\n8May he have dominion from sea to sea,\n and from the River to the ends of the earth!\n9May desert tribes bow down before him,\n and his enemies lick the dust!\n10May the kings of Tarshish and of the coastlands\n  render him tribute;\nmay the kings of Sheba and Seba\n  bring gifts!\n11May all kings fall down before him,\n  all nations serve him!\n12For he delivers the needy when he calls,\n the poor and him who has no helper.\n13He has pity on the weak and the needy,\n and saves the lives of the needy.\n14From oppression and violence he redeems their\nlife,\n   and precious is their blood in his sight.\n15Long may he live;\n  may gold of Sheba be given to him!\nMay prayer be made for him continually,\n  and blessings invoked for him all the day!\n16May there be abundance of grain in the land;\n  on the tops of the mountains may it wave;\n  may its fruit be like Lebanon;\nand may people blossom in the cities\n  like the grass of the field!\n17May his name endure forever,\n  his fame continue as long as the sun!\nMay people be blessed in him,\n  all nations call him blessed!\n18Blessed be the LORD, the God of Israel,\n who alone does wondrous things.\n19Blessed be his glorious name forever;\n may the whole earth be filled with his glory!\n  Amen and Amen!\n20The prayers of David, the son of Jesse, are ended.\n God Is My Strength and Portion Forever\n"}, {"header": "           A Psalm of Asaph.\n", "verse": "Psalms 73", "text": "73:1 Truly God is good to Israel,\n to those who are pure in heart.\n2But as for me, my feet had almost stumbled,\n my steps had nearly slipped.\n3For I was envious of the arrogant\n when I saw the prosperity of the wicked.\n4For they have no pangs until death;\n their bodies are fat and sleek.\n5They are not in trouble as others are;\n they are not stricken like the rest of mankind.\n6Therefore pride is their necklace;\n violence covers them as a garment.\n7Their eyes swell out through fatness;\n their hearts overflow with follies.\n8They scoff and speak with malice;\n loftily they threaten oppression.\n9They set their mouths against the heavens,\n  and their tongue struts through the earth.\n10Therefore his people turn back to them,\n  and find no fault in them.\n11And they say, \"How can God know?\n  Is there knowledge in the Most High?\"\n12Behold, these are the wicked;\n  always at ease, they increase in riches.\n13All in vain have I kept my heart clean\n  and washed my hands in innocence.\n14For all the day long I have been stricken\n  and rebuked every morning.\n15If I had said, \"I will speak thus,\"\n  I would have betrayed the generation of your\nchildren.\n16But when I thought how to understand this,\n  it seemed to me a wearisome task,\n17until I went into the sanctuary of God;\n  then I discerned their end.\n18Truly you set them in slippery places;\n  you make them fall to ruin.\n19How they are destroyed in a moment,\n swept away utterly by terrors!\n20Like a dream when one awakes,\n  O Lord, when you rouse yourself, you despise them\nas phantoms.\n21When my soul was embittered,\n  when I was pricked in heart,\n22I was brutish and ignorant;\n  I was like a beast toward you.\n23Nevertheless, I am continually with you;\n you hold my right hand.\n24You guide me with your counsel,\n and afterward you will receive me to glory.\n25Whom have I in heaven but you?\n  And there is nothing on earth that I desire besides\nyou.\n26My flesh and my heart may fail,\n  but God is the strength of my heart and my\nportion forever.\n27For behold, those who are far from you shall\nperish;\n  you put an end to everyone who is unfaithful to you.\n28But for me it is good to be near God;\n  I have made the Lord GOD my refuge,\n  that I may tell of all your works.\n"}, {"header": "     Arise, O God, Defend Your Cause\n             A Maskil of Asaph.\n", "verse": "Psalms 74", "text": "74:1 O God, why do you cast us off forever?\n  Why does your anger smoke against the sheep of\nyour pasture?\n2Remember your congregation, which you have\npurchased of old,\n  which you have redeemed to be the tribe of your\nheritage!\n  Remember Mount Zion, where you have dwelt.\n3Direct your steps to the perpetual ruins;\n  the enemy has destroyed everything in the\nsanctuary!\n4Your foes have roared in the midst of your meeting\nplace;\n  they set up their own signs for signs.\n5They were like those who swing axes\n  in a forest of trees.\n6And all its carved wood\n they broke down with hatchets and hammers.\n7They set your sanctuary on fire;\n  they profaned the dwelling place of your name,\n  bringing it down to the ground.\n8They said to themselves, \"We will utterly subdue\nthem\";\n  they burned all the meeting places of God in the\nland.\n9We do not see our signs;\n  there is no longer any prophet,\n  and there is none among us who knows how long.\n10How long, O God, is the foe to scoff?\n  Is the enemy to revile your name forever?\n11Why do you hold back your hand, your right hand?\n  Take it from the fold of your garment and\ndestroy them!\n12Yet God my King is from of old,\n working salvation in the midst of the earth.\n13You divided the sea by your might;\n  you broke the heads of the sea monsters on\nthe waters.\n14You crushed the heads of Leviathan;\n  you gave him as food for the creatures of the\nwilderness.\n15You split open springs and brooks;\n  you dried up ever-flowing streams.\n16Yours is the day, yours also the night;\n  you have established the heavenly lights and the\nsun.\n17You have fixed all the boundaries of the earth;\n  you have made summer and winter.\n18Remember this, O LORD, how the enemy scoffs,\n and a foolish people reviles your name.\n19Do not deliver the soul of your dove to the wild\nbeasts;\n do not forget the life of your poor forever.\n20Have regard for the covenant,\n  for the dark places of the land are full of the\nhabitations of violence.\n21Let not the downtrodden turn back in shame;\n  let the poor and needy praise your name.\n22Arise, O God, defend your cause;\n remember how the foolish scoff at you all the day!\n23Do not forget the clamor of your foes,\n the uproar of those who rise against you, which\ngoes up continually!\n"}, {"header": "        God Will Judge with Equity\n   To the choirmaster: according to Do Not\n    Destroy. A Psalm of Asaph. A Song.\n", "verse": "Psalms 75", "text": "75:1 We give thanks to you, O God;\n we give thanks, for your name is near.\nWe recount your wondrous deeds.\n2\"At the set time that I appoint\n I will judge with equity.\n3When the earth totters, and all its inhabitants,\n it is I who keep steady its pillars. Selah\n4I say to the boastful, 'Do not boast,'\n and to the wicked, 'Do not lift up your horn;\n5do not lift up your horn on high,\n or speak with haughty neck.'\"\n6For not from the east or from the west\n and not from the wilderness comes lifting up,\n7but it is God who executes judgment,\n putting down one and lifting up another.\n8For in the hand of the LORD there is a cup\n with foaming wine, well mixed,\nand he pours out from it,\n and all the wicked of the earth\n shall drain it down to the dregs.\n9But I will declare it forever;\n I will sing praises to the God of Jacob.\n10All the horns of the wicked I will cut off,\n but the horns of the righteous shall be lifted up.\n"}, {"header": "        Who Can Stand Before You?\nTo the choirmaster: with stringed instruments.\n         A Psalm of Asaph. A Song.\n", "verse": "Psalms 76", "text": "76:1 In Judah God is known;\n his name is great in Israel.\n2His abode has been established in Salem,\n his dwelling place in Zion.\n3There he broke the flashing arrows,\n the shield, the sword, and the weapons of war.\nSelah\n4Glorious are you, more majestic\n than the mountains of prey.\n5The stouthearted were stripped of their spoil;\n  they sank into sleep;\nall the men of war\n  were unable to use their hands.\n6At your rebuke, O God of Jacob,\n  both rider and horse lay stunned.\n7But you, you are to be feared!\n  Who can stand before you\n  when once your anger is roused?\n8From the heavens you uttered judgment;\n  the earth feared and was still,\n9when God arose to establish judgment,\n  to save all the humble of the earth. Selah\n10Surely the wrath of man shall praise you;\n  the remnant of wrath you will put on like a belt.\n11Make your vows to the LORD your God and\nperform them;\n  let all around him bring gifts\n  to him who is to be feared,\n12who cuts off the spirit of princes,\n  who is to be feared by the kings of the earth.\n  In the Day of Trouble I Seek the Lord\n"}, {"header": "To the choirmaster: according to Jeduthun. A\n             Psalm of Asaph.\n", "verse": "Psalms 77", "text": "77:1 I cry aloud to God,\n aloud to God, and he will hear me.\n2In the day of my trouble I seek the Lord;\n in the night my hand is stretched out without\nwearying;\n my soul refuses to be comforted.\n3When I remember God, I moan;\n when I meditate, my spirit faints. Selah\n4You hold my eyelids open;\n I am so troubled that I cannot speak.\n5I consider the days of old,\n the years long ago.\n6I said, \"Let me remember my song in the night;\n  let me meditate in my heart.\"\n  Then my spirit made a diligent search:\n7\"Will the Lord spurn forever,\n and never again be favorable?\n8Has his steadfast love forever ceased?\n Are his promises at an end for all time?\n9Has God forgotten to be gracious?\n Has he in anger shut up his compassion?\" Selah\n10Then I said, \"I will appeal to this,\n to the years of the right hand of the Most High.\"\n11I will remember the deeds of the LORD;\n yes, I will remember your wonders of old.\n12I will ponder all your work,\n and meditate on your mighty deeds.\n13Your way, O God, is holy.\n What god is great like our God?\n14You are the God who works wonders;\n  you have made known your might among the\npeoples.\n15You with your arm redeemed your people,\n  the children of Jacob and Joseph. Selah\n16When the waters saw you, O God,\n when the waters saw you, they were afraid;\n indeed, the deep trembled.\n17The clouds poured out water;\n  the skies gave forth thunder;\n  your arrows flashed on every side.\n18The crash of your thunder was in the whirlwind;\n  your lightnings lighted up the world;\n  the earth trembled and shook.\n19Your way was through the sea,\n  your path through the great waters;\n  yet your footprints were unseen.\n20You led your people like a flock\n  by the hand of Moses and Aaron.\n"}, {"header": "         Tell the Coming Generation\n             A Maskil of Asaph.\n", "verse": "Psalms 78", "text": "78:1 Give ear, O my people, to my teaching;\n incline your ears to the words of my mouth!\n2I will open my mouth in a parable;\n I will utter dark sayings from of old,\n3things that we have heard and known,\n that our fathers have told us.\n4We will not hide them from their children,\n  but tell to the coming generation\nthe glorious deeds of the LORD, and his might,\n  and the wonders that he has done.\n5He established a testimony in Jacob\n  and appointed a law in Israel,\nwhich he commanded our fathers\n  to teach to their children,\n6that the next generation might know them,\n  the children yet unborn,\nand arise and tell them to their children,\n 7so that they should set their hope in God\nand not forget the works of God,\n  but keep his commandments;\n8and that they should not be like their fathers,\n  a stubborn and rebellious generation,\na generation whose heart was not steadfast,\n  whose spirit was not faithful to God.\n9The Ephraimites, armed with the bow,\n turned back on the day of battle.\n10They did not keep God's covenant,\n but refused to walk according to his law.\n11They forgot his works\n and the wonders that he had shown them.\n12In the sight of their fathers he performed wonders\n in the land of Egypt, in the fields of Zoan.\n13He divided the sea and let them pass through it,\n and made the waters stand like a heap.\n14In the daytime he led them with a cloud,\n and all the night with a fiery light.\n15He split rocks in the wilderness\n and gave them drink abundantly as from the deep.\n16He made streams come out of the rock\n and caused waters to flow down like rivers.\n17Yet they sinned still more against him,\n rebelling against the Most High in the desert.\n18They tested God in their heart\n by demanding the food they craved.\n19They spoke against God, saying,\n \"Can God spread a table in the wilderness?\n20He struck the rock so that water gushed out\n and streams overflowed.\nCan he also give bread\n or provide meat for his people?\"\n21Therefore, when the LORD heard, he was full of\nwrath;\n  a fire was kindled against Jacob;\n  his anger rose against Israel,\n22because they did not believe in God\n  and did not trust his saving power.\n23Yet he commanded the skies above\n  and opened the doors of heaven,\n24and he rained down on them manna to eat\n  and gave them the grain of heaven.\n25Man ate of the bread of the angels;\n  he sent them food in abundance.\n26He caused the east wind to blow in the heavens,\n  and by his power he led out the south wind;\n27he rained meat on them like dust,\n  winged birds like the sand of the seas;\n28he let them fall in the midst of their camp,\n  all around their dwellings.\n29And they ate and were well filled,\n  for he gave them what they craved.\n30But before they had satisfied their craving,\n  while the food was still in their mouths,\n31the anger of God rose against them,\n  and he killed the strongest of them\n  and laid low the young men of Israel.\n32In spite of all this, they still sinned;\n  despite his wonders, they did not believe.\n33So he made their days vanish like a\nbreath,\n and their years in terror.\n34When he killed them, they sought him;\n they repented and sought God earnestly.\n35They remembered that God was their rock,\n the Most High God their redeemer.\n36But they flattered him with their mouths;\n they lied to him with their tongues.\n37Their heart was not steadfast toward him;\n they were not faithful to his covenant.\n38Yet he, being compassionate,\n  atoned for their iniquity\n  and did not destroy them;\nhe restrained his anger often\n  and did not stir up all his wrath.\n39He remembered that they were but flesh,\n  a wind that passes and comes not again.\n40How often they rebelled against him in the\nwilderness\n  and grieved him in the desert!\n41They tested God again and again\n  and provoked the Holy One of Israel.\n42They did not remember his power\n or the day when he redeemed them from the foe,\n43when he performed his signs in Egypt\n and his marvels in the fields of Zoan.\n44He turned their rivers to blood,\n so that they could not drink of their streams.\n45He sent among them swarms of flies, which\ndevoured them,\n  and frogs, which destroyed them.\n46He gave their crops to the destroying locust\n  and the fruit of their labor to the locust.\n47He destroyed their vines with hail\n  and their sycamores with frost.\n48He gave over their cattle to the hail\n  and their flocks to thunderbolts.\n49He let loose on them his burning anger,\n  wrath, indignation, and distress,\n  a company of destroying angels.\n50He made a path for his anger;\n  he did not spare them from death,\n  but gave their lives over to the plague.\n51He struck down every firstborn in Egypt,\n  the firstfruits of their strength in the tents of Ham.\n52Then he led out his people like sheep\n and guided them in the wilderness like a flock.\n53He led them in safety, so that they were not afraid,\n but the sea overwhelmed their enemies.\n54And he brought them to his holy land,\n to the mountain which his right hand had won.\n55He drove out nations before them;\n he apportioned them for a possession\n and settled the tribes of Israel in their tents.\n56Yet they tested and rebelled against the Most High\nGod\n  and did not keep his testimonies,\n57but turned away and acted treacherously like their\nfathers;\n  they twisted like a deceitful bow.\n58For they provoked him to anger with their high\nplaces;\n  they moved him to jealousy with their idols.\n59When God heard, he was full of wrath,\n  and he utterly rejected Israel.\n60He forsook his dwelling at Shiloh,\n the tent where he dwelt among mankind,\n61and delivered his power to captivity,\n his glory to the hand of the foe.\n62He gave his people over to the sword\n and vented his wrath on his heritage.\n63Fire devoured their young men,\n and their young women had no marriage song.\n64Their priests fell by the sword,\n and their widows made no lamentation.\n65Then the Lord awoke as from sleep,\n like a strong man shouting because of wine.\n66And he put his adversaries to rout;\n he put them to everlasting shame.\n67He rejected the tent of Joseph;\n he did not choose the tribe of Ephraim,\n68but he chose the tribe of Judah,\n Mount Zion, which he loves.\n69He built his sanctuary like the high heavens,\n like the earth, which he has founded forever.\n70He chose David his servant\n and took him from the sheepfolds;\n71from following the nursing ewes he brought him\n  to shepherd Jacob his people,\n  Israel his inheritance.\n72With upright heart he shepherded them\n  and guided them with his skillful hand.\n"}, {"header": "              How Long, O LORD?\n               A Psalm of Asaph.\n", "verse": "Psalms 79", "text": "79:1 O God, the nations have come into your\ninheritance;\n  they have defiled your holy temple;\n  they have laid Jerusalem in ruins.\n2They have given the bodies of your servants\n  to the birds of the heavens for food,\n  the flesh of your faithful to the beasts of the earth.\n3They have poured out their blood like water\n  all around Jerusalem,\n  and there was no one to bury them.\n4We have become a taunt to our neighbors,\n  mocked and derided by those around us.\n5How long, O LORD? Will you be angry forever?\n Will your jealousy burn like fire?\n6Pour out your anger on the nations\n that do not know you,\nand on the kingdoms\n that do not call upon your name!\n7For they have devoured Jacob\n and laid waste his habitation.\n8Do not remember against us our former\niniquities;\n  let your compassion come speedily to meet us,\n  for we are brought very low.\n9Help us, O God of our salvation,\n  for the glory of your name;\ndeliver us, and atone for our sins,\n  for your name's sake!\n10Why should the nations say,\n  \"Where is their God?\"\nLet the avenging of the outpoured blood of your\nservants\n  be known among the nations before our eyes!\n11Let the groans of the prisoners come before you;\n  according to your great power, preserve those\ndoomed to die!\n12Return sevenfold into the lap of our neighbors\n  the taunts with which they have taunted you, O\nLord!\n13But we your people, the sheep of your pasture,\n  will give thanks to you forever;\n  from generation to generation we will recount your\npraise.\n"}, {"header": "            Restore Us, O God\n  To the choirmaster: according to Lilies. A\n       Testimony. Of Asaph, a Psalm.\n", "verse": "Psalms 80", "text": "80:1 Give ear, O Shepherd of Israel,\n  you who lead Joseph like a flock!\nYou who are enthroned upon the cherubim, shine\nforth.\n  2Before Ephraim and Benjamin and Manasseh,\nstir up your might\n  and come to save us!\n3Restore us, O God;\n let your face shine, that we may be saved!\n4O LORD God of hosts,\n  how long will you be angry with your people's\nprayers?\n5You have fed them with the bread of tears\n  and given them tears to drink in full measure.\n6You make us an object of contention for our\nneighbors,\n and our enemies laugh among themselves.\n7Restore us, O God of hosts;\n let your face shine, that we may be saved!\n8You brought a vine out of Egypt;\n you drove out the nations and planted it.\n9You cleared the ground for it;\n it took deep root and filled the land.\n10The mountains were covered with its shade,\n the mighty cedars with its branches.\n11It sent out its branches to the sea\n  and its shoots to the River.\n12Why then have you broken down its walls,\n so that all who pass along the way pluck its fruit?\n13The boar from the forest ravages it,\n and all that move in the field feed on it.\n14Turn again, O God of hosts!\n Look down from heaven, and see;\nhave regard for this vine,\n 15the stock that your right hand planted,\n and for the son whom you made strong for yourself.\n16They have burned it with fire; they have cut it down;\n may they perish at the rebuke of your face!\n17But let your hand be on the man of your right hand,\n  the son of man whom you have made strong for\nyourself!\n18Then we shall not turn back from you;\n  give us life, and we will call upon your name!\n19Restore us, O LORD God of hosts!\n Let your face shine, that we may be saved!\n Oh, That My People Would Listen to Me\n"}, {"header": "   To the choirmaster: according to The\n          Gittith. Of Asaph.\n", "verse": "Psalms 81", "text": "81:1 Sing aloud to God our strength;\n shout for joy to the God of Jacob!\n2Raise a song; sound the tambourine,\n the sweet lyre with the harp.\n3Blow the trumpet at the new moon,\n at the full moon, on our feast day.\n4For it is a statute for Israel,\n  a rule of the God of Jacob.\n5He made it a decree in Joseph\n  when he went out over the land of Egypt.\nI hear a language I had not known:\n6\"I relieved your shoulder of the burden;\n   your hands were freed from the basket.\n7In distress you called, and I delivered you;\n   I answered you in the secret place of thunder;\n   I tested you at the waters of Meribah. Selah\n8Hear, O my people, while I admonish you!\n O Israel, if you would but listen to me!\n9There shall be no strange god among you;\n you shall not bow down to a foreign god.\n10I am the LORD your God,\n who brought you up out of the land of Egypt.\n Open your mouth wide, and I will fill it.\n11\"But my people did not listen to my voice;\n Israel would not submit to me.\n12So I gave them over to their stubborn hearts,\n to follow their own counsels.\n13Oh, that my people would listen to me,\n that Israel would walk in my ways!\n14I would soon subdue their enemies\n and turn my hand against their foes.\n15Those who hate the LORD would cringe toward\nhim,\n  and their fate would last forever.\n16But he would feed you with the finest of the\nwheat,\n  and with honey from the rock I would satisfy you.\"\n"}, {"header": "         Rescue the Weak and Needy\n              A Psalm of Asaph.\n", "verse": "Psalms 82", "text": "82:1 God has taken his place in the divine council;\n in the midst of the gods he holds judgment:\n2\"How long will you judge unjustly\n and show partiality to the wicked? Selah\n3Give justice to the weak and the fatherless;\n maintain the right of the afflicted and the destitute.\n4Rescue the weak and the needy;\n deliver them from the hand of the wicked.\"\n5They have neither knowledge nor understanding,\n they walk about in darkness;\n all the foundations of the earth are shaken.\n6I said, \"You are gods,\n sons of the Most High, all of you;\n7nevertheless, like men you shall die,\n  and fall like any prince.\"\n8Arise, O God, judge the earth;\nfor you shall inherit all the nations!\n"}, {"header": "        O God, Do Not Keep Silence\n         A Song. A Psalm of Asaph.\n", "verse": "Psalms 83", "text": "83:1 O God, do not keep silence;\n do not hold your peace or be still, O God!\n2For behold, your enemies make an uproar;\n those who hate you have raised their heads.\n3They lay crafty plans against your people;\n they consult together against your treasured ones.\n4They say, \"Come, let us wipe them out as a nation;\n let the name of Israel be remembered no more!\"\n5For they conspire with one accord;\n against you they make a covenant-\n6the tents of Edom and the Ishmaelites,\n Moab and the Hagrites,\n7Gebal and Ammon and Amalek,\n Philistia with the inhabitants of Tyre;\n8Asshur also has joined them;\n they are the strong arm of the children of Lot.\nSelah\n9Do to them as you did to Midian,\n as to Sisera and Jabin at the river Kishon,\n10who were destroyed at En-dor,\n who became dung for the ground.\n11Make their nobles like Oreb and Zeeb,\n all their princes like Zebah and Zalmunna,\n12who said, \"Let us take possession for ourselves\n of the pastures of God.\"\n13O my God, make them like whirling dust,\n like chaff before the wind.\n14As fire consumes the forest,\n as the flame sets the mountains ablaze,\n15so may you pursue them with your tempest\n and terrify them with your hurricane!\n16Fill their faces with shame,\n that they may seek your name, O LORD.\n17Let them be put to shame and dismayed forever;\n let them perish in disgrace,\n18that they may know that you alone,\n whose name is the LORD,\n are the Most High over all the earth.\n   My Soul Longs for the Courts of the\n                     LORD\n"}, {"header": "    To the choirmaster: according to The\n  Gittith. A Psalm of the Sons of Korah.\n", "verse": "Psalms 84", "text": "84:1 How lovely is your dwelling place,\n O LORD of hosts!\n2My soul longs, yes, faints\n for the courts of the LORD;\nmy heart and flesh sing for joy\n to the living God.\n3Even the sparrow finds a home,\n  and the swallow a nest for herself,\n  where she may lay her young,\nat your altars, O LORD of hosts,\n  my King and my God.\n4Blessed are those who dwell in your house,\n  ever singing your praise! Selah\n5Blessed are those whose strength is in you,\n in whose heart are the highways to Zion.\n6As they go through the Valley of Baca\n  they make it a place of springs;\n  the early rain also covers it with pools.\n7They go from strength to strength;\n  each one appears before God in Zion.\n8O LORD God of hosts, hear my prayer;\n give ear, O God of Jacob! Selah\n9Behold our shield, O God;\n look on the face of your anointed!\n10For a day in your courts is better\n  than a thousand elsewhere.\nI would rather be a doorkeeper in the house of my\nGod\n  than dwell in the tents of wickedness.\n11For the LORD God is a sun and shield;\n  the LORD bestows favor and honor.\nNo good thing does he withhold\n  from those who walk uprightly.\n12O LORD of hosts,\n  blessed is the one who trusts in you!\n"}, {"header": "             Revive Us Again\n To the choirmaster. A Psalm of the Sons of\n", "verse": "Psalms 85", "text": "                  Korah.\n85:1 LORD, you were favorable to your land;\n you restored the fortunes of Jacob.\n2You forgave the iniquity of your people;\n you covered all their sin. Selah\n3You withdrew all your wrath;\n you turned from your hot anger.\n4Restore us again, O God of our salvation,\n and put away your indignation toward us!\n5Will you be angry with us forever?\n Will you prolong your anger to all generations?\n6Will you not revive us again,\n that your people may rejoice in you?\n7Show us your steadfast love, O LORD,\n and grant us your salvation.\n8Let me hear what God the LORD will speak,\n for he will speak peace to his people, to his saints;\n but let them not turn back to folly.\n9Surely his salvation is near to those who fear him,\n that glory may dwell in our land.\n10Steadfast love and faithfulness meet;\n righteousness and peace kiss each other.\n11Faithfulness springs up from the ground,\n and righteousness looks down from the sky.\n12Yes, the LORD will give what is good,\n and our land will yield its increase.\n13Righteousness will go before him\n and make his footsteps a way.\n"}, {"header": "        Great Is Your Steadfast Love\n             A Prayer of David.\n", "verse": "Psalms 86", "text": "86:1 Incline your ear, O LORD, and answer me,\n for I am poor and needy.\n2Preserve my life, for I am godly;\n  save your servant, who trusts in you-you are my\nGod.\n3Be gracious to me, O Lord,\n  for to you do I cry all the day.\n4Gladden the soul of your servant,\n  for to you, O Lord, do I lift up my soul.\n5For you, O Lord, are good and forgiving,\n  abounding in steadfast love to all who call upon\nyou.\n6Give ear, O LORD, to my prayer;\n  listen to my plea for grace.\n7In the day of my trouble I call upon you,\n  for you answer me.\n8There is none like you among the gods, O Lord,\n nor are there any works like yours.\n9All the nations you have made shall come\n  and worship before you, O Lord,\n  and shall glorify your name.\n10For you are great and do wondrous things;\n  you alone are God.\n11Teach me your way, O LORD,\n  that I may walk in your truth;\n  unite my heart to fear your name.\n12I give thanks to you, O Lord my God, with my whole\nheart,\n  and I will glorify your name forever.\n13For great is your steadfast love toward me;\n  you have delivered my soul from the depths of\nSheol.\n14O God, insolent men have risen up against me;\n  a band of ruthless men seeks my life,\n  and they do not set you before them.\n15But you, O Lord, are a God merciful and gracious,\n  slow to anger and abounding in steadfast love and\nfaithfulness.\n16Turn to me and be gracious to me;\n  give your strength to your servant,\n  and save the son of your maidservant.\n17Show me a sign of your favor,\n  that those who hate me may see and be put to\nshame\n  because you, LORD, have helped me and\ncomforted me.\n"}, {"header": "   Glorious Things of You Are Spoken\n   A Psalm of the Sons of Korah. A Song.\n", "verse": "Psalms 87", "text": "87:1 On the holy mount stands the city he founded;\n 2the LORD loves the gates of Zion\n more than all the dwelling places of Jacob.\n3Glorious things of you are spoken,\n O city of God. Selah\n4Among those who know me I mention Rahab and\nBabylon;\n  behold, Philistia and Tyre, with Cush-\n  \"This one was born there,\" they say.\n5And of Zion it shall be said,\n  \"This one and that one were born in her\";\n  for the Most High himself will establish her.\n6The LORD records as he registers the peoples,\n  \"This one was born there.\" Selah\n7Singers and dancers alike say,\n \"All my springs are in you.\"\n"}, {"header": "   I Cry Out Day and Night Before You\nA Song. A Psalm of the Sons of Korah. To the\nchoirmaster: according to Mahalath Leannoth.\n    A Maskil of Heman the Ezrahite.\n", "verse": "Psalms 88", "text": "88:1 O LORD, God of my salvation;\n I cry out day and night before you.\n2Let my prayer come before you;\n incline your ear to my cry!\n3For my soul is full of troubles,\n and my life draws near to Sheol.\n4I am counted among those who go down to the pit;\n I am a man who has no strength,\n5like one set loose among the dead,\n   like the slain that lie in the grave,\nlike those whom you remember no more,\n   for they are cut off from your hand.\n6You have put me in the depths of the pit,\n   in the regions dark and deep.\n7Your wrath lies heavy upon me,\n and you overwhelm me with all your waves. Selah\n8You have caused my companions to shun me;\n  you have made me a horror to them.\nI am shut in so that I cannot escape;\n   9my eye grows dim through sorrow.\nEvery day I call upon you, O LORD;\n   I spread out my hands to you.\n10Do you work wonders for the dead?\n   Do the departed rise up to praise you? Selah\n11Is your steadfast love declared in the grave,\n   or your faithfulness in Abaddon?\n12Are your wonders known in the darkness,\n   or your righteousness in the land of forgetfulness?\n13But I, O LORD, cry to you;\n in the morning my prayer comes before you.\n14O LORD, why do you cast my soul away?\n Why do you hide your face from me?\n15Afflicted and close to death from my youth up,\n  I suffer your terrors; I am helpless.\n16Your wrath has swept over me;\n your dreadful assaults destroy me.\n17They surround me like a flood all day long;\n they close in on me together.\n18You have caused my beloved and my friend to\nshun me;\n  my companions have become darkness.\n  I Will Sing of the Steadfast Love of the\n                   LORD\n"}, {"header": "      A Maskil of Ethan the Ezrahite.\n", "verse": "Psalms 89", "text": "89:1 I will sing of the steadfast love of the LORD,\nforever;\n  with my mouth I will make known your faithfulness\nto all generations.\n2For I said, \"Steadfast love will be built up forever;\n  in the heavens you will establish your faithfulness.\"\n3You have said, \"I have made a covenant with my\nchosen one;\n  I have sworn to David my servant:\n4'I will establish your offspring forever,\n  and build your throne for all generations.'\" Selah\n5Let the heavens praise your wonders, O LORD,\n your faithfulness in the assembly of the holy ones!\n6For who in the skies can be compared to the\nLORD?\n Who among the heavenly beings is like the\nLORD,\n7a God greatly to be feared in the council of the holy\nones,\n  and awesome above all who are around him?\n8O LORD God of hosts,\n  who is mighty as you are, O LORD,\n  with your faithfulness all around you?\n9You rule the raging of the sea;\n  when its waves rise, you still them.\n10You crushed Rahab like a carcass;\n  you scattered your enemies with your mighty arm.\n11The heavens are yours; the earth also is yours;\n  the world and all that is in it, you have founded\nthem.\n12The north and the south, you have created them;\n  Tabor and Hermon joyously praise your name.\n13You have a mighty arm;\n  strong is your hand, high your right hand.\n14Righteousness and justice are the foundation of\nyour throne;\n  steadfast love and faithfulness go before you.\n15Blessed are the people who know the festal shout,\n who walk, O LORD, in the light of your face,\n16who exult in your name all the day\n and in your righteousness are exalted.\n17For you are the glory of their strength;\n by your favor our horn is exalted.\n18For our shield belongs to the LORD,\n our king to the Holy One of Israel.\n19Of old you spoke in a vision to your godly one,\nand said:\n  \"I have granted help to one who is mighty;\n  I have exalted one chosen from the people.\n20I have found David, my servant;\n  with my holy oil I have anointed him,\n21so that my hand shall be established with him;\n  my arm also shall strengthen him.\n22The enemy shall not outwit him;\n  the wicked shall not humble him.\n23I will crush his foes before him\n  and strike down those who hate him.\n24My faithfulness and my steadfast love shall be with\nhim,\n and in my name shall his horn be exalted.\n25I will set his hand on the sea\n and his right hand on the rivers.\n26He shall cry to me, 'You are my Father,\n my God, and the Rock of my salvation.'\n27And I will make him the firstborn,\n the highest of the kings of the earth.\n28My steadfast love I will keep for him forever,\n  and my covenant will stand firm for him.\n29I will establish his offspring forever\n and his throne as the days of the heavens.\n30If his children forsake my law\n and do not walk according to my rules,\n31if they violate my statutes\n and do not keep my commandments,\n32then I will punish their transgression with the rod\n and their iniquity with stripes,\n33but I will not remove from him my steadfast love\n or be false to my faithfulness.\n34I will not violate my covenant\n or alter the word that went forth from my lips.\n35Once for all I have sworn by my holiness;\n I will not lie to David.\n36His offspring shall endure forever,\n his throne as long as the sun before me.\n37Like the moon it shall be established forever,\n a faithful witness in the skies.\" Selah\n38But now you have cast off and rejected;\n you are full of wrath against your anointed.\n39You have renounced the covenant with your\nservant;\n  you have defiled his crown in the dust.\n40You have breached all his walls;\n  you have laid his strongholds in ruins.\n41All who pass by plunder him;\n  he has become the scorn of his neighbors.\n42You have exalted the right hand of his foes;\n  you have made all his enemies rejoice.\n43You have also turned back the edge of his sword,\n  and you have not made him stand in battle.\n44You have made his splendor to cease\n  and cast his throne to the ground.\n45You have cut short the days of his youth;\n you have covered him with shame. Selah\n46How long, O LORD? Will you hide yourself\nforever?\n  How long will your wrath burn like fire?\n47Remember how short my time is!\n  For what vanity you have created all the children of\nman!\n48What man can live and never see death?\n  Who can deliver his soul from the power of Sheol?\nSelah\n49Lord, where is your steadfast love of old,\n which by your faithfulness you swore to David?\n50Remember, O Lord, how your servants are\nmocked,\n  and how I bear in my heart the insults of all the\nmany nations,\n51with which your enemies mock, O LORD,\n  with which they mock the footsteps of your\nanointed.\n52Blessed be the LORD forever!\nAmen and Amen.\n"}, {"header": "      From Everlasting to Everlasting\n     A Prayer of Moses, the man of God.\n", "verse": "Psalms 90", "text": "90:1 Lord, you have been our dwelling place\n in all generations.\n2Before the mountains were brought forth,\n or ever you had formed the earth and the world,\n from everlasting to everlasting you are God.\n3You return man to dust\n and say, \"Return, O children of man!\"\n4For a thousand years in your sight\n are but as yesterday when it is past,\n or as a watch in the night.\n5You sweep them away as with a flood; they are like\na dream,\n  like grass that is renewed in the morning:\n6in the morning it flourishes and is renewed;\n  in the evening it fades and withers.\n7For we are brought to an end by your anger;\n by your wrath we are dismayed.\n8You have set our iniquities before you,\n our secret sins in the light of your presence.\n9For all our days pass away under your wrath;\n we bring our years to an end like a sigh.\n10The years of our life are seventy,\n  or even by reason of strength eighty;\nyet their span is but toil and trouble;\n  they are soon gone, and we fly away.\n11Who considers the power of your anger,\n  and your wrath according to the fear of you?\n12So teach us to number our days\n  that we may get a heart of wisdom.\n13Return, O LORD!    How long?\n  Have pity on your servants!\n14Satisfy us in the morning with your steadfast love,\n  that we may rejoice and be glad all our days.\n15Make us glad for as many days as you have\nafflicted us,\n  and for as many years as we have seen evil.\n16Let your work be shown to your servants,\n and your glorious power to their children.\n17Let the favor of the Lord our God be upon us,\n and establish the work of our hands upon us;\n yes, establish the work of our hands!\n"}, {"header": "         My Refuge and My Fortress\n", "verse": "Psalms 91", "text": "91:1 He who dwells in the shelter of the Most High\n will abide in the shadow of the Almighty.\n2I will say to the LORD, \"My refuge and my\nfortress,\n  my God, in whom I trust.\"\n3For he will deliver you from the snare of the fowler\n and from the deadly pestilence.\n4He will cover you with his pinions,\n  and under his wings you will find refuge;\n  his faithfulness is a shield and buckler.\n5You will not fear the terror of the night,\n  nor the arrow that flies by day,\n6nor the pestilence that stalks in darkness,\n  nor the destruction that wastes at noonday.\n7A thousand may fall at your side,\n  ten thousand at your right hand,\n  but it will not come near you.\n8You will only look with your eyes\n and see the recompense of the wicked.\n9Because you have made the LORD your dwelling\nplace-\n  the Most High, who is my refuge-\n10no evil shall be allowed to befall you,\n  no plague come near your tent.\n11For he will command his angels concerning you\n to guard you in all your ways.\n12On their hands they will bear you up,\n lest you strike your foot against a stone.\n13You will tread on the lion and the adder;\n  the young lion and the serpent you will trample\nunderfoot.\n14\"Because he holds fast to me in love, I will deliver\nhim;\n  I will protect him, because he knows my name.\n15When he calls to me, I will answer him;\n  I will be with him in trouble;\n  I will rescue him and honor him.\n16With long life I will satisfy him\nand show him my salvation.\"\n"}, {"header": "        How Great Are Your Works\n       A Psalm. A Song for the Sabbath.\n", "verse": "Psalms 92", "text": "92:1 It is good to give thanks to the LORD,\n to sing praises to your name, O Most High;\n2to declare your steadfast love in the morning,\n and your faithfulness by night,\n3to the music of the lute and the harp,\n to the melody of the lyre.\n4For you, O LORD, have made me glad by your\nwork;\n at the works of your hands I sing for joy.\n5How great are your works, O LORD!\n Your thoughts are very deep!\n6The stupid man cannot know;\n the fool cannot understand this:\n7that though the wicked sprout like grass\n  and all evildoers flourish,\nthey are doomed to destruction forever;\n  8but you, O LORD, are on high forever.\n9For behold, your enemies, O LORD,\n for behold, your enemies shall perish;\n all evildoers shall be scattered.\n10But you have exalted my horn like that of the wild\nox;\n  you have poured over me fresh oil.\n11My eyes have seen the downfall of my enemies;\n  my ears have heard the doom of my evil\nassailants.\n12The righteous flourish like the palm tree\n and grow like a cedar in Lebanon.\n13They are planted in the house of the LORD;\n they flourish in the courts of our God.\n14They still bear fruit in old age;\n they are ever full of sap and green,\n15to declare that the LORD is upright;\n  he is my rock, and there is no unrighteousness in\nhim.\n"}, {"header": "              The LORD Reigns\n", "verse": "Psalms 93-94", "text": "93:1 The LORD reigns; he is robed in majesty;\n  the LORD is robed; he has put on strength as his\nbelt.\nYes, the world is established; it shall never be\nmoved.\n2Your throne is established from of old;\n  you are from everlasting.\n3The floods have lifted up, O LORD,\n the floods have lifted up their voice;\n the floods lift up their roaring.\n4Mightier than the thunders of many waters,\n mightier than the waves of the sea,\n the LORD on high is mighty!\n5Your decrees are very trustworthy;\n holiness befits your house,\n O LORD, forevermore.\n The LORD Will Not Forsake His People\n94:1 O LORD, God of vengeance,\n O God of vengeance, shine forth!\n2Rise up, O judge of the earth;\n repay to the proud what they deserve!\n3O LORD, how long shall the wicked,\n how long shall the wicked exult?\n4They pour out their arrogant words;\n all the evildoers boast.\n5They crush your people, O LORD,\n and afflict your heritage.\n6They kill the widow and the sojourner,\n and murder the fatherless;\n7and they say, \"The LORD does not see;\n the God of Jacob does not perceive.\"\n8Understand, O dullest of the people!\n Fools, when will you be wise?\n9He who planted the ear, does he not hear?\nHe who formed the eye, does he not see?\n10He who disciplines the nations, does he not\nrebuke?\nHe who teaches man knowledge-\n  11the LORD-knows the thoughts of man,\n  that they are but a breath.\n12Blessed is the man whom you discipline, O LORD,\n and whom you teach out of your law,\n13to give him rest from days of trouble,\n until a pit is dug for the wicked.\n14For the LORD will not forsake his people;\n he will not abandon his heritage;\n15for justice will return to the righteous,\n and all the upright in heart will follow it.\n16Who rises up for me against the wicked?\n Who stands up for me against evildoers?\n17If the LORD had not been my help,\n  my soul would soon have lived in the land of\nsilence.\n18When I thought, \"My foot slips,\"\n  your steadfast love, O LORD, held me up.\n19When the cares of my heart are many,\n your consolations cheer my soul.\n20Can wicked rulers be allied with you,\n those who frame injustice by statute?\n21They band together against the life of the righteous\n  and condemn the innocent to death.\n22But the LORD has become my stronghold,\n and my God the rock of my refuge.\n23He will bring back on them their iniquity\n and wipe them out for their wickedness;\n the LORD our God will wipe them out.\n"}, {"header": "         Let Us Sing Songs of Praise\n", "verse": "Psalms 95-96", "text": "95:1 Oh come, let us sing to the LORD;\n  let us make a joyful noise to the rock of our\nsalvation!\n2Let us come into his presence with thanksgiving;\n  let us make a joyful noise to him with songs of\npraise!\n3For the LORD is a great God,\n  and a great King above all gods.\n4In his hand are the depths of the earth;\n  the heights of the mountains are his also.\n5The sea is his, for he made it,\n  and his hands formed the dry land.\n6Oh come, let us worship and bow down;\n let us kneel before the LORD, our Maker!\n7For he is our God,\n and we are the people of his pasture,\n and the sheep of his hand.\nToday, if you hear his voice,\n 8do not harden your hearts, as at Meribah,\n as on the day at Massah in the wilderness,\n9when your fathers put me to the test\n  and put me to the proof, though they had seen my\nwork.\n10For forty years I loathed that generation\n  and said, \"They are a people who go astray in their\nheart,\n  and they have not known my ways.\"\n11Therefore I swore in my wrath,\n  \"They shall not enter my rest.\"\n    Worship in the Splendor of Holiness\n96:1 Oh sing to the LORD a new song;\n sing to the LORD, all the earth!\n2Sing to the LORD, bless his name;\n tell of his salvation from day to day.\n3Declare his glory among the nations,\n his marvelous works among all the peoples!\n4For great is the LORD, and greatly to be praised;\n he is to be feared above all gods.\n5For all the gods of the peoples are worthless idols,\n but the LORD made the heavens.\n6Splendor and majesty are before him;\n strength and beauty are in his sanctuary.\n7Ascribe to the LORD, O families of the peoples,\n ascribe to the LORD glory and strength!\n8Ascribe to the LORD the glory due his name;\n bring an offering, and come into his courts!\n9Worship the LORD in the splendor of holiness;\n tremble before him, all the earth!\n10Say among the nations, \"The LORD reigns!\n Yes, the world is established; it shall never be\nmoved;\n he will judge the peoples with equity.\"\n11Let the heavens be glad, and let the earth rejoice;\n let the sea roar, and all that fills it;\n 12let the field exult, and everything in it!\nThen shall all the trees of the forest sing for joy\n 13before the LORD, for he comes,\n for he comes to judge the earth.\nHe will judge the world in righteousness,\n and the peoples in his faithfulness.\n"}, {"header": "               The LORD Reigns\n", "verse": "Psalms 97", "text": "97:1 The LORD reigns, let the earth rejoice;\n let the many coastlands be glad!\n2Clouds and thick darkness are all around him;\n  righteousness and justice are the foundation of his\nthrone.\n3Fire goes before him\n  and burns up his adversaries all around.\n4His lightnings light up the world;\n  the earth sees and trembles.\n5The mountains melt like wax before the LORD,\n  before the Lord of all the earth.\n6The heavens proclaim his righteousness,\n and all the peoples see his glory.\n7All worshipers of images are put to shame,\n who make their boast in worthless idols;\n worship him, all you gods!\n8Zion hears and is glad,\n and the daughters of Judah rejoice,\n because of your judgments, O LORD.\n9For you, O LORD, are most high over all the earth;\n you are exalted far above all gods.\n10O you who love the LORD, hate evil!\n  He preserves the lives of his saints;\n  he delivers them from the hand of the wicked.\n11Light is sown for the righteous,\n  and joy for the upright in heart.\n12Rejoice in the LORD, O you righteous,\n  and give thanks to his holy name!\n"}, {"header": "     Make a Joyful Noise to the LORD\n                A Psalm.\n", "verse": "Psalms 98", "text": "98:1 Oh sing to the LORD a new song,\n  for he has done marvelous things!\nHis right hand and his holy arm\n  have worked salvation for him.\n2The LORD has made known his salvation;\n  he has revealed his righteousness in the sight of\nthe nations.\n3He has remembered his steadfast love and\nfaithfulness\n  to the house of Israel.\nAll the ends of the earth have seen\n  the salvation of our God.\n4Make a joyful noise to the LORD, all the earth;\n break forth into joyous song and sing praises!\n5Sing praises to the LORD with the lyre,\n with the lyre and the sound of melody!\n6With trumpets and the sound of the horn\n make a joyful noise before the King, the LORD!\n7Let the sea roar, and all that fills it;\n  the world and those who dwell in it!\n8Let the rivers clap their hands;\n  let the hills sing for joy together\n9before the LORD, for he comes\n to judge the earth.\nHe will judge the world with righteousness,\n and the peoples with equity.\n"}, {"header": "        The LORD Our God Is Holy\n", "verse": "Psalms 99", "text": "99:1 The LORD reigns; let the peoples tremble!\n  He sits enthroned upon the cherubim; let the earth\nquake!\n2The LORD is great in Zion;\n  he is exalted over all the peoples.\n3Let them praise your great and awesome name!\n  Holy is he!\n4The King in his might loves justice.\n  You have established equity;\nyou have executed justice\n  and righteousness in Jacob.\n5Exalt the LORD our God;\n  worship at his footstool!\n  Holy is he!\n6Moses and Aaron were among his priests,\n  Samuel also was among those who called upon\nhis name.\n  They called to the LORD, and he answered them.\n7In the pillar of the cloud he spoke to them;\n they kept his testimonies\n and the statute that he gave them.\n8O LORD our God, you answered them;\n you were a forgiving God to them,\n but an avenger of their wrongdoings.\n9Exalt the LORD our God,\n and worship at his holy mountain;\n for the LORD our God is holy!\n"}, {"header": "   His Steadfast Love Endures Forever\n         A Psalm for giving thanks.\n", "verse": "Psalms 100", "text": "100:1 Make a joyful noise to the LORD, all the\nearth!\n 2Serve the LORD with gladness!\n Come into his presence with singing!\n3Know that the LORD, he is God!\n It is he who made us, and we are his;\n we are his people, and the sheep of his pasture.\n4Enter his gates with thanksgiving,\n and his courts with praise!\n Give thanks to him; bless his name!\n5For the LORD is good;\n his steadfast love endures forever,\n and his faithfulness to all generations.\n"}, {"header": "            I Will Walk with Integrity\n                A Psalm of David.\n", "verse": "Psalms 101", "text": "101:1 I will sing of steadfast love and justice;\n  to you, O LORD, I will make music.\n2I will ponder the way that is blameless.\n   Oh when will you come to me?\nI will walk with integrity of heart\n   within my house;\n3I will not set before my eyes\n   anything that is worthless.\nI hate the work of those who fall away;\n   it shall not cling to me.\n4A perverse heart shall be far from me;\n   I will know nothing of evil.\n5Whoever slanders his neighbor secretly\n I will destroy.\nWhoever has a haughty look and an arrogant heart\n I will not endure.\n6I will look with favor on the faithful in the land,\n that they may dwell with me;\nhe who walks in the way that is blameless\n shall minister to me.\n7No one who practices deceit\n shall dwell in my house;\nno one who utters lies\n shall continue before my eyes.\n8Morning by morning I will destroy\n  all the wicked in the land,\ncutting off all the evildoers\n  from the city of the LORD.\n"}, {"header": "     Do Not Hide Your Face from Me\n", "verse": "Psalms 102", "text": "  A Prayer of one afflicted, when he is faint\n   and pours out his complaint before the\n                   LORD.\n102:1 Hear my prayer, O LORD;\nlet my cry come to you!\n2Do not hide your face from me\n  in the day of my distress!\nIncline your ear to me;\n  answer me speedily in the day when I call!\n3For my days pass away like smoke,\n and my bones burn like a furnace.\n4My heart is struck down like grass and has\nwithered;\n  I forget to eat my bread.\n5Because of my loud groaning\n  my bones cling to my flesh.\n6I am like a desert owl of the wilderness,\n  like an owl of the waste places;\n7I lie awake;\n I am like a lonely sparrow on the housetop.\n8All the day my enemies taunt me;\n those who deride me use my name for a curse.\n9For I eat ashes like bread\n and mingle tears with my drink,\n10because of your indignation and anger;\n for you have taken me up and thrown me down.\n11My days are like an evening shadow;\n I wither away like grass.\n12But you, O LORD, are enthroned forever;\n you are remembered throughout all generations.\n13You will arise and have pity on Zion;\n  it is the time to favor her;\n  the appointed time has come.\n14For your servants hold her stones dear\n  and have pity on her dust.\n15Nations will fear the name of the LORD,\n  and all the kings of the earth will fear your glory.\n16For the LORD builds up Zion;\n  he appears in his glory;\n17he regards the prayer of the destitute\n and does not despise their prayer.\n18Let this be recorded for a generation to come,\n  so that a people yet to be created may praise the\nLORD:\n19that he looked down from his holy height;\n  from heaven the LORD looked at the earth,\n20to hear the groans of the prisoners,\n  to set free those who were doomed to die,\n21that they may declare in Zion the name of the\nLORD,\n  and in Jerusalem his praise,\n22when peoples gather together,\n  and kingdoms, to worship the LORD.\n23He has broken my strength in midcourse;\n he has shortened my days.\n24\"O my God,\" I say, \"take me not away\n  in the midst of my days-\nyou whose years endure\n  throughout all generations!\"\n25Of old you laid the foundation of the earth,\n and the heavens are the work of your hands.\n26They will perish, but you will remain;\n  they will all wear out like a garment.\nYou will change them like a robe, and they will pass\naway,\n  27but you are the same, and your years have no\nend.\n28The children of your servants shall dwell secure;\n  their offspring shall be established before you.\n"}, {"header": "        Bless the LORD, O My Soul\n                  Of David.\n", "verse": "Psalms 103-104", "text": "103:1 Bless the LORD, O my soul,\n and all that is within me,\n bless his holy name!\n2Bless the LORD, O my soul,\n and forget not all his benefits,\n3who forgives all your iniquity,\n who heals all your diseases,\n4who redeems your life from the pit,\n who crowns you with steadfast love and mercy,\n5who satisfies you with good\n so that your youth is renewed like the eagle's.\n6The LORD works righteousness\n and justice for all who are oppressed.\n7He made known his ways to Moses,\n his acts to the people of Israel.\n8The LORD is merciful and gracious,\n slow to anger and abounding in steadfast love.\n9He will not always chide,\n nor will he keep his anger forever.\n10He does not deal with us according to our sins,\n nor repay us according to our iniquities.\n11For as high as the heavens are above the earth,\n  so great is his steadfast love toward those who\nfear him;\n12as far as the east is from the west,\n  so far does he remove our transgressions from us.\n13As a father shows compassion to his children,\n  so the LORD shows compassion to those who fear\nhim.\n14For he knows our frame;\n  he remembers that we are dust.\n15As for man, his days are like grass;\n he flourishes like a flower of the field;\n16for the wind passes over it, and it is gone,\n and its place knows it no more.\n17But the steadfast love of the LORD is from\neverlasting to everlasting on those who fear him,\n and his righteousness to children's children,\n18to those who keep his covenant\n and remember to do his commandments.\n19The LORD has established his throne in the\nheavens,\n and his kingdom rules over all.\n20Bless the LORD, O you his angels,\n  you mighty ones who do his word,\n  obeying the voice of his word!\n21Bless the LORD, all his hosts,\n  his ministers, who do his will!\n22Bless the LORD, all his works,\n  in all places of his dominion.\nBless the LORD, O my soul!\n O LORD My God, You Are Very Great\n104:1 Bless the LORD, O my soul!\n  O LORD my God, you are very great!\nYou are clothed with splendor and majesty,\n  2covering yourself with light as with a garment,\n  stretching out the heavens like a tent.\n3He lays the beams of his chambers on the waters;\nhe makes the clouds his chariot;\n  he rides on the wings of the wind;\n4he makes his messengers winds,\n  his ministers a flaming fire.\n5He set the earth on its foundations,\n so that it should never be moved.\n6You covered it with the deep as with a garment;\n the waters stood above the mountains.\n7At your rebuke they fled;\n at the sound of your thunder they took to flight.\n8The mountains rose, the valleys sank down\n to the place that you appointed for them.\n9You set a boundary that they may not pass,\n so that they might not again cover the earth.\n10You make springs gush forth in the valleys;\n they flow between the hills;\n11they give drink to every beast of the field;\n the wild donkeys quench their thirst.\n12Beside them the birds of the heavens dwell;\n they sing among the branches.\n13From your lofty abode you water the mountains;\n the earth is satisfied with the fruit of your work.\n14You cause the grass to grow for the livestock\n  and plants for man to cultivate,\nthat he may bring forth food from the earth\n  15and wine to gladden the heart of man,\noil to make his face shine\n  and bread to strengthen man's heart.\n16The trees of the LORD are watered abundantly,\n the cedars of Lebanon that he planted.\n17In them the birds build their nests;\n the stork has her home in the fir trees.\n18The high mountains are for the wild goats;\n the rocks are a refuge for the rock badgers.\n19He made the moon to mark the seasons;\n the sun knows its time for setting.\n20You make darkness, and it is night,\n when all the beasts of the forest creep about.\n21The young lions roar for their prey,\n seeking their food from God.\n22When the sun rises, they steal away\n and lie down in their dens.\n23Man goes out to his work\n and to his labor until the evening.\n24O LORD, how manifold are your works!\n  In wisdom have you made them all;\n  the earth is full of your creatures.\n25Here is the sea, great and wide,\n  which teems with creatures innumerable,\n  living things both small and great.\n26There go the ships,\n  and Leviathan, which you formed to play in it.\n27These all look to you,\n to give them their food in due season.\n28When you give it to them, they gather it up;\n  when you open your hand, they are filled with good\nthings.\n29When you hide your face, they are dismayed;\n  when you take away their breath, they die\n  and return to their dust.\n30When you send forth your Spirit, they are\ncreated,\n  and you renew the face of the ground.\n31May the glory of the LORD endure forever;\n may the LORD rejoice in his works,\n32who looks on the earth and it trembles,\n who touches the mountains and they smoke!\n33I will sing to the LORD as long as I live;\n I will sing praise to my God while I have being.\n34May my meditation be pleasing to him,\n for I rejoice in the LORD.\n35Let sinners be consumed from the earth,\n and let the wicked be no more!\nBless the LORD, O my soul!\nPraise the LORD!\n"}, {"header": "      Tell of All His Wonderful Works\n", "verse": "Psalms 105-106", "text": "105:1 Oh give thanks to the LORD; call upon his\nname;\n make known his deeds among the peoples!\n2Sing to him, sing praises to him;\n tell of all his wondrous works!\n3Glory in his holy name;\n let the hearts of those who seek the LORD rejoice!\n4Seek the LORD and his strength;\n seek his presence continually!\n5Remember the wondrous works that he has done,\n his miracles, and the judgments he uttered,\n6O offspring of Abraham, his servant,\n children of Jacob, his chosen ones!\n7He is the LORD our God;\n his judgments are in all the earth.\n8He remembers his covenant forever,\n  the word that he commanded, for a thousand\ngenerations,\n9the covenant that he made with Abraham,\n his sworn promise to Isaac,\n10which he confirmed to Jacob as a statute,\n to Israel as an everlasting covenant,\n11saying, \"To you I will give the land of Canaan\n as your portion for an inheritance.\"\n12When they were few in number,\n of little account, and sojourners in it,\n13wandering from nation to nation,\n from one kingdom to another people,\n14he allowed no one to oppress them;\n he rebuked kings on their account,\n15saying, \"Touch not my anointed ones,\n do my prophets no harm!\"\n16When he summoned a famine on the land\n  and broke all supply of bread,\n17he had sent a man ahead of them,\n Joseph, who was sold as a slave.\n18His feet were hurt with fetters;\n his neck was put in a collar of iron;\n19until what he had said came to pass,\n the word of the LORD tested him.\n20The king sent and released him;\n the ruler of the peoples set him free;\n21he made him lord of his house\n and ruler of all his possessions,\n22to bind his princes at his pleasure\n and to teach his elders wisdom.\n23Then Israel came to Egypt;\n Jacob sojourned in the land of Ham.\n24And the LORD made his people very fruitful\n and made them stronger than their foes.\n25He turned their hearts to hate his people,\n to deal craftily with his servants.\n26He sent Moses, his servant,\n and Aaron, whom he had chosen.\n27They performed his signs among them\n and miracles in the land of Ham.\n28He sent darkness, and made the land dark;\n  they did not rebel against his words.\n29He turned their waters into blood\n and caused their fish to die.\n30Their land swarmed with frogs,\n even in the chambers of their kings.\n31He spoke, and there came swarms of flies,\n and gnats throughout their country.\n32He gave them hail for rain,\n and fiery lightning bolts through their land.\n33He struck down their vines and fig trees,\n and shattered the trees of their country.\n34He spoke, and the locusts came,\n young locusts without number,\n35which devoured all the vegetation in their land\n and ate up the fruit of their ground.\n36He struck down all the firstborn in their land,\n the firstfruits of all their strength.\n37Then he brought out Israel with silver and gold,\n  and there was none among his tribes who\nstumbled.\n38Egypt was glad when they departed,\n  for dread of them had fallen upon it.\n39He spread a cloud for a covering,\n and fire to give light by night.\n40They asked, and he brought quail,\n and gave them bread from heaven in abundance.\n41He opened the rock, and water gushed out;\n it flowed through the desert like a river.\n42For he remembered his holy promise,\n and Abraham, his servant.\n43So he brought his people out with joy,\n his chosen ones with singing.\n44And he gave them the lands of the nations,\n  and they took possession of the fruit of the\npeoples' toil,\n45that they might keep his statutes\n  and observe his laws.\nPraise the LORD!\n   Give Thanks to the LORD, for He Is Good\n106:1 Praise the LORD!\nOh give thanks to the LORD, for he is good,\n for his steadfast love endures forever!\n2Who can utter the mighty deeds of the LORD,\n or declare all his praise?\n3Blessed are they who observe justice,\n who do righteousness at all times!\n4Remember me, O LORD, when you show favor to\nyour people;\n  help me when you save them,\n5that I may look upon the prosperity of your chosen\nones,\n  that I may rejoice in the gladness of your nation,\n  that I may glory with your inheritance.\n6Both we and our fathers have sinned;\n we have committed iniquity; we have done\nwickedness.\n7Our fathers, when they were in Egypt,\n  did not consider your wondrous works;\nthey did not remember the abundance of your\nsteadfast love,\n  but rebelled by the sea, at the Red Sea.\n8Yet he saved them for his name's sake,\n  that he might make known his mighty power.\n9He rebuked the Red Sea, and it became dry,\n  and he led them through the deep as through a\ndesert.\n10So he saved them from the hand of the foe\n  and redeemed them from the power of the enemy.\n11And the waters covered their adversaries;\n  not one of them was left.\n12Then they believed his words;\n  they sang his praise.\n13But they soon forgot his works;\n they did not wait for his counsel.\n14But they had a wanton craving in the wilderness,\n and put God to the test in the desert;\n15he gave them what they asked,\n but sent a wasting disease among them.\n16When men in the camp were jealous of Moses\n and Aaron, the holy one of the LORD,\n17the earth opened and swallowed up Dathan,\n and covered the company of Abiram.\n18Fire also broke out in their company;\n the flame burned up the wicked.\n19They made a calf in Horeb\n and worshiped a metal image.\n20They exchanged the glory of God\n for the image of an ox that eats grass.\n21They forgot God, their Savior,\n who had done great things in Egypt,\n22wondrous works in the land of Ham,\n and awesome deeds by the Red Sea.\n23Therefore he said he would destroy them-\n  had not Moses, his chosen one,\nstood in the breach before him,\n  to turn away his wrath from destroying them.\n24Then they despised the pleasant land,\n having no faith in his promise.\n25They murmured in their tents,\n and did not obey the voice of the LORD.\n26Therefore he raised his hand and swore to them\n that he would make them fall in the wilderness,\n27and would make their offspring fall among the\nnations,\n scattering them among the lands.\n28Then they yoked themselves to the Baal of Peor,\n and ate sacrifices offered to the dead;\n29they provoked the LORD to anger with their deeds,\n and a plague broke out among them.\n30Then Phinehas stood up and intervened,\n and the plague was stayed.\n31And that was counted to him as righteousness\n from generation to generation forever.\n32They angered him at the waters of Meribah,\n and it went ill with Moses on their account,\n33for they made his spirit bitter,\n and he spoke rashly with his lips.\n34They did not destroy the peoples,\n as the LORD commanded them,\n35but they mixed with the nations\n and learned to do as they did.\n36They served their idols,\n which became a snare to them.\n37They sacrificed their sons\n and their daughters to the demons;\n38they poured out innocent blood,\n  the blood of their sons and daughters,\nwhom they sacrificed to the idols of Canaan,\n  and the land was polluted with blood.\n39Thus they became unclean by their acts,\n  and played the whore in their deeds.\n40Then the anger of the LORD was kindled against\nhis people,\n  and he abhorred his heritage;\n41he gave them into the hand of the nations,\n  so that those who hated them ruled over them.\n42Their enemies oppressed them,\n  and they were brought into subjection under their\npower.\n43Many times he delivered them,\n  but they were rebellious in their purposes\n  and were brought low through their iniquity.\n44Nevertheless, he looked upon their distress,\n when he heard their cry.\n45For their sake he remembered his covenant,\n  and relented according to the abundance of his\nsteadfast love.\n46He caused them to be pitied\n  by all those who held them captive.\n47Save us, O LORD our God,\n  and gather us from among the nations,\nthat we may give thanks to your holy name\n  and glory in your praise.\n48Blessed be the LORD, the God of Israel,\n from everlasting to everlasting!\nAnd let all the people say, \"Amen!\"\n Praise the LORD!\n"}, {"header": "   Let the Redeemed of the LORD Say So\n", "verse": "Psalms 107", "text": "107:1 Oh give thanks to the LORD, for he is good,\n for his steadfast love endures forever!\n2Let the redeemed of the LORD say so,\n  whom he has redeemed from trouble\n3and gathered in from the lands,\n from the east and from the west,\n from the north and from the south.\n4Some wandered in desert wastes,\n finding no way to a city to dwell in;\n5hungry and thirsty,\n their soul fainted within them.\n6Then they cried to the LORD in their trouble,\n and he delivered them from their distress.\n7He led them by a straight way\n till they reached a city to dwell in.\n8Let them thank the LORD for his steadfast love,\n for his wondrous works to the children of man!\n9For he satisfies the longing soul,\n and the hungry soul he fills with good things.\n10Some sat in darkness and in the shadow of death,\n prisoners in affliction and in irons,\n11for they had rebelled against the words of God,\n and spurned the counsel of the Most High.\n12So he bowed their hearts down with hard labor;\n they fell down, with none to help.\n13Then they cried to the LORD in their trouble,\n and he delivered them from their distress.\n14He brought them out of darkness and the shadow\nof death,\n  and burst their bonds apart.\n15Let them thank the LORD for his steadfast love,\n  for his wondrous works to the children of man!\n16For he shatters the doors of bronze\n  and cuts in two the bars of iron.\n17Some were fools through their sinful ways,\n and because of their iniquities suffered affliction;\n18they loathed any kind of food,\n and they drew near to the gates of death.\n19Then they cried to the LORD in their trouble,\n and he delivered them from their distress.\n20He sent out his word and healed them,\n and delivered them from their destruction.\n21Let them thank the LORD for his steadfast love,\n for his wondrous works to the children of man!\n22And let them offer sacrifices of thanksgiving,\n and tell of his deeds in songs of joy!\n23Some went down to the sea in ships,\n doing business on the great waters;\n24they saw the deeds of the LORD,\n his wondrous works in the deep.\n25For he commanded and raised the stormy wind,\n which lifted up the waves of the sea.\n26They mounted up to heaven; they went down to the\ndepths;\n  their courage melted away in their evil plight;\n27they reeled and staggered like drunken men\n  and were at their wits' end.\n28Then they cried to the LORD in their trouble,\n  and he delivered them from their distress.\n29He made the storm be still,\n  and the waves of the sea were hushed.\n30Then they were glad that the waters were\nquiet,\n  and he brought them to their desired haven.\n31Let them thank the LORD for his steadfast love,\n  for his wondrous works to the children of man!\n32Let them extol him in the congregation of the\npeople,\n  and praise him in the assembly of the elders.\n33He turns rivers into a desert,\n springs of water into thirsty ground,\n34a fruitful land into a salty waste,\n because of the evil of its inhabitants.\n35He turns a desert into pools of water,\n a parched land into springs of water.\n36And there he lets the hungry dwell,\n and they establish a city to live in;\n37they sow fields and plant vineyards\n and get a fruitful yield.\n38By his blessing they multiply greatly,\n and he does not let their livestock diminish.\n39When they are diminished and brought low\n through oppression, evil, and sorrow,\n40he pours contempt on princes\n and makes them wander in trackless wastes;\n41but he raises up the needy out of affliction\n and makes their families like flocks.\n42The upright see it and are glad,\n and all wickedness shuts its mouth.\n43Whoever is wise, let him attend to these things;\n let them consider the steadfast love of the LORD.\n"}, {"header": "      With God We Shall Do Valiantly\n         A Song. A Psalm of David.\n", "verse": "Psalms 108", "text": "108:1 My heart is steadfast, O God!\n I will sing and make melody with all my being! \n2Awake, O harp and lyre!\n I will awake the dawn!\n3I will give thanks to you, O LORD, among the\npeoples;\n  I will sing praises to you among the nations.\n4For your steadfast love is great above the heavens;\n  your faithfulness reaches to the clouds.\n5Be exalted, O God, above the heavens!\n Let your glory be over all the earth!\n6That your beloved ones may be delivered,\n give salvation by your right hand and answer me!\n7God has promised in his holiness:\n \"With exultation I will divide up Shechem\n and portion out the Valley of Succoth.\n8Gilead is mine; Manasseh is mine;\n Ephraim is my helmet,\n Judah my scepter.\n9Moab is my washbasin;\n upon Edom I cast my shoe;\n over Philistia I shout in triumph.\"\n10Who will bring me to the fortified city?\n Who will lead me to Edom?\n11Have you not rejected us, O God?\n You do not go out, O God, with our armies.\n12Oh grant us help against the foe,\n for vain is the salvation of man!\n13With God we shall do valiantly;\n it is he who will tread down our foes.\n"}, {"header": "        Help Me, O LORD My God\n    To the choirmaster. A Psalm of David.\n", "verse": "Psalms 109", "text": "109:1 Be not silent, O God of my praise!\n2For wicked and deceitful mouths are opened\nagainst me,\n  speaking against me with lying tongues.\n3They encircle me with words of hate,\n  and attack me without cause.\n4In return for my love they accuse me,\n  but I give myself to prayer.\n5So they reward me evil for good,\n  and hatred for my love.\n6Appoint a wicked man against him;\n let an accuser stand at his right hand.\n7When he is tried, let him come forth guilty;\n let his prayer be counted as sin!\n8May his days be few;\n may another take his office!\n9May his children be fatherless\n and his wife a widow!\n10May his children wander about and beg,\n seeking food far from the ruins they inhabit!\n11May the creditor seize all that he has;\n may strangers plunder the fruits of his toil!\n12Let there be none to extend kindness to him,\n nor any to pity his fatherless children!\n13May his posterity be cut off;\n  may his name be blotted out in the second\ngeneration!\n14May the iniquity of his fathers be remembered\nbefore the LORD,\n  and let not the sin of his mother be blotted out!\n15Let them be before the LORD continually,\n  that he may cut off the memory of them from the\nearth!\n16For he did not remember to show kindness,\n  but pursued the poor and needy\n  and the brokenhearted, to put them to death.\n17He loved to curse; let curses come upon him!\n  He did not delight in blessing; may it be far\nfrom him!\n18He clothed himself with cursing as his coat;\n  may it soak into his body like water,\n  like oil into his bones!\n19May it be like a garment that he wraps around him,\n  like a belt that he puts on every day!\n20May this be the reward of my accusers from the\nLORD,\n  of those who speak evil against my life!\n21But you, O GOD my Lord,\n  deal on my behalf for your name's sake;\n  because your steadfast love is good, deliver me!\n22For I am poor and needy,\n  and my heart is stricken within me.\n23I am gone like a shadow at evening;\n  I am shaken off like a locust.\n24My knees are weak through fasting;\n  my body has become gaunt, with no fat.\n25I am an object of scorn to my accusers;\n  when they see me, they wag their heads.\n26Help me, O LORD my God!\n Save me according to your steadfast love!\n27Let them know that this is your hand;\n you, O LORD, have done it!\n28Let them curse, but you will bless!\n  They arise and are put to shame, but your servant\nwill be glad!\n29May my accusers be clothed with dishonor;\n  may they be wrapped in their own shame as in a\ncloak!\n30With my mouth I will give great thanks to the\nLORD;\n  I will praise him in the midst of the throng.\n31For he stands at the right hand of the needy one,\n  to save him from those who condemn his soul to\ndeath.\n"}, {"header": "              Sit at My Right Hand\n                A Psalm of David.\n", "verse": "Psalms 110", "text": "110:1 The LORD says to my Lord:\n  \"Sit at my right hand,\nuntil I make your enemies your footstool.\"\n2The LORD sends forth from Zion\n  your mighty scepter.\n  Rule in the midst of your enemies!\n3Your people will offer themselves freely\n  on the day of your power,\n  in holy garments;\nfrom the womb of the morning,\n  the dew of your youth will be yours.\n4The LORD has sworn\n  and will not change his mind,\n\"You are a priest forever\n  after the order of Melchizedek.\"\n5The Lord is at your right hand;\n he will shatter kings on the day of his wrath.\n6He will execute judgment among the nations,\n filling them with corpses;\nhe will shatter chiefs\n over the wide earth.\n7He will drink from the brook by the way;\n therefore he will lift up his head.\n"}, {"header": "       Great Are the LORD's Works\n", "verse": "Psalms 111", "text": "111:1  Praise the LORD!\nI will give thanks to the LORD with my whole heart,\n  in the company of the upright, in the congregation.\n2Great are the works of the LORD,\n  studied by all who delight in them.\n3Full of splendor and majesty is his work,\n  and his righteousness endures forever.\n4He has caused his wondrous works to be\nremembered;\n  the LORD is gracious and merciful.\n5He provides food for those who fear him;\n  he remembers his covenant forever.\n6He has shown his people the power of his works,\n  in giving them the inheritance of the nations.\n7The works of his hands are faithful and just;\n  all his precepts are trustworthy;\n8they are established forever and ever,\n  to be performed with faithfulness and uprightness.\n9He sent redemption to his people;\n  he has commanded his covenant forever.\n Holy and awesome is his name!\n10The fear of the LORD is the beginning of wisdom;\n  all those who practice it have a good\nunderstanding.\n  His praise endures forever!\n"}, {"header": "   The Righteous Will Never Be Moved\n", "verse": "Psalms 112", "text": "112:1  Praise the LORD!\nBlessed is the man who fears the LORD,\n  who greatly delights in his commandments!\n2His offspring will be mighty in the land;\n  the generation of the upright will be blessed.\n3Wealth and riches are in his house,\n  and his righteousness endures forever.\n4Light dawns in the darkness for the upright;\n  he is gracious, merciful, and righteous.\n5It is well with the man who deals generously and\nlends;\n  who conducts his affairs with justice.\n6For the righteous will never be moved;\n  he will be remembered forever.\n7He is not afraid of bad news;\n  his heart is firm, trusting in the LORD.\n8His heart is steady; he will not be afraid,\n  until he looks in triumph on his adversaries.\n9He has distributed freely; he has given to the poor;\n  his righteousness endures forever;\n his horn is exalted in honor.\n10The wicked man sees it and is angry;\n he gnashes his teeth and melts away;\n the desire of the wicked will perish!\n"}, {"header": "      Who Is like the LORD Our God?\n", "verse": "Psalms 113", "text": "113:1 Praise the LORD!\nPraise, O servants of the LORD,\n praise the name of the LORD!\n2Blessed be the name of the LORD\n from this time forth and forevermore!\n3From the rising of the sun to its setting,\n the name of the LORD is to be praised!\n4The LORD is high above all nations,\n and his glory above the heavens!\n5Who is like the LORD our God,\n who is seated on high,\n6who looks far down\n on the heavens and the earth?\n7He raises the poor from the dust\n and lifts the needy from the ash heap,\n8to make them sit with princes,\n with the princes of his people.\n9He gives the barren woman a home,\n making her the joyous mother of children.\nPraise the LORD!\n"}, {"header": "    Tremble at the Presence of the Lord\n", "verse": "Psalms 114", "text": "114:1 When Israel went out from Egypt,\n  the house of Jacob from a people of strange\nlanguage,\n2Judah became his sanctuary,\n  Israel his dominion.\n3The sea looked and fled;\n Jordan turned back.\n4The mountains skipped like rams,\n the hills like lambs.\n5What ails you, O sea, that you flee?\n O Jordan, that you turn back?\n6O mountains, that you skip like rams?\n O hills, like lambs?\n7Tremble, O earth, at the presence of the Lord,\n at the presence of the God of Jacob,\n8who turns the rock into a pool of water,\n the flint into a spring of water.\n"}, {"header": "          To Your Name Give Glory\n", "verse": "Psalms 115", "text": "115:1 Not to us, O LORD, not to us, but to your\nname give glory,\n  for the sake of your steadfast love and your\nfaithfulness!\n2Why should the nations say,\n \"Where is their God?\"\n3Our God is in the heavens;\n he does all that he pleases.\n4Their idols are silver and gold,\n the work of human hands.\n5They have mouths, but do not speak;\n eyes, but do not see.\n6They have ears, but do not hear;\n noses, but do not smell.\n7They have hands, but do not feel;\n  feet, but do not walk;\n  and they do not make a sound in their throat.\n8Those who make them become like them;\n so do all who trust in them.\n9O Israel, trust in the LORD!\n He is their help and their shield.\n10O house of Aaron, trust in the LORD!\n He is their help and their shield.\n11You who fear the LORD, trust in the LORD!\n He is their help and their shield.\n12The LORD has remembered us; he will bless us;\n  he will bless the house of Israel;\n  he will bless the house of Aaron;\n13he will bless those who fear the LORD,\n  both the small and the great.\n14May the LORD give you increase,\n you and your children!\n15May you be blessed by the LORD,\n who made heaven and earth!\n16The heavens are the LORD's heavens,\n but the earth he has given to the children of man.\n17The dead do not praise the LORD,\n nor do any who go down into silence.\n18But we will bless the LORD\n from this time forth and forevermore.\nPraise the LORD!\n"}, {"header": "                I Love the LORD\n", "verse": "Psalms 116-117", "text": "116:1 I love the LORD, because he has heard\n my voice and my pleas for mercy.\n2Because he inclined his ear to me,\n therefore I will call on him as long as I live.\n3The snares of death encompassed me;\n  the pangs of Sheol laid hold on me;\n  I suffered distress and anguish.\n4Then I called on the name of the LORD:\n  \"O LORD, I pray, deliver my soul!\"\n5Gracious is the LORD, and righteous;\n our God is merciful.\n6The LORD preserves the simple;\n when I was brought low, he saved me.\n7Return, O my soul, to your rest;\n for the LORD has dealt bountifully with you.\n8For you have delivered my soul from death,\n my eyes from tears,\n my feet from stumbling;\n9I will walk before the LORD\n  in the land of the living.\n10I believed, even when I spoke,\n  \"I am greatly afflicted\";\n11I said in my alarm,\n  \"All mankind are liars.\"\n12What shall I render to the LORD\n  for all his benefits to me?\n13I will lift up the cup of salvation\n  and call on the name of the LORD,\n14I will pay my vows to the LORD\n  in the presence of all his people.\n15Precious in the sight of the LORD\n  is the death of his saints.\n16O LORD, I am your servant;\n  I am your servant, the son of your maidservant.\n  You have loosed my bonds.\n17I will offer to you the sacrifice of thanksgiving\n  and call on the name of the LORD.\n18I will pay my vows to the LORD\n in the presence of all his people,\n19in the courts of the house of the LORD,\n in your midst, O Jerusalem.\nPraise the LORD!\nThe LORD's Faithfulness Endures Forever\n117:1 Praise the LORD, all nations!\n Extol him, all peoples!\n2For great is his steadfast love toward us,\n and the faithfulness of the LORD endures forever.\nPraise the LORD!\n"}, {"header": "    His Steadfast Love Endures Forever\n", "verse": "Psalms 118", "text": "118:1 Oh give thanks to the LORD, for he is good;\n for his steadfast love endures forever!\n2Let Israel say,\n \"His steadfast love endures forever.\"\n3Let the house of Aaron say,\n \"His steadfast love endures forever.\"\n4Let those who fear the LORD say,\n \"His steadfast love endures forever.\"\n5Out of my distress I called on the LORD;\n the LORD answered me and set me free.\n6The LORD is on my side; I will not fear.\n What can man do to me?\n7The LORD is on my side as my helper;\n I shall look in triumph on those who hate me.\n8It is better to take refuge in the LORD\n than to trust in man.\n9It is better to take refuge in the LORD\n  than to trust in princes.\n10All nations surrounded me;\n  in the name of the LORD I cut them off!\n11They surrounded me, surrounded me on every\nside;\n  in the name of the LORD I cut them off!\n12They surrounded me like bees;\n  they went out like a fire among thorns;\n  in the name of the LORD I cut them off!\n13I was pushed hard, so that I was falling,\n  but the LORD helped me.\n14The LORD is my strength and my song;\n  he has become my salvation.\n15Glad songs of salvation\n  are in the tents of the righteous:\n\"The right hand of the LORD does valiantly,\n  16the right hand of the LORD exalts,\n  the right hand of the LORD does valiantly!\"\n17I shall not die, but I shall live,\n  and recount the deeds of the LORD.\n18The LORD has disciplined me severely,\n but he has not given me over to death.\n19Open to me the gates of righteousness,\n  that I may enter through them\n  and give thanks to the LORD.\n20This is the gate of the LORD;\n  the righteous shall enter through it.\n21I thank you that you have answered me\n  and have become my salvation.\n22The stone that the builders rejected\n  has become the cornerstone.\n23This is the LORD's doing;\n  it is marvelous in our eyes.\n24This is the day that the LORD has made;\n  let us rejoice and be glad in it.\n25Save us, we pray, O LORD!\n O LORD, we pray, give us success!\n26Blessed is he who comes in the name of the\nLORD!\n We bless you from the house of the LORD.\n27The LORD is God,\n and he has made his light to shine upon us.\nBind the festal sacrifice with cords,\n up to the horns of the altar!\n28You are my God, and I will give thanks to you;\n you are my God; I will extol you.\n29Oh give thanks to the LORD, for he is good;\n for his steadfast love endures forever!\n"}, {"header": "     Your Word Is a Lamp to My Feet\n", "verse": "Psalms 119:1-8", "text": "                  Aleph\n119:1  Blessed are those whose way is\nblameless,\n  who walk in the law of the LORD!\n2Blessed are those who keep his testimonies,\n  who seek him with their whole heart,\n3who also do no wrong,\n  but walk in his ways!\n4You have commanded your precepts\n  to be kept diligently.\n5Oh that my ways may be steadfast\n  in keeping your statutes!\n6Then I shall not be put to shame,\n  having my eyes fixed on all your commandments.\n7I will praise you with an upright heart,\n  when I learn your righteous rules.\n8I will keep your statutes;\n  do not utterly forsake me!\n"}, {"header": "", "verse": "Psalms 119:9-16", "text": "                           Beth\n9How can a young man keep his way pure?\n  By guarding it according to your word.\n10With my whole heart I seek you;\n  let me not wander from your commandments!\n11I have stored up your word in my heart,\n  that I might not sin against you.\n12Blessed are you, O LORD;\n  teach me your statutes!\n13With my lips I declare\n  all the rules of your mouth.\n14In the way of your testimonies I delight\n  as much as in all riches.\n15I will meditate on your precepts\n  and fix my eyes on your ways.\n16I will delight in your statutes;\n  I will not forget your word.\n\n"}, {"header": "", "verse": "Psalms 119:17-24", "text": "                          Gimel\n17Deal bountifully with your servant,\n that I may live and keep your word.\n18Open my eyes, that I may behold\n wondrous things out of your law.\n19I am a sojourner on the earth;\n hide not your commandments from me!\n20My soul is consumed with longing\n  for your rules at all times.\n21You rebuke the insolent, accursed ones,\n who wander from your commandments.\n22Take away from me scorn and contempt,\n for I have kept your testimonies.\n23Even though princes sit plotting against me,\n your servant will meditate on your statutes.\n24Your testimonies are my delight;\n they are my counselors.\n\n"}, {"header": "", "verse": "Psalms 119:25-32", "text": "                       Daleth\n25My soul clings to the dust;\n give me life according to your word!\n26When I told of my ways, you answered me;\n teach me your statutes!\n27Make me understand the way of your precepts,\n and I will meditate on your wondrous works.\n28My soul melts away for sorrow;\n strengthen me according to your word!\n29Put false ways far from me\n and graciously teach me your law!\n30I have chosen the way of faithfulness;\n I set your rules before me.\n31I cling to your testimonies, O LORD;\n let me not be put to shame!\n32I will run in the way of your commandments\n  when you enlarge my heart! \n\n"}, {"header": "", "verse": "Psalms 119:33-40", "text": "                         He\n33Teach me, O LORD, the way of your statutes;\n  and I will keep it to the end.\n34Give me understanding, that I may keep your law\n and observe it with my whole heart.\n35Lead me in the path of your commandments,\n for I delight in it.\n36Incline my heart to your testimonies,\n and not to selfish gain!\n37Turn my eyes from looking at worthless things;\n and give me life in your ways.\n38Confirm to your servant your promise,\n that you may be feared.\n39Turn away the reproach that I dread,\n for your rules are good.\n40Behold, I long for your precepts;\n in your righteousness give me life!\n\n"}, {"header": "", "verse": "Psalms 119:41-48", "text": "                         Waw\n41Let your steadfast love come to me, O LORD,\n your salvation according to your promise;\n42then shall I have an answer for him who taunts me,\n for I trust in your word.\n43And take not the word of truth utterly out of my\nmouth,\n  for my hope is in your rules.\n44I will keep your law continually,\n  forever and ever,\n45and I shall walk in a wide place,\n for I have sought your precepts.\n46I will also speak of your testimonies before kings\n and shall not be put to shame,\n47for I find my delight in your commandments,\n which I love.\n48I will lift up my hands toward your commandments,\nwhich I love,\n and I will meditate on your statutes.\n\n"}, {"header": "", "verse": "Psalms 119:49-56", "text": "                        Zayin\n49Remember your word to your servant,\n in which you have made me hope.\n50This is my comfort in my affliction,\n that your promise gives me life.\n51The insolent utterly deride me,\n but I do not turn away from your law.\n52When I think of your rules from of old,\n I take comfort, O LORD.\n53Hot indignation seizes me because of the wicked,\n who forsake your law.\n54Your statutes have been my songs\n in the house of my sojourning.\n55I remember your name in the night, O LORD,\n and keep your law.\n56This blessing has fallen to me,\n that I have kept your precepts.\n\n"}, {"header": "", "verse": "Psalms 119:57-64", "text": "                         Heth\n57The LORD is my portion;\n I promise to keep your words.\n58I entreat your favor with all my heart;\n be gracious to me according to your promise.\n59When I think on my ways,\n I turn my feet to your testimonies;\n60I hasten and do not delay\n to keep your commandments.\n61Though the cords of the wicked ensnare me,\n I do not forget your law.\n62At midnight I rise to praise you,\n because of your righteous rules.\n63I am a companion of all who fear you,\n of those who keep your precepts.\n64The earth, O LORD, is full of your steadfast love;\n teach me your statutes!\n\n"}, {"header": "", "verse": "Psalms 119:65-72", "text": "                          Teth\n65You have dealt well with your servant,\n O LORD, according to your word.\n66Teach me good judgment and knowledge,\n for I believe in your commandments.\n67Before I was afflicted I went astray,\n but now I keep your word.\n68You are good and do good;\n teach me your statutes.\n69The insolent smear me with lies,\n but with my whole heart I keep your precepts;\n70their heart is unfeeling like fat,\n but I delight in your law.\n71It is good for me that I was afflicted,\n that I might learn your statutes.\n72The law of your mouth is better to me\n than thousands of gold and silver pieces.\n"}, {"header": "", "verse": "Psalms 119:73-80", "text": "                       Yodh\n73Your hands have made and fashioned me;\n  give me understanding that I may learn your\ncommandments.\n74Those who fear you shall see me and rejoice,\n  because I have hoped in your word.\n75I know, O LORD, that your rules are righteous,\n  and that in faithfulness you have afflicted me.\n76Let your steadfast love comfort me\n  according to your promise to your servant.\n77Let your mercy come to me, that I may live;\n  for your law is my delight.\n78Let the insolent be put to shame,\n  because they have wronged me with falsehood;\n  as for me, I will meditate on your precepts.\n79Let those who fear you turn to me,\n  that they may know your testimonies.\n80May my heart be blameless in your statutes,\n  that I may not be put to shame!\n\n"}, {"header": "", "verse": "Psalms 119:81-88", "text": "                       Kaph\n81My soul longs for your salvation;\n I hope in your word.\n82My eyes long for your promise;\n I ask, \"When will you comfort me?\"\n83For I have become like a wineskin in the smoke,\n yet I have not forgotten your statutes.\n84How long must your servant endure?\n When will you judge those who persecute me?\n85The insolent have dug pitfalls for me;\n they do not live according to your law.\n86All your commandments are sure;\n they persecute me with falsehood; help me!\n87They have almost made an end of me on earth,\n but I have not forsaken your precepts.\n88In your steadfast love give me life,\n that I may keep the testimonies of your mouth.\n\n"}, {"header": "", "verse": "Psalms 119:89-96", "text": "                        Lamedh\n89Forever, O LORD, your word\n is firmly fixed in the heavens.\n90Your faithfulness endures to all generations;\n you have established the earth, and it stands fast.\n91By your appointment they stand this day,\n for all things are your servants.\n92If your law had not been my delight,\n I would have perished in my affliction.\n93I will never forget your precepts,\n for by them you have given me life.\n94I am yours; save me,\n for I have sought your precepts.\n95The wicked lie in wait to destroy me,\n but I consider your testimonies.\n96I have seen a limit to all perfection,\n but your commandment is exceedingly broad.\n\n"}, {"header": "", "verse": "Psalms 119:97-104", "text": "                         Mem\n97Oh how I love your law!\n It is my meditation all the day.\n98Your commandment makes me wiser than my\nenemies,\n  for it is ever with me.\n99I have more understanding than all my teachers,\n for your testimonies are my meditation.\n100I understand more than the aged,\n for I keep your precepts.\n101I hold back my feet from every evil way,\n in order to keep your word.\n102I do not turn aside from your rules,\n for you have taught me.\n103How sweet are your words to my taste,\n sweeter than honey to my mouth!\n104Through your precepts I get understanding;\n therefore I hate every false way.\n\n"}, {"header": "", "verse": "Psalms 119:105-112", "text": "                           Nun\n105Your word is a lamp to my feet\n and a light to my path.\n106I have sworn an oath and confirmed it,\n to keep your righteous rules.\n107I am severely afflicted;\n give me life, O LORD, according to your word!\n108Accept my freewill offerings of praise, O LORD,\n and teach me your rules.\n109I hold my life in my hand continually,\n but I do not forget your law.\n110The wicked have laid a snare for me,\n but I do not stray from your precepts.\n111Your testimonies are my heritage forever,\n for they are the joy of my heart.\n112I incline my heart to perform your statutes\n  forever, to the end.\n\n"}, {"header": "", "verse": "Psalms 119:113-120", "text": "                        Samekh\n113I hate the double-minded,\n but I love your law.\n114You are my hiding place and my shield;\n I hope in your word.\n115Depart from me, you evildoers,\n that I may keep the commandments of my God.\n116Uphold me according to your promise, that I may\nlive,\n   and let me not be put to shame in my hope!\n117Hold me up, that I may be safe\n   and have regard for your statutes continually!\n118You spurn all who go astray from your statutes,\n for their cunning is in vain.\n119All the wicked of the earth you discard like dross,\n therefore I love your testimonies.\n120My flesh trembles for fear of you,\n and I am afraid of your judgments.\n\n"}, {"header": "", "verse": "Psalms 119:121-128", "text": "                         Ayin\n121I have done what is just and right;\n do not leave me to my oppressors.\n122Give your servant a pledge of good;\n let not the insolent oppress me.\n123My eyes long for your salvation\n and for the fulfillment of your righteous promise.\n124Deal with your servant according to your\nsteadfast love,\n  and teach me your statutes.\n125I am your servant; give me understanding,\n  that I may know your testimonies!\n126It is time for the LORD to act,\n  for your law has been broken.\n127Therefore I love your commandments\n above gold, above fine gold.\n128Therefore I consider all your precepts to be right;\n I hate every false way.\n\n"}, {"header": "", "verse": "Psalms 119:129-136", "text": "                           Pe\n129Your testimonies are wonderful;\n therefore my soul keeps them.\n130The unfolding of your words gives light;\n it imparts understanding to the simple.\n131I open my mouth and pant,\n because I long for your commandments.\n132Turn to me and be gracious to me,\n as is your way with those who love your name.\n133Keep steady my steps according to your\npromise,\n  and let no iniquity get dominion over me.\n134Redeem me from man's oppression,\n  that I may keep your precepts.\n135Make your face shine upon your servant,\n  and teach me your statutes.\n136My eyes shed streams of tears,\n because people do not keep your law.\n\n"}, {"header": "", "verse": "Psalms 119:137-144", "text": "                      Tsadhe\n137Righteous are you, O LORD,\n and right are your rules.\n138You have appointed your testimonies in\nrighteousness\n  and in all faithfulness.\n139My zeal consumes me,\n  because my foes forget your words.\n140Your promise is well tried,\n  and your servant loves it.\n141I am small and despised,\n  yet I do not forget your precepts.\n142Your righteousness is righteous forever,\n  and your law is true.\n143Trouble and anguish have found me out,\n  but your commandments are my delight.\n144Your testimonies are righteous forever;\n  give me understanding that I may live.\n"}, {"header": "", "verse": "Psalms 119:145-152", "text": "                         Qoph\n145With my whole heart I cry; answer me, O LORD!\n I will keep your statutes.\n146I call to you; save me,\n that I may observe your testimonies.\n147I rise before dawn and cry for help;\n I hope in your words.\n148My eyes are awake before the watches of the\nnight,\n  that I may meditate on your promise.\n149Hear my voice according to your steadfast love;\n  O LORD, according to your justice give me life.\n150They draw near who persecute me with evil\npurpose;\n  they are far from your law.\n151But you are near, O LORD,\n  and all your commandments are true.\n152Long have I known from your testimonies\n  that you have founded them forever.\n\n"}, {"header": "", "verse": "Psalms 119:153-160", "text": "                         Resh\n153Look on my affliction and deliver me,\n for I do not forget your law.\n154Plead my cause and redeem me;\n give me life according to your promise!\n155Salvation is far from the wicked,\n for they do not seek your statutes.\n156Great is your mercy, O LORD;\n give me life according to your rules.\n157Many are my persecutors and my adversaries,\n but I do not swerve from your testimonies.\n158I look at the faithless with disgust,\n because they do not keep your commands.\n159Consider how I love your precepts!\n Give me life according to your steadfast love.\n160The sum of your word is truth,\n  and every one of your righteous rules endures\nforever.\n\n"}, {"header": "                     Sin and Shin\n", "verse": "Psalms 119:161-168", "text": "161Princes persecute me without cause,\n but my heart stands in awe of your words.\n162I rejoice at your word\n like one who finds great spoil.\n163I hate and abhor falsehood,\n but I love your law.\n164Seven times a day I praise you\n for your righteous rules.\n165Great peace have those who love your law;\n nothing can make them stumble.\n166I hope for your salvation, O LORD,\n and I do your commandments.\n167My soul keeps your testimonies;\n I love them exceedingly.\n168I keep your precepts and testimonies,\n for all my ways are before you.\n\n"}, {"header": "", "verse": "Psalms 119:169-176", "text": "                            Taw\n169Let my cry come before you, O LORD;\n give me understanding according to your word!\n170Let my plea come before you;\n deliver me according to your word.\n171My lips will pour forth praise,\n for you teach me your statutes.\n172My tongue will sing of your word,\n for all your commandments are right.\n173Let your hand be ready to help me,\n for I have chosen your precepts.\n174I long for your salvation, O LORD,\n and your law is my delight.\n175Let my soul live and praise you,\n and let your rules help me.\n176I have gone astray like a lost sheep; seek your\nservant,\n for I do not forget your commandments.\n"}, {"header": "             Deliver Me, O LORD\n              A Song of Ascents.\n", "verse": "Psalms 120", "text": "120:1 In my distress I called to the LORD,\n and he answered me.\n2Deliver me, O LORD,\n from lying lips,\n from a deceitful tongue.\n3What shall be given to you,\n and what more shall be done to you,\n you deceitful tongue?\n4A warrior's sharp arrows,\n with glowing coals of the broom tree!\n5Woe to me, that I sojourn in Meshech,\n that I dwell among the tents of Kedar!\n6Too long have I had my dwelling\n among those who hate peace.\n7I am for peace,\n but when I speak, they are for war!\n"}, {"header": "       My Help Comes from the LORD\n             A Song of Ascents.\n", "verse": "Psalms 121", "text": "121:1 I lift up my eyes to the hills.\n From where does my help come?\n2My help comes from the LORD,\n who made heaven and earth.\n3He will not let your foot be moved;\n he who keeps you will not slumber.\n4Behold, he who keeps Israel\n will neither slumber nor sleep.\n5The LORD is your keeper;\n the LORD is your shade on your right hand.\n6The sun shall not strike you by day,\n nor the moon by night.\n7The LORD will keep you from all evil;\n he will keep your life.\n8The LORD will keep\n your going out and your coming in\nfrom this time forth and forevermore.\n   Let Us Go to the House of the LORD\n"}, {"header": "       A Song of Ascents. Of David.\n", "verse": "Psalms 122", "text": "122:1 I was glad when they said to me,\n \"Let us go to the house of the LORD!\"\n2Our feet have been standing\n within your gates, O Jerusalem!\n3Jerusalem-built as a city\n that is bound firmly together,\n4to which the tribes go up,\n  the tribes of the LORD,\nas was decreed for Israel,\n  to give thanks to the name of the LORD.\n5There thrones for judgment were set,\n  the thrones of the house of David.\n6Pray for the peace of Jerusalem!\n \"May they be secure who love you!\n7Peace be within your walls\n and security within your towers!\"\n8For my brothers and companions' sake\n I will say, \"Peace be within you!\"\n9For the sake of the house of the LORD our God,\n I will seek your good.\n  Our Eyes Look to the LORD Our God\n"}, {"header": "           A Song of Ascents.\n", "verse": "Psalms 123", "text": "123:1 To you I lift up my eyes,\n O you who are enthroned in the heavens!\n2Behold, as the eyes of servants\n look to the hand of their master,\nas the eyes of a maidservant\n to the hand of her mistress,\nso our eyes look to the LORD our God,\n till he has mercy upon us.\n3Have mercy upon us, O LORD, have mercy upon\nus,\n  for we have had more than enough of contempt.\n4Our soul has had more than enough\n  of the scorn of those who are at ease,\n  of the contempt of the proud.\n   Our Help Is in the Name of the LORD\n"}, {"header": "       A Song of Ascents. Of David.\n", "verse": "Psalms 124", "text": "124:1 If it had not been the LORD who was on our\nside-\n  let Israel now say-\n2if it had not been the LORD who was on our side\n  when people rose up against us,\n3then they would have swallowed us up alive,\n  when their anger was kindled against us;\n4then the flood would have swept us away,\n  the torrent would have gone over us;\n5then over us would have gone\n  the raging waters.\n6Blessed be the LORD,\n  who has not given us\n  as prey to their teeth!\n7We have escaped like a bird\n  from the snare of the fowlers;\nthe snare is broken,\n  and we have escaped!\n8Our help is in the name of the LORD,\n who made heaven and earth.\n"}, {"header": "     The LORD Surrounds His People\n           A Song of Ascents.\n", "verse": "Psalms 125", "text": "125:1 Those who trust in the LORD are like Mount\nZion,\n  which cannot be moved, but abides forever.\n2As the mountains surround Jerusalem,\n  so the LORD surrounds his people,\n  from this time forth and forevermore.\n3For the scepter of wickedness shall not rest\n  on the land allotted to the righteous,\nlest the righteous stretch out\n  their hands to do wrong.\n4Do good, O LORD, to those who are good,\n  and to those who are upright in their hearts!\n5But those who turn aside to their crooked ways\n  the LORD will lead away with evildoers!\n  Peace be upon Israel!\n"}, {"header": "      Restore Our Fortunes, O LORD\n            A Song of Ascents.\n", "verse": "Psalms 126", "text": "126:1 When the LORD restored the fortunes of\nZion,\n  we were like those who dream.\n2Then our mouth was filled with laughter,\n  and our tongue with shouts of joy;\nthen they said among the nations,\n  \"The LORD has done great things for them.\"\n3The LORD has done great things for us;\n  we are glad.\n4Restore our fortunes, O LORD,\n like streams in the Negeb!\n5Those who sow in tears\n shall reap with shouts of joy!\n6He who goes out weeping,\n  bearing the seed for sowing,\nshall come home with shouts of joy,\n  bringing his sheaves with him.\n"}, {"header": "     Unless the LORD Builds the House\n       A Song of Ascents. Of Solomon.\n", "verse": "Psalms 127", "text": "127:1 Unless the LORD builds the house,\n  those who build it labor in vain.\nUnless the LORD watches over the city,\n  the watchman stays awake in vain.\n2It is in vain that you rise up early\n  and go late to rest,\neating the bread of anxious toil;\n  for he gives to his beloved sleep.\n3Behold, children are a heritage from the LORD,\n the fruit of the womb a reward.\n4Like arrows in the hand of a warrior\n  are the children of one's youth.\n5Blessed is the man\n who fills his quiver with them!\nHe shall not be put to shame\n when he speaks with his enemies in the gate.\nBlessed Is Everyone Who Fears the LORD\n"}, {"header": "            A Song of Ascents.\n", "verse": "Psalms 128", "text": "128:1 Blessed is everyone who fears the LORD,\n  who walks in his ways!\n2You shall eat the fruit of the labor of your hands;\n  you shall be blessed, and it shall be well with you.\n3Your wife will be like a fruitful vine\n  within your house;\nyour children will be like olive shoots\n  around your table.\n4Behold, thus shall the man be blessed\n  who fears the LORD.\n5The LORD bless you from Zion!\n May you see the prosperity of Jerusalem\n all the days of your life!\n6May you see your children's children!\n Peace be upon Israel!\n They Have Afflicted Me from My Youth\n"}, {"header": "          A Song of Ascents.\n", "verse": "Psalms 129", "text": "129:1 \"Greatly have they afflicted me from my\nyouth\"-\n  let Israel now say-\n2\"Greatly have they afflicted me from my youth,\n  yet they have not prevailed against me.\n3The plowers plowed upon my back;\n  they made long their furrows.\"\n4The LORD is righteous;\n  he has cut the cords of the wicked.\n5May all who hate Zion\n  be put to shame and turned backward!\n6Let them be like the grass on the housetops,\n  which withers before it grows up,\n7with which the reaper does not fill his hand\n  nor the binder of sheaves his arms,\n8nor do those who pass by say,\n  \"The blessing of the LORD be upon you!\n  We bless you in the name of the LORD!\"\n"}, {"header": "         My Soul Waits for the Lord\n             A Song of Ascents.\n", "verse": "Psalms 130", "text": "130:1 Out of the depths I cry to you, O LORD!\n 2O Lord, hear my voice!\nLet your ears be attentive\n to the voice of my pleas for mercy!\n3If you, O LORD, should mark iniquities,\n O Lord, who could stand?\n4But with you there is forgiveness,\n that you may be feared.\n5I wait for the LORD, my soul waits,\n and in his word I hope;\n6my soul waits for the Lord\n more than watchmen for the morning,\n more than watchmen for the morning.\n7O Israel, hope in the LORD!\n For with the LORD there is steadfast love,\n and with him is plentiful redemption.\n8And he will redeem Israel\n from all his iniquities.\n"}, {"header": "    I Have Calmed and Quieted My Soul\n        A Song of Ascents. Of David.\n", "verse": "Psalms 131", "text": "131:1 O LORD, my heart is not lifted up;\n   my eyes are not raised too high;\nI do not occupy myself with things\n   too great and too marvelous for me.\n2But I have calmed and quieted my soul,\n   like a weaned child with its mother;\n   like a weaned child is my soul within me.\n3O Israel, hope in the LORD\n from this time forth and forevermore.\n"}, {"header": "         The LORD Has Chosen Zion\n              A Song of Ascents.\n", "verse": "Psalms 132", "text": "132:1 Remember, O LORD, in David's favor,\n all the hardships he endured,\n2how he swore to the LORD\n and vowed to the Mighty One of Jacob,\n3\"I will not enter my house\n or get into my bed,\n4I will not give sleep to my eyes\n or slumber to my eyelids,\n5until I find a place for the LORD,\n a dwelling place for the Mighty One of Jacob.\"\n6Behold, we heard of it in Ephrathah;\n we found it in the fields of Jaar.\n7\"Let us go to his dwelling place;\n let us worship at his footstool!\"\n8Arise, O LORD, and go to your resting place,\n you and the ark of your might.\n9Let your priests be clothed with righteousness,\n and let your saints shout for joy.\n10For the sake of your servant David,\n do not turn away the face of your anointed one.\n11The LORD swore to David a sure oath\n  from which he will not turn back:\n\"One of the sons of your body\n  I will set on your throne.\n12If your sons keep my covenant\n  and my testimonies that I shall teach them,\ntheir sons also forever\n  shall sit on your throne.\"\n13For the LORD has chosen Zion;\n he has desired it for his dwelling place:\n14\"This is my resting place forever;\n here I will dwell, for I have desired it.\n15I will abundantly bless her provisions;\n I will satisfy her poor with bread.\n16Her priests I will clothe with salvation,\n and her saints will shout for joy.\n17There I will make a horn to sprout for David;\n I have prepared a lamp for my anointed.\n18His enemies I will clothe with shame,\n but on him his crown will shine.\"\n"}, {"header": "        When Brothers Dwell in Unity\n        A Song of Ascents. Of David.\n", "verse": "Psalms 133", "text": "133:1 Behold, how good and pleasant it is\n  when brothers dwell in unity! \n2It is like the precious oil on the head,\n  running down on the beard,\non the beard of Aaron,\n  running down on the collar of his robes!\n3It is like the dew of Hermon,\n  which falls on the mountains of Zion!\nFor there the LORD has commanded the blessing,\n  life forevermore.\n"}, {"header": "           Come, Bless the LORD\n             A Song of Ascents.\n", "verse": "Psalms 134", "text": "134:1 Come, bless the LORD, all you servants of\nthe LORD,\n  who stand by night in the house of the LORD!\n2Lift up your hands to the holy place\n  and bless the LORD!\n3May the LORD bless you from Zion,\n he who made heaven and earth!\n"}, {"header": "    Your Name, O LORD, Endures Forever\n", "verse": "Psalms 135", "text": "135:1 Praise the LORD!\nPraise the name of the LORD,\n  give praise, O servants of the LORD,\n2who stand in the house of the LORD,\n  in the courts of the house of our God!\n3Praise the LORD, for the LORD is good;\n  sing to his name, for it is pleasant! \n4For the LORD has chosen Jacob for himself,\n  Israel as his own possession.\n5For I know that the LORD is great,\n and that our Lord is above all gods.\n6Whatever the LORD pleases, he does,\n in heaven and on earth,\n in the seas and all deeps.\n7He it is who makes the clouds rise at the end of the\nearth,\n who makes lightnings for the rain\n and brings forth the wind from his storehouses.\n8He it was who struck down the firstborn of Egypt,\n both of man and of beast;\n9who in your midst, O Egypt,\n  sent signs and wonders\n  against Pharaoh and all his servants;\n10who struck down many nations\n  and killed mighty kings,\n11Sihon, king of the Amorites,\n  and Og, king of Bashan,\n  and all the kingdoms of Canaan,\n12and gave their land as a heritage,\n  a heritage to his people Israel.\n13Your name, O LORD, endures forever,\n  your renown, O LORD, throughout all ages.\n14For the LORD will vindicate his people\n and have compassion on his servants.\n15The idols of the nations are silver and gold,\n the work of human hands.\n16They have mouths, but do not speak;\n they have eyes, but do not see;\n17they have ears, but do not hear,\n nor is there any breath in their mouths.\n18Those who make them become like them,\n so do all who trust in them!\n19O house of Israel, bless the LORD!\n O house of Aaron, bless the LORD!\n20O house of Levi, bless the LORD!\n You who fear the LORD, bless the LORD!\n21Blessed be the LORD from Zion,\n he who dwells in Jerusalem!\nPraise the LORD!\n"}, {"header": "    His Steadfast Love Endures Forever\n", "verse": "Psalms 136-137", "text": "136:1 Give thanks to the LORD, for he is good,\n for his steadfast love endures forever.\n2Give thanks to the God of gods,\n for his steadfast love endures forever.\n3Give thanks to the Lord of lords,\n for his steadfast love endures forever;\n4to him who alone does great wonders,\n for his steadfast love endures forever;\n5to him who by understanding made the heavens,\n for his steadfast love endures forever;\n6to him who spread out the earth above the waters,\n for his steadfast love endures forever;\n7to him who made the great lights,\n for his steadfast love endures forever;\n8the sun to rule over the day,\n for his steadfast love endures forever;\n9the moon and stars to rule over the night,\n for his steadfast love endures forever;\n10to him who struck down the firstborn of Egypt,\n for his steadfast love endures forever;\n11and brought Israel out from among them,\n for his steadfast love endures forever;\n12with a strong hand and an outstretched arm,\n for his steadfast love endures forever;\n13to him who divided the Red Sea in two,\n for his steadfast love endures forever;\n14and made Israel pass through the midst of it,\n for his steadfast love endures forever;\n15but overthrew Pharaoh and his host in the Red\nSea,\n  for his steadfast love endures forever;\n16to him who led his people through the wilderness,\n  for his steadfast love endures forever;\n17to him who struck down great kings,\n for his steadfast love endures forever;\n18and killed mighty kings,\n for his steadfast love endures forever;\n19Sihon, king of the Amorites,\n for his steadfast love endures forever;\n20and Og, king of Bashan,\n for his steadfast love endures forever;\n21and gave their land as a heritage,\n for his steadfast love endures forever;\n22a heritage to Israel his servant,\n for his steadfast love endures forever.\n23It is he who remembered us in our low estate,\n for his steadfast love endures forever;\n24and rescued us from our foes,\n for his steadfast love endures forever;\n25he who gives food to all flesh,\n for his steadfast love endures forever.\n26Give thanks to the God of heaven,\n for his steadfast love endures forever.\n  How Shall We Sing the LORD's Song?\n137:1 By the waters of Babylon,\n  there we sat down and wept,\n  when we remembered Zion.\n2On the willows there\n  we hung up our lyres.\n3For there our captors\n  required of us songs,\nand our tormentors, mirth, saying,\n  \"Sing us one of the songs of Zion!\"\n4How shall we sing the LORD's song\n in a foreign land?\n5If I forget you, O Jerusalem,\n let my right hand forget its skill!\n6Let my tongue stick to the roof of my mouth,\n   if I do not remember you,\nif I do not set Jerusalem\n   above my highest joy!\n7Remember, O LORD, against the Edomites\n the day of Jerusalem,\nhow they said, \"Lay it bare, lay it bare,\n down to its foundations!\"\n8O daughter of Babylon, doomed to be destroyed,\n blessed shall he be who repays you\n with what you have done to us!\n9Blessed shall he be who takes your little ones\n and dashes them against the rock!\n"}, {"header": "          Give Thanks to the LORD\n                 Of David.\n", "verse": "Psalms 138", "text": "138:1 I give you thanks, O LORD, with my whole\nheart;\n  before the gods I sing your praise;\n2I bow down toward your holy temple\n  and give thanks to your name for your steadfast\nlove and your faithfulness,\n  for you have exalted above all things\n  your name and your word.\n3On the day I called, you answered me;\n  my strength of soul you increased.\n4All the kings of the earth shall give you thanks, O\nLORD,\n  for they have heard the words of your mouth,\n5and they shall sing of the ways of the LORD,\n  for great is the glory of the LORD.\n6For though the LORD is high, he regards the lowly,\n  but the haughty he knows from afar.\n7Though I walk in the midst of trouble,\n  you preserve my life;\nyou stretch out your hand against the wrath of my\nenemies,\n  and your right hand delivers me.\n8The LORD will fulfill his purpose for me;\n  your steadfast love, O LORD, endures forever.\n  Do not forsake the work of your hands.\n Search Me, O God, and Know My Heart\n"}, {"header": "   To the choirmaster. A Psalm of David.\n", "verse": "Psalms 139", "text": "139:1 O LORD, you have searched me and known\nme!\n2You know when I sit down and when I rise up;\n  you discern my thoughts from afar.\n3You search out my path and my lying down\n  and are acquainted with all my ways.\n4Even before a word is on my tongue,\n  behold, O LORD, you know it altogether.\n5You hem me in, behind and before,\n  and lay your hand upon me.\n6Such knowledge is too wonderful for me;\n  it is high; I cannot attain it.\n7Where shall I go from your Spirit?\n Or where shall I flee from your presence?\n8If I ascend to heaven, you are there!\n If I make my bed in Sheol, you are there!\n9If I take the wings of the morning\n and dwell in the uttermost parts of the sea,\n10even there your hand shall lead me,\n and your right hand shall hold me.\n11If I say, \"Surely the darkness shall cover me,\n and the light about me be night,\"\n12even the darkness is not dark to you;\n the night is bright as the day,\n for darkness is as light with you.\n13For you formed my inward parts;\n you knitted me together in my mother's womb.\n14I praise you, for I am fearfully and wonderfully\nmade.\nWonderful are your works;\n  my soul knows it very well.\n15My frame was not hidden from you,\nwhen I was being made in secret,\n  intricately woven in the depths of the earth.\n16Your eyes saw my unformed substance;\nin your book were written, every one of them,\n  the days that were formed for me,\n  when as yet there was none of them.\n17How precious to me are your thoughts, O God!\n How vast is the sum of them!\n18If I would count them, they are more than the sand.\n I awake, and I am still with you.\n19Oh that you would slay the wicked, O God!\n O men of blood, depart from me!\n20They speak against you with malicious intent;\n  your enemies take your name in vain! \n21Do I not hate those who hate you, O LORD?\n And do I not loathe those who rise up against you?\n22I hate them with complete hatred;\n I count them my enemies.\n23Search me, O God, and know my heart!\n  Try me and know my thoughts! \n24And see if there be any grievous way in me,\n  and lead me in the way everlasting! \n"}, {"header": "   Deliver Me, O LORD, from Evil Men\n   To the choirmaster. A Psalm of David.\n", "verse": "Psalms 140", "text": "140:1 Deliver me, O LORD, from evil men;\n preserve me from violent men,\n2who plan evil things in their heart\n and stir up wars continually.\n3They make their tongue sharp as a serpent's,\n and under their lips is the venom of asps. Selah\n4Guard me, O LORD, from the hands of the wicked;\n  preserve me from violent men,\n  who have planned to trip up my feet.\n5The arrogant have hidden a trap for me,\n  and with cords they have spread a net;\n  beside the way they have set snares for me. Selah\n6I say to the LORD, You are my God;\n give ear to the voice of my pleas for mercy, O\nLORD!\n7O LORD, my Lord, the strength of my salvation,\n you have covered my head in the day of battle.\n8Grant not, O LORD, the desires of the wicked;\n do not further their evil plot, or they will be\nexalted! Selah\n9As for the head of those who surround me,\n let the mischief of their lips overwhelm them!\n10Let burning coals fall upon them!\n  Let them be cast into fire,\n  into miry pits, no more to rise!\n11Let not the slanderer be established in the land;\n  let evil hunt down the violent man speedily!\n12I know that the LORD will maintain the cause of the\nafflicted,\n  and will execute justice for the needy.\n13Surely the righteous shall give thanks to your\nname;\n  the upright shall dwell in your presence.\n"}, {"header": "             Give Ear to My Voice\n               A Psalm of David.\n", "verse": "Psalms 141", "text": "141:1 O LORD, I call upon you; hasten to me!\n Give ear to my voice when I call to you!\n2Let my prayer be counted as incense before you,\n and the lifting up of my hands as the evening\nsacrifice!\n3Set a guard, O LORD, over my mouth;\n keep watch over the door of my lips!\n4Do not let my heart incline to any evil,\n  to busy myself with wicked deeds\nin company with men who work iniquity,\n  and let me not eat of their delicacies!\n5Let a righteous man strike me-it is a kindness;\n let him rebuke me-it is oil for my head;\n let my head not refuse it.\nYet my prayer is continually against their evil deeds.\n6When their judges are thrown over the cliff,\n then they shall hear my words, for they are\npleasant.\n7As when one plows and breaks up the earth,\n  so shall our bones be scattered at the mouth of\nSheol.\n8But my eyes are toward you, O GOD, my Lord;\n in you I seek refuge; leave me not defenseless! \n9Keep me from the trap that they have laid for me\n and from the snares of evildoers!\n10Let the wicked fall into their own nets,\n while I pass by safely.\n"}, {"header": "              You Are My Refuge\n A Maskil of David, when he was in the\n              cave. A Prayer.\n", "verse": "Psalms 142", "text": "142:1 With my voice I cry out to the LORD;\n with my voice I plead for mercy to the LORD.\n2I pour out my complaint before him;\n I tell my trouble before him.\n3When my spirit faints within me,\n  you know my way!\nIn the path where I walk\n  they have hidden a trap for me.\n4Look to the right and see:\n  there is none who takes notice of me;\nno refuge remains to me;\n  no one cares for my soul.\n5I cry to you, O LORD;\n I say, \"You are my refuge,\n my portion in the land of the living.\"\n6Attend to my cry,\n for I am brought very low!\nDeliver me from my persecutors,\n for they are too strong for me!\n7Bring me out of prison,\n that I may give thanks to your name!\nThe righteous will surround me,\n for you will deal bountifully with me.\n"}, {"header": "            My Soul Thirsts for You\n              A Psalm of David.\n", "verse": "Psalms 143", "text": "143:1 Hear my prayer, O LORD;\n  give ear to my pleas for mercy!\n  In your faithfulness answer me, in your\nrighteousness!\n2Enter not into judgment with your servant,\n  for no one living is righteous before you.\n3For the enemy has pursued my soul;\n  he has crushed my life to the ground;\n  he has made me sit in darkness like those long\ndead.\n4Therefore my spirit faints within me;\n  my heart within me is appalled.\n5I remember the days of old;\n  I meditate on all that you have done;\n  I ponder the work of your hands.\n6I stretch out my hands to you;\n  my soul thirsts for you like a parched land. Selah\n7Answer me quickly, O LORD!\n  My spirit fails!\nHide not your face from me,\n  lest I be like those who go down to the pit.\n8Let me hear in the morning of your steadfast love,\n  for in you I trust.\nMake me know the way I should go,\n  for to you I lift up my soul.\n9Deliver me from my enemies, O LORD!\n  I have fled to you for refuge! \n10Teach me to do your will,\n for you are my God!\nLet your good Spirit lead me\n on level ground!\n11For your name's sake, O LORD, preserve my life!\n In your righteousness bring my soul out of trouble!\n12And in your steadfast love you will cut off my\nenemies,\n and you will destroy all the adversaries of my soul,\n for I am your servant.\n"}, {"header": "          My Rock and My Fortress\n                Of David.\n", "verse": "Psalms 144", "text": "144:1 Blessed be the LORD, my rock,\n  who trains my hands for war,\n  and my fingers for battle;\n2he is my steadfast love and my fortress,\n  my stronghold and my deliverer,\nmy shield and he in whom I take refuge,\n  who subdues peoples under me.\n3O LORD, what is man that you regard him,\n or the son of man that you think of him?\n4Man is like a breath;\n his days are like a passing shadow.\n5Bow your heavens, O LORD, and come down!\n Touch the mountains so that they smoke!\n6Flash forth the lightning and scatter them;\n send out your arrows and rout them!\n7Stretch out your hand from on high;\n rescue me and deliver me from the many waters,\n from the hand of foreigners,\n8whose mouths speak lies\n and whose right hand is a right hand of falsehood.\n9I will sing a new song to you, O God;\n upon a ten-stringed harp I will play to you,\n10who gives victory to kings,\n  who rescues David his servant from the cruel\nsword.\n11Rescue me and deliver me\n  from the hand of foreigners,\nwhose mouths speak lies\n  and whose right hand is a right hand of falsehood.\n12May our sons in their youth\n  be like plants full grown,\nour daughters like corner pillars\n  cut for the structure of a palace;\n13may our granaries be full,\n  providing all kinds of produce;\nmay our sheep bring forth thousands\n  and ten thousands in our fields;\n14may our cattle be heavy with young,\n  suffering no mishap or failure in bearing;\nmay there be no cry of distress in our streets!\n15Blessed are the people to whom such blessings\nfall!\n  Blessed are the people whose God is the LORD!\n"}, {"header": "              Great Is the LORD\n        A Song of Praise. Of David.\n", "verse": "Psalms 145", "text": "\n145:1 I will extol you, my God and King,\n and bless your name forever and ever.\n2Every day I will bless you\n and praise your name forever and ever.\n3Great is the LORD, and greatly to be praised,\n and his greatness is unsearchable.\n4One generation shall commend your works to\nanother,\n  and shall declare your mighty acts.\n5On the glorious splendor of your majesty,\n  and on your wondrous works, I will meditate.\n6They shall speak of the might of your awesome\ndeeds,\n  and I will declare your greatness.\n7They shall pour forth the fame of your abundant\ngoodness\n  and shall sing aloud of your righteousness.\n8The LORD is gracious and merciful,\n slow to anger and abounding in steadfast love.\n9The LORD is good to all,\n and his mercy is over all that he has made.\n10All your works shall give thanks to you, O LORD,\n and all your saints shall bless you!\n11They shall speak of the glory of your kingdom\n and tell of your power,\n12to make known to the children of man your\nmighty deeds,\n  and the glorious splendor of your kingdom.\n13Your kingdom is an everlasting kingdom,\n  and your dominion endures throughout all\ngenerations.\n[The LORD is faithful in all his words\n  and kind in all his works.]\n14The LORD upholds all who are falling\n  and raises up all who are bowed down.\n15The eyes of all look to you,\n  and you give them their food in due season.\n16You open your hand;\n you satisfy the desire of every living thing.\n17The LORD is righteous in all his ways\n and kind in all his works.\n18The LORD is near to all who call on him,\n to all who call on him in truth.\n19He fulfills the desire of those who fear him;\n he also hears their cry and saves them.\n20The LORD preserves all who love him,\n but all the wicked he will destroy.\n21My mouth will speak the praise of the LORD,\n and let all flesh bless his holy name forever and\never.\n"}, {"header": "        Put Not Your Trust in Princes\n", "verse": "Psalms 146", "text": "146:1 Praise the LORD!\nPraise the LORD, O my soul!\n2I will praise the LORD as long as I live;\n  I will sing praises to my God while I have my being.\n3Put not your trust in princes,\n in a son of man, in whom there is no salvation.\n4When his breath departs, he returns to the earth;\n on that very day his plans perish.\n5Blessed is he whose help is the God of Jacob,\n whose hope is in the LORD his God,\n6who made heaven and earth,\n the sea, and all that is in them,\nwho keeps faith forever;\n 7who executes justice for the oppressed,\n who gives food to the hungry.\nThe LORD sets the prisoners free;\n 8the LORD opens the eyes of the blind.\nThe LORD lifts up those who are bowed down;\n the LORD loves the righteous.\n9The LORD watches over the sojourners;\n he upholds the widow and the fatherless,\n but the way of the wicked he brings to ruin.\n10The LORD will reign forever,\n your God, O Zion, to all generations.\nPraise the LORD!\n"}, {"header": "         He Heals the Brokenhearted\n", "verse": "Psalms 147", "text": "147:1 Praise the LORD!\nFor it is good to sing praises to our God;\n  for it is pleasant, and a song of praise is fitting.\n2The LORD builds up Jerusalem;\n  he gathers the outcasts of Israel.\n3He heals the brokenhearted\n  and binds up their wounds.\n4He determines the number of the stars;\n  he gives to all of them their names.\n5Great is our Lord, and abundant in power;\n  his understanding is beyond measure.\n6The LORD lifts up the humble;\n  he casts the wicked to the ground.\n7Sing to the LORD with thanksgiving;\n make melody to our God on the lyre!\n8He covers the heavens with clouds;\n he prepares rain for the earth;\n he makes grass grow on the hills.\n9He gives to the beasts their food,\n and to the young ravens that cry.\n10His delight is not in the strength of the horse,\n nor his pleasure in the legs of a man,\n11but the LORD takes pleasure in those who fear\nhim,\n  in those who hope in his steadfast love.\n12Praise the LORD, O Jerusalem!\n Praise your God, O Zion!\n13For he strengthens the bars of your gates;\n he blesses your children within you.\n14He makes peace in your borders;\n he fills you with the finest of the wheat.\n15He sends out his command to the earth;\n his word runs swiftly.\n16He gives snow like wool;\n he scatters hoarfrost like ashes.\n17He hurls down his crystals of ice like crumbs;\n who can stand before his cold?\n18He sends out his word, and melts them;\n he makes his wind blow and the waters flow.\n19He declares his word to Jacob,\n  his statutes and rules to Israel.\n20He has not dealt thus with any other nation;\n  they do not know his rules.\nPraise the LORD!\n"}, {"header": "        Praise the Name of the LORD\n", "verse": "Psalms 148", "text": "148:1 Praise the LORD!\nPraise the LORD from the heavens;\n praise him in the heights!\n2Praise him, all his angels;\n praise him, all his hosts!\n3Praise him, sun and moon,\n praise him, all you shining stars!\n4Praise him, you highest heavens,\n and you waters above the heavens!\n5Let them praise the name of the LORD!\n For he commanded and they were created.\n6And he established them forever and ever;\n he gave a decree, and it shall not pass away.\n7Praise the LORD from the earth,\n you great sea creatures and all deeps,\n8fire and hail, snow and mist,\n stormy wind fulfilling his word!\n9Mountains and all hills,\n fruit trees and all cedars!\n10Beasts and all livestock,\n creeping things and flying birds!\n11Kings of the earth and all peoples,\n princes and all rulers of the earth!\n12Young men and maidens together,\n old men and children!\n13Let them praise the name of the LORD,\n  for his name alone is exalted;\n  his majesty is above earth and heaven.\n14He has raised up a horn for his people,\n  praise for all his saints,\n  for the people of Israel who are near to him.\nPraise the LORD!\n"}, {"header": "       Sing to the LORD a New Song\n", "verse": "Psalms 149", "text": "149:1 Praise the LORD!\nSing to the LORD a new song,\n  his praise in the assembly of the godly!\n2Let Israel be glad in his Maker;\n  let the children of Zion rejoice in their King!\n3Let them praise his name with dancing,\n  making melody to him with tambourine and lyre!\n4For the LORD takes pleasure in his people;\n  he adorns the humble with salvation.\n5Let the godly exult in glory;\n  let them sing for joy on their beds.\n6Let the high praises of God be in their throats\n  and two-edged swords in their hands,\n7to execute vengeance on the nations\n  and punishments on the peoples,\n8to bind their kings with chains\n  and their nobles with fetters of iron,\n9to execute on them the judgment written!\n  This is honor for all his godly ones.\nPraise the LORD!\n"}, {"header": "     Let Everything Praise the LORD\n", "verse": "Psalms 150", "text": "150:1 Praise the LORD!\nPraise God in his sanctuary;\n praise him in his mighty heavens! \n2Praise him for his mighty deeds;\n praise him according to his excellent greatness!\n3Praise him with trumpet sound;\n praise him with lute and harp!\n4Praise him with tambourine and dance;\n praise him with strings and pipe!\n5Praise him with sounding cymbals;\n praise him with loud clashing cymbals!\n6Let everything that has breath praise the LORD!\nPraise the LORD!\n"}]
